#ifndef UE4SS_SDK_AB_NH_IKLayer_HPP
#define UE4SS_SDK_AB_NH_IKLayer_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_71;                                                          // 0x0004 (size: 0x8)
    FAnimNodeFunctionRef __StructProperty_72;                                         // 0x0010 (size: 0x20)
    FName __NameProperty_73;                                                          // 0x0030 (size: 0x8)
    FName __NameProperty_74;                                                          // 0x0038 (size: 0x8)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0040 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x00C0 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_4;           // 0x00D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;           // 0x0108 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;       // 0x0138 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;        // 0x0168 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;           // 0x0198 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;           // 0x01C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;       // 0x01F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x0228 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig_1;           // 0x0258 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Fabrik;                 // 0x0288 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1; // 0x02B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;        // 0x02E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0318 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x0348 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AGN_PA_LookAt;                        // 0x0378 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x03A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x03D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0408 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1; // 0x0438 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;             // 0x0468 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;        // 0x0498 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                 // 0x04C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x04F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0528 (size: 0x30)

}; // Size: 0x558

class UAB_NH_IKLayer_C : public UBipedIKAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0D30 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0D38 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0D40 (size: 0x8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x0D48 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x0E70 (size: 0x128)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x0F98 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x1018 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x1040 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x1168 (size: 0x128)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x1290 (size: 0x80)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x1310 (size: 0x128)
    FAnimNode_ControlRig AnimGraphNode_ControlRig_1;                                  // 0x1438 (size: 0x4D0)
    FAnimNode_Fabrik AnimGraphNode_Fabrik;                                            // 0x1910 (size: 0x1F0)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x1B00 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x1B20 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x1B48 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x1B68 (size: 0x80)
    FAN_PA_LookAt AGN_PA_LookAt;                                                      // 0x1BE8 (size: 0x198)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x1D80 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x1E00 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x1E28 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x1E50 (size: 0x20)
    FAnimNode_ControlRig AnimGraphNode_ControlRig;                                    // 0x1E70 (size: 0x4D0)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x2340 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x23F8 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x2418 (size: 0x20)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x2438 (size: 0x20)
    bool K2Node_PropertyAccess_3;                                                     // 0x2458 (size: 0x1)
    bool __CustomProperty_IsAttacking_5D427FD8493534C2D8D2D28DDFE52A42;               // 0x2459 (size: 0x1)
    bool __CustomProperty_DrawingWeapon_5D427FD8493534C2D8D2D28DDFE52A42;             // 0x245A (size: 0x1)
    bool __CustomProperty_IsGameplayReady_5D427FD8493534C2D8D2D28DDFE52A42;           // 0x245B (size: 0x1)
    bool __CustomProperty_isPlayer_5D427FD8493534C2D8D2D28DDFE52A42;                  // 0x245C (size: 0x1)
    bool __CustomProperty_IsStopping_5D427FD8493534C2D8D2D28DDFE52A42;                // 0x245D (size: 0x1)
    bool __CustomProperty_IsInDialog_5D427FD8493534C2D8D2D28DDFE52A42;                // 0x245E (size: 0x1)
    bool __CustomProperty_IsTurning_5D427FD8493534C2D8D2D28DDFE52A42;                 // 0x245F (size: 0x1)
    bool __CustomProperty_IsOnSlope_5D427FD8493534C2D8D2D28DDFE52A42;                 // 0x2460 (size: 0x1)
    int32 __CustomProperty_LOD_5D427FD8493534C2D8D2D28DDFE52A42;                      // 0x2464 (size: 0x4)
    bool __CustomProperty_isRiding_5D427FD8493534C2D8D2D28DDFE52A42;                  // 0x2468 (size: 0x1)
    bool __CustomProperty_isCrouching_5D427FD8493534C2D8D2D28DDFE52A42;               // 0x2469 (size: 0x1)
    bool __CustomProperty_isTraversing_5D427FD8493534C2D8D2D28DDFE52A42;              // 0x246A (size: 0x1)
    double __CustomProperty_Enable_FootIKs_5D427FD8493534C2D8D2D28DDFE52A42;          // 0x2470 (size: 0x8)
    bool __CustomProperty_isMoving_5D427FD8493534C2D8D2D28DDFE52A42;                  // 0x2478 (size: 0x1)
    bool __CustomProperty_isTargeting_5D427FD8493534C2D8D2D28DDFE52A42;               // 0x2479 (size: 0x1)
    FGameplayTag __CustomProperty_Weapon Tag_5D427FD8493534C2D8D2D28DDFE52A42;        // 0x247C (size: 0x8)
    bool __CustomProperty_isGrounded_5D427FD8493534C2D8D2D28DDFE52A42;                // 0x2484 (size: 0x1)
    double __CustomProperty_Ch_Speed_5D427FD8493534C2D8D2D28DDFE52A42;                // 0x2488 (size: 0x8)
    bool __CustomProperty_ThresholdOn_EC9D9F75490044CFE07152AFE23E4B00;               // 0x2490 (size: 0x1)
    bool __CustomProperty_IsInDialog_EC9D9F75490044CFE07152AFE23E4B00;                // 0x2491 (size: 0x1)
    bool __CustomProperty_HasWeapon_EC9D9F75490044CFE07152AFE23E4B00;                 // 0x2492 (size: 0x1)
    double __CustomProperty_Enable_CR_EC9D9F75490044CFE07152AFE23E4B00;               // 0x2498 (size: 0x8)
    FRotator __CustomProperty_RotationVector_EC9D9F75490044CFE07152AFE23E4B00;        // 0x24A0 (size: 0x18)
    FVector __CustomProperty_LookAtLocation_EC9D9F75490044CFE07152AFE23E4B00;         // 0x24B8 (size: 0x18)
    bool IsDrawingWeapon;                                                             // 0x24D0 (size: 0x1)
    bool IsAttacking;                                                                 // 0x24D1 (size: 0x1)
    bool isPlayer;                                                                    // 0x24D2 (size: 0x1)
    bool IsStopping;                                                                  // 0x24D3 (size: 0x1)
    bool IsOnSlope;                                                                   // 0x24D4 (size: 0x1)
    bool HasWeapon;                                                                   // 0x24D5 (size: 0x1)
    bool IsTurning;                                                                   // 0x24D6 (size: 0x1)
    bool isInDialog;                                                                  // 0x24D7 (size: 0x1)
    double ArmL_Corr;                                                                 // 0x24D8 (size: 0x8)
    double ArmR_Corr;                                                                 // 0x24E0 (size: 0x8)
    double AlphaArmL;                                                                 // 0x24E8 (size: 0x8)
    double AlphaArmR;                                                                 // 0x24F0 (size: 0x8)
    EStance DesiredStance;                                                            // 0x24F8 (size: 0x1)
    EMovementState MovementState;                                                     // 0x24F9 (size: 0x1)
    double SpineCorrAlpha;                                                            // 0x2500 (size: 0x8)
    double CharacterSpeed;                                                            // 0x2508 (size: 0x8)
    double AngleBwVectors;                                                            // 0x2510 (size: 0x8)
    FGameplayTag WeaponTag;                                                           // 0x2518 (size: 0x8)
    bool ShouldMove;                                                                  // 0x2520 (size: 0x1)
    bool isTargeting;                                                                 // 0x2521 (size: 0x1)
    FVector InitialPelvisLocation;                                                    // 0x2528 (size: 0x18)
    double DisableHandIK_L;                                                           // 0x2540 (size: 0x8)
    double DisableHandIK_R;                                                           // 0x2548 (size: 0x8)
    FVector CurrentPelvisLocation;                                                    // 0x2550 (size: 0x18)
    FLookAtConfig ConfigurationTester;                                                // 0x2568 (size: 0x30)

    void IK(FPoseLink InPose, bool isTargeting, bool ShouldMove, FGameplayTag WeaponTag, FName weaponSkill, FName ItemState, double AngleBwVectors, double CharacterSpeed, double SpineCorrAlpha, EMovementState MovementState, EStance DesiredStance, double AlphaArmR, double AlphaArmL, double ArmR_Corr, double ArmL_Corr, bool isInDialog, bool IsTurning, int32 LOD, bool HasWeapon, bool IsInSecondPhase, double SlopeAngle, bool IsOnSlope, bool IsStopping, bool isPlayer, bool IsAttacking, bool IsDrawingWeapon, FPoseLink& IK);
    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_NH_IKLayer_AnimGraphNode_Fabrik_D9907FA44E3F4E337E413EAE342E3D99();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_NH_IKLayer_AnimGraphNode_ControlRig_EC9D9F75490044CFE07152AFE23E4B00();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_NH_IKLayer_AnimGraphNode_ModifyBone_420691D44195A1653E29FA8040154A84();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_NH_IKLayer_AnimGraphNode_ControlRig_5D427FD8493534C2D8D2D28DDFE52A42();
    void ExecuteUbergraph_AB_NH_IKLayer(int32 EntryPoint);
}; // Size: 0x2598

#endif
