#ifndef UE4SS_SDK_CR_Human_IK_HPP
#define UE4SS_SDK_CR_Human_IK_HPP

class UCR_Human_IK_C : public UControlRig
{
    double FloorDownSearchDistance;                                                   // 0x0AA8 (size: 0x8)
    double FloorUpSearchDistance;                                                     // 0x0AB0 (size: 0x8)
    double AdditionalFeetOffset;                                                      // 0x0AB8 (size: 0x8)
    double Foot_L_TargetOffsetZ;                                                      // 0x0AC0 (size: 0x8)
    bool Foot_L_FloorFound;                                                           // 0x0AC8 (size: 0x1)
    double Foot_R_TargetOffsetZ;                                                      // 0x0AD0 (size: 0x8)
    bool Foot_R_FloorFound;                                                           // 0x0AD8 (size: 0x1)
    double Pelvis_TargetOffsetZ;                                                      // 0x0AE0 (size: 0x8)
    double Foot_L_CurrentOffset;                                                      // 0x0AE8 (size: 0x8)
    double Foot_R_CurrentOffset;                                                      // 0x0AF0 (size: 0x8)
    FVector Foot_L_TargetOffsetNormal;                                                // 0x0AF8 (size: 0x18)
    FVector Foot_R_TargetOffsetNormal;                                                // 0x0B10 (size: 0x18)
    FRigElementKey Item;                                                              // 0x0B28 (size: 0xC)
    bool FootL_FloorHit;                                                              // 0x0B34 (size: 0x1)
    bool FootR_FloorHit;                                                              // 0x0B35 (size: 0x1)
    FRotator FootL_NormalAngle;                                                       // 0x0B38 (size: 0x18)
    FRotator FootR_NormalAngle;                                                       // 0x0B50 (size: 0x18)
    double Ch_Speed;                                                                  // 0x0B68 (size: 0x8)
    FVector L_LegHitNormal;                                                           // 0x0B70 (size: 0x18)
    FVector R_LegHitNormal;                                                           // 0x0B88 (size: 0x18)
    FQuat R_FootRotation;                                                             // 0x0BA0 (size: 0x20)
    FRotator R_AimMath_Result;                                                        // 0x0BC0 (size: 0x18)
    FRotator R_LegFinalRot;                                                           // 0x0BD8 (size: 0x18)
    FQuat L_FootRotation;                                                             // 0x0BF0 (size: 0x20)
    FRotator L_AimMath_Result;                                                        // 0x0C10 (size: 0x18)
    FRotator L_LegFinalRot;                                                           // 0x0C28 (size: 0x18)
    FRotator BallRotation;                                                            // 0x0C40 (size: 0x18)
    double RootOffsetZ;                                                               // 0x0C58 (size: 0x8)
    FTransform InterpRootTransformGlobalSpace;                                        // 0x0C60 (size: 0x60)
    bool isGrounded;                                                                  // 0x0CC0 (size: 0x1)
    FGameplayTag Weapon Tag;                                                          // 0x0CC4 (size: 0x8)
    bool isTargeting;                                                                 // 0x0CCC (size: 0x1)
    bool IsMoving;                                                                    // 0x0CCD (size: 0x1)
    FRotator FinalBallRot;                                                            // 0x0CD0 (size: 0x18)
    double Leg_L_Length;                                                              // 0x0CE8 (size: 0x8)
    double Leg_R_Length;                                                              // 0x0CF0 (size: 0x8)
    double Enable_FootIKs;                                                            // 0x0CF8 (size: 0x8)
    bool isTraversing;                                                                // 0x0D00 (size: 0x1)
    FQuat CurrentFloorNormal;                                                         // 0x0D10 (size: 0x20)
    bool IsCrouching;                                                                 // 0x0D30 (size: 0x1)
    bool isRiding;                                                                    // 0x0D31 (size: 0x1)
    double TimeSinceLastTick;                                                         // 0x0D38 (size: 0x8)
    bool L_ToeHit;                                                                    // 0x0D40 (size: 0x1)
    bool R_ToeHit;                                                                    // 0x0D41 (size: 0x1)
    int32 LOD;                                                                        // 0x0D44 (size: 0x4)
    FVector L_FootLocation;                                                           // 0x0D48 (size: 0x18)
    FVector R_FootLocation;                                                           // 0x0D60 (size: 0x18)
    double ForwardSlopeAngle;                                                         // 0x0D78 (size: 0x8)
    bool L_FootInFront;                                                               // 0x0D80 (size: 0x1)
    bool R_FootInFront;                                                               // 0x0D81 (size: 0x1)
    double LFoot_FloorAngle;                                                          // 0x0D88 (size: 0x8)
    double RFoot_FloorAngle;                                                          // 0x0D90 (size: 0x8)
    bool IsOnSlope;                                                                   // 0x0D98 (size: 0x1)
    bool FootL_Locked;                                                                // 0x0D99 (size: 0x1)
    bool FootR_Locked;                                                                // 0x0D9A (size: 0x1)
    double Foot_L_LockedOffsetZ;                                                      // 0x0DA0 (size: 0x8)
    double Foot_L_OffsetZ;                                                            // 0x0DA8 (size: 0x8)
    FVector Hit_L_OffsetLocked;                                                       // 0x0DB0 (size: 0x18)
    FVector Hit_L_Offset;                                                             // 0x0DC8 (size: 0x18)
    double Foot_R_LockedOffsetZ;                                                      // 0x0DE0 (size: 0x8)
    double Foot_R_OffsetZ;                                                            // 0x0DE8 (size: 0x8)
    FVector Hit_R_OffsetLocked;                                                       // 0x0DF0 (size: 0x18)
    FVector Hit_R_Offset;                                                             // 0x0E08 (size: 0x18)
    FVector Hit_L_LockedNormal;                                                       // 0x0E20 (size: 0x18)
    FVector Hit_R_LockedNormal;                                                       // 0x0E38 (size: 0x18)
    double SideSlopeAngle;                                                            // 0x0E50 (size: 0x8)
    FVector LHitLocation;                                                             // 0x0E58 (size: 0x18)
    bool IsTurning;                                                                   // 0x0E70 (size: 0x1)
    bool isInDialog;                                                                  // 0x0E71 (size: 0x1)
    bool IsStopping;                                                                  // 0x0E72 (size: 0x1)
    double FootOffsetLockDelay;                                                       // 0x0E78 (size: 0x8)
    bool isPlayer;                                                                    // 0x0E80 (size: 0x1)
    bool IsGameplayReady;                                                             // 0x0E81 (size: 0x1)
    bool DrawingWeapon;                                                               // 0x0E82 (size: 0x1)
    bool IsAttacking;                                                                 // 0x0E83 (size: 0x1)

}; // Size: 0xE84

#endif
