#ifndef UE4SS_SDK_DoorStandard_Right_Animbp_HPP
#define UE4SS_SDK_DoorStandard_Right_Animbp_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_359;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_360;                                                         // 0x000C (size: 0x8)
    int32 __IntProperty_361;                                                          // 0x0014 (size: 0x4)
    FName __NameProperty_362;                                                         // 0x0018 (size: 0x8)
    int32 __IntProperty_363;                                                          // 0x0020 (size: 0x4)
    FName __NameProperty_364;                                                         // 0x0024 (size: 0x8)
    int32 __IntProperty_365;                                                          // 0x002C (size: 0x4)
    FName __NameProperty_366;                                                         // 0x0030 (size: 0x8)
    int32 __IntProperty_367;                                                          // 0x0038 (size: 0x4)
    FName __NameProperty_368;                                                         // 0x003C (size: 0x8)
    int32 __IntProperty_369;                                                          // 0x0044 (size: 0x4)
    FName __NameProperty_370;                                                         // 0x0048 (size: 0x8)
    int32 __IntProperty_371;                                                          // 0x0050 (size: 0x4)
    FName __NameProperty_372;                                                         // 0x0054 (size: 0x8)
    int32 __IntProperty_373;                                                          // 0x005C (size: 0x4)
    class UBlendProfile* __BlendProfile_374;                                          // 0x0060 (size: 0x8)
    class UCurveFloat* __CurveFloat_375;                                              // 0x0068 (size: 0x8)
    EAlphaBlendOption __EnumProperty_376;                                             // 0x0070 (size: 0x1)
    EBlendListTransitionType __EnumProperty_377;                                      // 0x0071 (size: 0x1)
    TArray<float> __ArrayProperty_378;                                                // 0x0078 (size: 0x10)
    float __FloatProperty_379;                                                        // 0x0088 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_380;                               // 0x008C (size: 0x2C)
    float __FloatProperty_381;                                                        // 0x00B8 (size: 0x4)
    bool __BoolProperty_382;                                                          // 0x00BC (size: 0x1)
    EAnimSyncMethod __EnumProperty_383;                                               // 0x00BD (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_384;                             // 0x00BE (size: 0x1)
    FName __NameProperty_385;                                                         // 0x00C0 (size: 0x8)
    FName __NameProperty_386;                                                         // 0x00C8 (size: 0x8)
    int32 __IntProperty_387;                                                          // 0x00D0 (size: 0x4)
    FName __NameProperty_388;                                                         // 0x00D4 (size: 0x8)
    FName __NameProperty_389;                                                         // 0x00DC (size: 0x8)
    int32 __IntProperty_390;                                                          // 0x00E4 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_391;                                        // 0x00E8 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0108 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0188 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x01A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;    // 0x01D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;    // 0x0200 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;    // 0x0230 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;    // 0x0260 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x0290 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x02C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x02F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x0320 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x0350 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x0380 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x03B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x03E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x0410 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x0440 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x0470 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x04A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;      // 0x04D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;          // 0x0500 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;      // 0x0530 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;          // 0x0560 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;      // 0x0590 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;          // 0x05C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;      // 0x05F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;          // 0x0620 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;      // 0x0650 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt_3;       // 0x0680 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;      // 0x06B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;       // 0x06E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x0710 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;       // 0x0740 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;       // 0x0770 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt_2;       // 0x07A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;       // 0x07D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x0800 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x0830 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x0860 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt_1;       // 0x0890 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x08C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x08F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0920 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0950 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByInt;         // 0x0980 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x09B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x09E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0A10 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0A40 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0A70 (size: 0x30)

}; // Size: 0xAA0

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    int32 __IntProperty;                                                              // 0x0004 (size: 0x4)
    int32 __IntProperty_0;                                                            // 0x0008 (size: 0x4)
    int32 __IntProperty_1;                                                            // 0x000C (size: 0x4)
    int32 __IntProperty_2;                                                            // 0x0010 (size: 0x4)

}; // Size: 0x14

class UDoorStandard_Right_Animbp_C : public UDoorAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03C0 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x03C8 (size: 0x14)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x03E0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03E8 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03F0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0410 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0438 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0460 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0488 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x04B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x04D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0500 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0528 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0578 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x05A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x05C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x05F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0668 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x0690 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x06D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x06F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x0740 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x0760 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x07A8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x07C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x0810 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x0830 (size: 0x48)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_3;                          // 0x0878 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x08C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x0908 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x0950 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x0970 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x09B8 (size: 0x48)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2;                          // 0x0A00 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x0A48 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x0A90 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x0AB0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0AF8 (size: 0x48)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_1;                          // 0x0B40 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x0B88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x0BD0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0BF0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0C38 (size: 0x48)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt;                            // 0x0C80 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x0CC8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x0D10 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x0D30 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x0D50 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x0E18 (size: 0x48)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_059579ED42367F7874305CB5E0320497();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_E670A5D1492BBE9DB5DCE3A7DA51EFFC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_5C15C33541D58614B3297DB434B0F149();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_27A97DA140ED7251C5F53783D800D639();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_53843AAF424C0F99152D8B87C09F14E2();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_386F17D14122C40D3C64C8ADBAC93F15();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_4A81E513438566A3917945A7438FDA7D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_663087834C1D58BCBE0B7394DCDC1F38();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_5314C9704E3AC9DA9321EBA596615780();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_9A0C1AF148E7F3C22A03B38F76D8C604();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_138C9A234B47791F62455DB91BC65C0F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_CBEAF8B94DC0E39BD8D9F99E42275DCD();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_A13C8FB74ED22F904EC47C9BA5D95EDE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_7CB970F24FDAD31780D939B1F6B7D145();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_AFD9E6344DFF07507678128BC2FE60B9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_DoorStandard_Right_Animbp_AnimGraphNode_TransitionResult_081A8D3A48DD193ECFB31582B82514C8();
    void AnimNotify_EndIdleEvent();
    void ExecuteUbergraph_DoorStandard_Right_Animbp(int32 EntryPoint);
}; // Size: 0xE60

#endif
