#ifndef UE4SS_SDK_G1R_HPP
#define UE4SS_SDK_G1R_HPP

#include "G1R_enums.hpp"

struct FAIAssessmentResponseRule
{
    FAssessmentBits MaskRequiredTrueConditions;                                       // 0x0000 (size: 0x20)
    FAssessmentBits MaskRequiredFalseConditions;                                      // 0x0020 (size: 0x20)
    FGameplayTagContainer RequireEventMustHaveAllExtraTags;                           // 0x0040 (size: 0x20)
    FGameplayTagContainer RequireEventMustNotHaveAnyExtraTags;                        // 0x0060 (size: 0x20)
    TArray<class UAIEventResponse*> Responses;                                        // 0x0080 (size: 0x10)

}; // Size: 0x90

struct FAIAssessmentResponseRuleList
{
    TArray<FAIAssessmentResponseRule> Rules;                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAIAssessmentResponseRules
{
    TMap<class FGameplayTag, class FAIAssessmentResponseRuleList> Lists;              // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FAICombatTargetScoringEntryDescription
{
    FString Description;                                                              // 0x0000 (size: 0x10)
    float ScoreChange;                                                                // 0x0010 (size: 0x4)
    float Weight;                                                                     // 0x0014 (size: 0x4)
    bool bVetoUsage;                                                                  // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FAIInteractionBinding
{
    FGameplayTag TagParent;                                                           // 0x0000 (size: 0x8)
    FString Prefix;                                                                   // 0x0008 (size: 0x10)
    bool bIsVerb;                                                                     // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FAIItemActionScoringEntryDescription
{
    FString Description;                                                              // 0x0000 (size: 0x10)
    float ScoreChange;                                                                // 0x0010 (size: 0x4)
    bool bVetoUsage;                                                                  // 0x0014 (size: 0x1)
    bool bMultiplier;                                                                 // 0x0015 (size: 0x1)

}; // Size: 0x18

struct FAIItemActionScoringEntryGroup
{
    TSet<UAIItemActionScoringEntry*> ItemScoringEntries;                              // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FAIMessageGatherGroupsOfClass
{
    TSubclassOf<class UGothicAIGroup> Group;                                          // 0x0000 (size: 0x8)
    TSet<UGothicAIGroup*> Found;                                                      // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FAIMessageGatherStatesOfClass
{
    TSubclassOf<class UCharacterAIState> State;                                       // 0x0000 (size: 0x8)
    TArray<class UCharacterAIState*> Found;                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAIMessageTalkRequest
{
}; // Size: 0x1

struct FAIMessageWeaponDrawn
{
}; // Size: 0x1

struct FAISpawnpointConfig : public FSpawnpointConfig
{
    TSubclassOf<class USpawnAIAgentDefinition> m_SpawningDefinition;                  // 0x0070 (size: 0x8)

}; // Size: 0x80

struct FAISpawnpointConfig_Ambient : public FAISpawnpointConfig
{
    uint8 m_MinSpawnCount;                                                            // 0x0078 (size: 0x1)
    uint8 m_MaxSpawnCount;                                                            // 0x0079 (size: 0x1)
    float m_SpawningRadius;                                                           // 0x007C (size: 0x4)

}; // Size: 0x80

struct FAIWorldEventRequirements : public FInteractionSpotRequirements
{
    TSubclassOf<class UAIWorldEvent> WorldEventClass;                                 // 0x0038 (size: 0x8)
    bool bAllowWhenActive;                                                            // 0x0040 (size: 0x1)
    bool bAllowWhenInactive;                                                          // 0x0041 (size: 0x1)
    bool bAllowWhenPending;                                                           // 0x0042 (size: 0x1)

}; // Size: 0x48

struct FASCodegenTestStruct
{
    int32 IntValue;                                                                   // 0x0000 (size: 0x4)
    float FloatValue;                                                                 // 0x0004 (size: 0x4)
    FString StringValue;                                                              // 0x0008 (size: 0x10)
    FName NameValue;                                                                  // 0x0018 (size: 0x8)
    bool BoolValue;                                                                   // 0x0020 (size: 0x1)
    uint8 ByteValue;                                                                  // 0x0021 (size: 0x1)
    EASCodegenTestEnum EnumValue;                                                     // 0x0022 (size: 0x1)

}; // Size: 0x28

struct FASCodegenTestStructContainer
{
    FASCodegenTestStruct A;                                                           // 0x0000 (size: 0x28)
    int32 IntValue;                                                                   // 0x0028 (size: 0x4)
    FASCodegenTestStruct B;                                                           // 0x0030 (size: 0x28)

}; // Size: 0x58

struct FAbilityTaskCameraFadeSetup
{
    float m_Duration;                                                                 // 0x0000 (size: 0x4)
    FLinearColor M_Color;                                                             // 0x0004 (size: 0x10)
    float m_StartAlpha;                                                               // 0x0014 (size: 0x4)
    float m_TargetAlpha;                                                              // 0x0018 (size: 0x4)
    bool m_FadeAudio;                                                                 // 0x001C (size: 0x1)
    EAbilityTaskCameraFadeSetupLerpType m_LerpType;                                   // 0x001D (size: 0x1)
    float m_LerpParam1;                                                               // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FActorLightingChannels
{
    class AActor* OwningActor;                                                        // 0x0000 (size: 0x8)
    TMap<class UPrimitiveComponent*, class FLightingChannels> OriginalLightingChannels; // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FAgentAsyncPath
{
}; // Size: 0xB8

struct FAgentAsyncRaycast
{
}; // Size: 0x18

struct FAgentPathResult
{
}; // Size: 0x50

struct FAgentPerceptionHandlers
{
}; // Size: 0x6988

struct FAgentRaycastResult
{
}; // Size: 0x38

struct FAimingAssistance
{
    bool m_enableAimingAssistance;                                                    // 0x0000 (size: 0x1)
    float m_MaxTurnAngle;                                                             // 0x0004 (size: 0x4)
    float m_MaxDistance;                                                              // 0x0008 (size: 0x4)
    float m_MinDistance;                                                              // 0x000C (size: 0x4)
    float m_DetectionRadius;                                                          // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FAlkFilterWidgetEntry
{
    FGameplayTag m_FilterTag;                                                         // 0x0000 (size: 0x8)
    TSoftObjectPtr<UTexture2D> m_IconImage;                                           // 0x0008 (size: 0x28)
    FText m_DisplayName;                                                              // 0x0030 (size: 0x10)
    FText m_Description;                                                              // 0x0040 (size: 0x10)
    EAlkFilterWidgetEntryVisibility m_Visibility;                                     // 0x0050 (size: 0x1)
    bool m_CanBeMarkedUnseen;                                                         // 0x0051 (size: 0x1)
    int32 m_SortOrder;                                                                // 0x0054 (size: 0x4)

}; // Size: 0x58

struct FAlkInputAction
{
    FDataTableRowHandle m_DataTableRowHandle;                                         // 0x0000 (size: 0x10)
    bool m_IsPersistent;                                                              // 0x0010 (size: 0x1)
    bool m_ConsumeInput;                                                              // 0x0011 (size: 0x1)

}; // Size: 0x20

struct FArcheryAccuracyParams
{
    float m_MaxMovementSpeed;                                                         // 0x0000 (size: 0x4)
    float m_MaxBowStringStretch;                                                      // 0x0004 (size: 0x4)
    float m_MinBowStringStretch;                                                      // 0x0008 (size: 0x4)
    float m_SpeedWhenMinStretch;                                                      // 0x000C (size: 0x4)
    float m_SpeedWhenMaxStretch;                                                      // 0x0010 (size: 0x4)
    FArcherySkillParams m_UntrainedSkillPerformance;                                  // 0x0014 (size: 0x14)
    FArcherySkillParams m_TrainedSkillPerformance;                                    // 0x0028 (size: 0x14)
    FArcherySkillParams m_MasterSkillPerformance;                                     // 0x003C (size: 0x14)

}; // Size: 0x50

struct FArcherySkillParams
{
    float m_DrawAnimationRate;                                                        // 0x0000 (size: 0x4)
    float m_ReleaseAndNotchArrowOntoBowAnimationRate;                                 // 0x0004 (size: 0x4)
    float m_DeviationRadius;                                                          // 0x0008 (size: 0x4)
    float m_DeviationMaxDistance;                                                     // 0x000C (size: 0x4)
    float m_MaximumResistanceTimeWhileDrawing;                                        // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FAreaSpellVFXParams
{
    float Duration;                                                                   // 0x0000 (size: 0x4)
    float MaxLength;                                                                  // 0x0004 (size: 0x4)
    float SpreadAngle;                                                                // 0x0008 (size: 0x4)
    float Height_Emitter_Size;                                                        // 0x000C (size: 0x4)
    float Width_Emitter_Size;                                                         // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FArrayAbilitySpecHandles
{
}; // Size: 0x10

struct FArrayElementHandle
{
}; // Size: 0x8

struct FArrowData
{
    class AActor* mArrow;                                                             // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FArrowImGuiData
{
}; // Size: 0x40

struct FAssessmentBits
{
}; // Size: 0x20

struct FAttachedItem
{
    EInventoryTypes m_ItemInvType;                                                    // 0x0000 (size: 0x1)
    int32 m_ItemInvSlot;                                                              // 0x0004 (size: 0x4)
    EVisualCarrySlot m_ItemCarrySlot;                                                 // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FAttributeSetRecord
{
    UClass* m_Class;                                                                  // 0x0000 (size: 0x8)
    TMap<FString, float> m_ComponentData;                                             // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FBiomeWeatherProbabilities
{
    TMap<class EBiome, class FWeatherProbability> WeatherProbabilities;               // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FBlockState
{
}; // Size: 0x1

struct FBloodCharacterContainer
{
    TArray<TSoftClassPtr<AGothicCharacter>> Characters;                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBloodCharacterData
{
    FLinearColor Color;                                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBloodDecalUnit
{
}; // Size: 0x18

struct FBoneFeetData
{
    FVector4 FeetTextureSize;                                                         // 0x0000 (size: 0x20)
    class UTexture2D* Diffuse;                                                        // 0x0020 (size: 0x8)
    class UTexture2D* Normal;                                                         // 0x0028 (size: 0x8)
    class UTexture2D* AO;                                                             // 0x0030 (size: 0x8)

}; // Size: 0x40

struct FBoneNames
{
    FName Root;                                                                       // 0x0000 (size: 0x8)
    FName Head;                                                                       // 0x0008 (size: 0x8)
    FName Pelvis;                                                                     // 0x0010 (size: 0x8)
    FName Chest;                                                                      // 0x0018 (size: 0x8)
    FName FootL;                                                                      // 0x0020 (size: 0x8)
    FName FootR;                                                                      // 0x0028 (size: 0x8)
    FName HandL;                                                                      // 0x0030 (size: 0x8)
    FName HandR;                                                                      // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FBoneTrackedData
{
    bool InvertX;                                                                     // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FBonesConstraints
{
    FPhysicalAnimationData m_PhysicalAnimationData;                                   // 0x0000 (size: 0x24)
    bool m_usePhysicalAnimation;                                                      // 0x0024 (size: 0x1)
    TArray<FName> m_Bones;                                                            // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FBonesSettings : public FTableRowBase
{
    FBoneNames m_BoneNames;                                                           // 0x0008 (size: 0x40)
    float m_SpinePelvisBoneAmount;                                                    // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FBookVisualConfiguration
{
    TSoftObjectPtr<UTexture2D> m_LeftBorder;                                          // 0x0000 (size: 0x28)
    TSoftObjectPtr<UTexture2D> m_RightBorder;                                         // 0x0028 (size: 0x28)
    TSoftObjectPtr<UTexture2D> m_TopLeftCorner;                                       // 0x0050 (size: 0x28)
    TSoftObjectPtr<UTexture2D> m_TopRightCorner;                                      // 0x0078 (size: 0x28)
    TSoftObjectPtr<UTexture2D> m_BottomLeftCorner;                                    // 0x00A0 (size: 0x28)
    TSoftObjectPtr<UTexture2D> m_BottomRightCorner;                                   // 0x00C8 (size: 0x28)
    TSoftObjectPtr<UTexture2D> m_CoverLogo;                                           // 0x00F0 (size: 0x28)
    TSoftObjectPtr<UTexture2D> m_BackgroundTexture;                                   // 0x0118 (size: 0x28)
    FColor m_BookTintColor;                                                           // 0x0140 (size: 0x4)
    int32 m_BookDamageState;                                                          // 0x0144 (size: 0x4)
    TSoftObjectPtr<UFont> m_BookTitleFont;                                            // 0x0148 (size: 0x28)
    float m_BookTitleFontSize;                                                        // 0x0170 (size: 0x4)
    FLinearColor m_BookTitleColor;                                                    // 0x0174 (size: 0x10)
    float m_BookTitleOpacity;                                                         // 0x0184 (size: 0x4)
    EHorizontalAlignmenet m_TitleHorizontalAlignment;                                 // 0x0188 (size: 0x1)
    EVerticalAlignmenet m_TitleVerticalAlignment;                                     // 0x0189 (size: 0x1)
    float m_BookTitleShadowIntensity;                                                 // 0x018C (size: 0x4)
    float m_BookTitleWearIntensity;                                                   // 0x0190 (size: 0x4)

}; // Size: 0x198

struct FBoughtArmorUpgrades
{
    TSubclassOf<class UArmorDefinition> Armor;                                        // 0x0000 (size: 0x8)
    TArray<class TSubclassOf<UArmorUpgradeDefinition>> AvailableUpgrades;             // 0x0008 (size: 0x10)
    TArray<class TSubclassOf<UArmorUpgradeDefinition>> BoughtUpgrades;                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FBudgetSystemWorkloadConfig
{
    FName WorkloadName;                                                               // 0x0000 (size: 0x8)
    double SecondsPerFrame;                                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FBufferAction
{
}; // Size: 0x10

struct FButtonWidget_SecondaryActionSettings
{
    double m_PressTime;                                                               // 0x0000 (size: 0x8)
    double m_HoldTime;                                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCacheCharacterData
{
}; // Size: 0x68

struct FCacheGroundedConfigData
{
}; // Size: 0x14

struct FCacheLocomotionData
{
    class UCurveFloat* DiagonalScaleAmountCurve;                                      // 0x0090 (size: 0x8)
    class UCurveFloat* StrideBlendNWalk;                                              // 0x0098 (size: 0x8)
    class UCurveFloat* StrideBlendNRun;                                               // 0x00A0 (size: 0x8)
    class UCurveFloat* StrideBlendCWalk;                                              // 0x00A8 (size: 0x8)
    class UCurveFloat* StrideBlendSwimmingWalk;                                       // 0x00B0 (size: 0x8)
    class UCurveFloat* StrideBlendSwimmingRun;                                        // 0x00B8 (size: 0x8)
    class UCurveFloat* StrideBlendDiveWalk;                                           // 0x00C0 (size: 0x8)
    class UCurveFloat* LandPredictionCurve;                                           // 0x00C8 (size: 0x8)
    class UCurveFloat* LeanInAirCurve;                                                // 0x00D0 (size: 0x8)
    class UCurveVector* YawOffsetFBCurve;                                             // 0x00D8 (size: 0x8)
    class UCurveVector* YawOffsetLRCurve;                                             // 0x00E0 (size: 0x8)

}; // Size: 0xE8

struct FCacheProxyData
{
}; // Size: 0x1B0

struct FCameraBehaviour
{
    FVector m_SocketOffset;                                                           // 0x0000 (size: 0x18)
    FVector m_SocketMinCombatOffset;                                                  // 0x0018 (size: 0x18)
    float m_ArmLength;                                                                // 0x0030 (size: 0x4)
    float m_Fov;                                                                      // 0x0034 (size: 0x4)
    float m_LagSpeed;                                                                 // 0x0038 (size: 0x4)
    float m_RotationLagSpeed;                                                         // 0x003C (size: 0x4)
    float m_RotationLagSpeedPitch;                                                    // 0x0040 (size: 0x4)
    float m_LagMaxDistance;                                                           // 0x0044 (size: 0x4)
    ECamConditions m_Condition;                                                       // 0x0048 (size: 0x1)
    bool m_IsActive;                                                                  // 0x0049 (size: 0x1)
    bool m_IsAim;                                                                     // 0x004A (size: 0x1)
    float m_SpellPitchLimit;                                                          // 0x004C (size: 0x4)
    float m_SpellYawLimit;                                                            // 0x0050 (size: 0x4)
    int32 m_CameraPitchId;                                                            // 0x0054 (size: 0x4)
    float m_PitchLimit;                                                               // 0x0058 (size: 0x4)
    float m_YawLimit;                                                                 // 0x005C (size: 0x4)

}; // Size: 0x60

struct FCameraCombatSettings
{
    float DistanceCheck;                                                              // 0x0000 (size: 0x4)
    FCameraCombatSettings_Mode FreeMode;                                              // 0x0008 (size: 0x70)
    FCameraCombatSettings_Mode VsOneOrTwo;                                            // 0x0078 (size: 0x70)
    FCameraCombatSettings_Mode VsThree;                                               // 0x00E8 (size: 0x70)
    FCameraCombatSettings_Mode VsFly;                                                 // 0x0158 (size: 0x70)

}; // Size: 0x1C8

struct FCameraCombatSettings_Mode
{
    FVector PivotOffset;                                                              // 0x0000 (size: 0x18)
    float RotationLagSpeed;                                                           // 0x0018 (size: 0x4)
    FVector CameraOffset;                                                             // 0x0020 (size: 0x18)
    FRotator CameraRotOffset;                                                         // 0x0038 (size: 0x18)
    FVector PivotLagSpeed;                                                            // 0x0050 (size: 0x18)
    float FOV;                                                                        // 0x0068 (size: 0x4)

}; // Size: 0x70

struct FCameraEase
{
    float m_Time;                                                                     // 0x0000 (size: 0x4)
    TEnumAsByte<EEasingFunc::Type> m_Ease;                                            // 0x0004 (size: 0x1)
    float m_Blend;                                                                    // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FCameraLights
{
    class ARectLight* KeyLight;                                                       // 0x0000 (size: 0x8)
    class ARectLight* RimLight;                                                       // 0x0008 (size: 0x8)
    class ARectLight* KeyReverseLight;                                                // 0x0010 (size: 0x8)
    class ARectLight* RimReverseLight;                                                // 0x0018 (size: 0x8)
    TArray<class ARectLight*> AdditionalLights;                                       // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FCameraMovementSettings
{
    FCameraMovementSettings_Speed Walk;                                               // 0x0000 (size: 0x38)
    FCameraMovementSettings_Speed Run;                                                // 0x0038 (size: 0x38)
    FCameraMovementSettings_Speed Sprint;                                             // 0x0070 (size: 0x38)
    FVector PivotOffset;                                                              // 0x00A8 (size: 0x18)
    float RotationLagSpeed;                                                           // 0x00C0 (size: 0x4)

}; // Size: 0xC8

struct FCameraMovementSettings_Speed
{
    FVector CameraOffset;                                                             // 0x0000 (size: 0x18)
    FVector PivotLagSpeed;                                                            // 0x0018 (size: 0x18)
    float BlendTime;                                                                  // 0x0030 (size: 0x4)
    float FOV;                                                                        // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FCameraSettings
{
    FCameraSettings_Stance VelocityDirection;                                         // 0x0000 (size: 0x190)
    FCameraSettings_Stance LookingDirection;                                          // 0x0190 (size: 0x190)
    FCameraSettings_Stance Aiming;                                                    // 0x0320 (size: 0x190)
    FCameraCombatSettings Combat;                                                     // 0x04B0 (size: 0x1C8)

}; // Size: 0x678

struct FCameraSettings_Stance
{
    FCameraMovementSettings Standing;                                                 // 0x0000 (size: 0xC8)
    FCameraMovementSettings Crouching;                                                // 0x00C8 (size: 0xC8)

}; // Size: 0x190

struct FCameraState
{
    float m_ArmLength;                                                                // 0x0000 (size: 0x4)
    FVector m_SocketOffset;                                                           // 0x0008 (size: 0x18)
    FVector m_SocketOffsetDesired;                                                    // 0x0020 (size: 0x18)
    float m_Fov;                                                                      // 0x0038 (size: 0x4)
    float m_LagSpeed;                                                                 // 0x003C (size: 0x4)
    float m_RotationLagSpeed;                                                         // 0x0040 (size: 0x4)
    float m_RotationLagSpeedPitch;                                                    // 0x0044 (size: 0x4)
    float m_LagMaxDistance;                                                           // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FCameraViewParameters
{
    class UConversationCameraPresetBase* Preset;                                      // 0x0000 (size: 0x8)
    class AGothicCharacter* Speaker;                                                  // 0x0008 (size: 0x8)
    class AGothicCharacter* Listener;                                                 // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FCharacterGuildRequirements : public FInteractionSpotRequirements
{
    FGameplayTagContainer AllowedGuilds;                                              // 0x0038 (size: 0x20)

}; // Size: 0x58

struct FCharacterSignificanceSettings
{
    float MaxSignificanceRadius;                                                      // 0x0000 (size: 0x4)
    float InViewRadius;                                                               // 0x0004 (size: 0x4)
    float SpawnSignificance;                                                          // 0x0008 (size: 0x4)
    float KeepSpawnedSignificance;                                                    // 0x000C (size: 0x4)
    float PreloadVisualsSignificance;                                                 // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FCharacterSpeciesRequirements : public FInteractionSpotRequirements
{
    FGameplayTagContainer AllowedSpecies;                                             // 0x0038 (size: 0x20)

}; // Size: 0x58

struct FCharacterStateSaveGameData
{
    FCharacterStateSaveGameData_AnyCharacterType AnyCharacterType;                    // 0x0000 (size: 0x190)
    FCharacterStateSaveGameData_NPCCharacter NPCCharacters;                           // 0x0190 (size: 0x230)
    FCharacterStateSaveGameData_PlayerCharacter PlayerCharacters;                     // 0x03C0 (size: 0x1)
    ECharacterStateGlobalIDFormat GlobalIDFormat;                                     // 0x03C1 (size: 0x1)

}; // Size: 0x3C8

struct FCharacterStateSaveGameData_AIValueStorage
{
    TArray<class UAIValueSet*> SpawnedStorage;                                        // 0x0000 (size: 0x10)
    TArray<class UAIValueSet*> PersistantStorage;                                     // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FCharacterStateSaveGameData_ActiveEffects
{
    TArray<FCharacterStateSaveGameData_ActiveGameplayEffect> ActiveEffects;           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCharacterStateSaveGameData_ActiveGameplayEffect
{
    FGameplayEffectSpec EffectSpec;                                                   // 0x0000 (size: 0x298)
    TMap<FGameplayTag, float> SetByCallerTagMagnitudes;                               // 0x0298 (size: 0x50)

}; // Size: 0x2E8

struct FCharacterStateSaveGameData_AnyCharacterType
{
    TMap<class FName, class FCharacterStateSaveGameData_Attributes> AttributesByGlobalId; // 0x0000 (size: 0x50)
    TMap<class FName, class FCharacterStateSaveGameData_LongTermMemory> LongTermMemoryByGlobalId; // 0x0050 (size: 0x50)
    TMap<class FName, class FCharacterStateSaveGameData_ActiveEffects> ActiveEffectsByGlobalId; // 0x00A0 (size: 0x50)
    TMap<class FName, class FCharacterStateSaveGameData_Party> PartyInfoByGlobalId;   // 0x00F0 (size: 0x50)
    TMap<class FName, class FGameplayTagContainer> LooseTagsByGlobalId;               // 0x0140 (size: 0x50)

}; // Size: 0x190

struct FCharacterStateSaveGameData_AttributeSet
{
    TMap<class FName, class FGameplayAttributeData> Attributes;                       // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FCharacterStateSaveGameData_Attributes
{
    TMap<class TSubclassOf<UAttributeSet>, class FCharacterStateSaveGameData_AttributeSet> AttributeSetsByClass; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FCharacterStateSaveGameData_DailyRoutine
{
    TSubclassOf<class UAIState_DailyRoutine> DailyRoutineClass;                       // 0x0000 (size: 0x8)
    FInGameTime AssignedAt;                                                           // 0x0008 (size: 0x8)
    FVector LocationWhenStartedRoutine;                                               // 0x0010 (size: 0x18)
    FInteractionSpotHandle UsedSpot;                                                  // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FCharacterStateSaveGameData_Inventory
{
    FReplicatedInventoryMap InventoryItems;                                           // 0x0000 (size: 0x138)
    FReplicatedInventoryMap DefaultInventoryItems;                                    // 0x0138 (size: 0x138)

}; // Size: 0x270

struct FCharacterStateSaveGameData_LongTermMemory
{
    TArray<FMemorizedEvent> MemorizedEvents;                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCharacterStateSaveGameData_NPCCharacter
{
    TMap<class FName, class FCharacterStateSaveGameData_NPCSpawnInfo> SpawnInfoByGlobalId; // 0x0000 (size: 0x50)
    TMap<class FName, class FCharacterStateSaveGameData_Position> PositionByGlobalId; // 0x0050 (size: 0x50)
    TMap<class FName, class FCharacterStateSaveGameData_DailyRoutine> DailyRoutineByGlobalId; // 0x00A0 (size: 0x50)
    TMap<class FName, class FCharacterStateSaveGameData_Inventory> InventoryByGlobalId; // 0x00F0 (size: 0x50)
    TMap<class FName, class FCharacterStateSaveGameData_Relationship> RelationshipByGlobalId; // 0x0140 (size: 0x50)
    TMap<class FName, class FCharacterStateSaveGameData_AIValueStorage> AIValueStorageByGlobalId; // 0x0190 (size: 0x50)
    TSet<FName> GlobalIDsRemovedFromWorld;                                            // 0x01E0 (size: 0x50)

}; // Size: 0x230

struct FCharacterStateSaveGameData_NPCSpawnInfo
{
    TSubclassOf<class UCharacterConfig> CharacterConfig;                              // 0x0000 (size: 0x8)
    TSoftClassPtr<AGothicCharacter> VisualCharacterClass;                             // 0x0008 (size: 0x28)
    FName SummonedBy;                                                                 // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FCharacterStateSaveGameData_Party
{
    TSet<FName> InPartyWith;                                                          // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FCharacterStateSaveGameData_PlayerCharacter
{
}; // Size: 0x1

struct FCharacterStateSaveGameData_Position
{
    FVector CharacterLocation;                                                        // 0x0000 (size: 0x18)
    FRotator CharacterRotation;                                                       // 0x0018 (size: 0x18)
    FVector SpawnLocation;                                                            // 0x0030 (size: 0x18)
    FRotator SpawnRotation;                                                           // 0x0048 (size: 0x18)

}; // Size: 0x60

struct FCharacterStateSaveGameData_Relationship
{
    TArray<class UActivePersonalRelationshipModifier*> ActivePersonalRelationshipModifiers; // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCharacterTypeTagRequirements : public FInteractionSpotRequirements
{
    FGameplayTagContainer AllowedCharacterTypes;                                      // 0x0038 (size: 0x20)

}; // Size: 0x58

struct FCharacterUniqueName
{
    FName Name;                                                                       // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FClassConstructorHook
{
}; // Size: 0x10

struct FClientAuthoritativeMoveData
{
    FVector_NetQuantize10 Location;                                                   // 0x0000 (size: 0x18)
    FRotator Rotation;                                                                // 0x0018 (size: 0x18)
    FVector_NetQuantize10 Velocity;                                                   // 0x0030 (size: 0x18)
    FRotator ControlRotation;                                                         // 0x0048 (size: 0x18)
    uint8 MovementMode;                                                               // 0x0060 (size: 0x1)
    class UPrimitiveComponent* BasedMovementBase;                                     // 0x0068 (size: 0x8)
    FName BasedMovementBaseBoneName;                                                  // 0x0070 (size: 0x8)
    bool bBasedHasRelativeRotation;                                                   // 0x0078 (size: 0x1)
    bool bHasOverrideRootMotion;                                                      // 0x0079 (size: 0x1)
    bool bCrouching;                                                                  // 0x007A (size: 0x1)
    bool bHasTimestamp;                                                               // 0x007B (size: 0x1)
    float Timestamp;                                                                  // 0x007C (size: 0x4)
    FVector_NetQuantize10 InputVector;                                                // 0x0080 (size: 0x18)
    float SpeedForCurve;                                                              // 0x0098 (size: 0x4)
    float NewMaxSpeed;                                                                // 0x009C (size: 0x4)

}; // Size: 0xA0

struct FClientAuthoritativeRootMotionSource : public FRootMotionSource
{
}; // Size: 0xE0

struct FClimbingMontages
{
    TSoftObjectPtr<UAnimMontage> m_LeftMontage;                                       // 0x0008 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> m_RightMontage;                                      // 0x0030 (size: 0x28)
    TSoftObjectPtr<UCurveVector> m_PositionCorrectionCurve;                           // 0x0058 (size: 0x28)

}; // Size: 0x80

struct FClimbing_SearchEdgeSettings
{
    float m_MaxAutoClimbHeight;                                                       // 0x0000 (size: 0x4)
    float m_MaxEdgeHeight;                                                            // 0x0004 (size: 0x4)
    float m_MinEdgeHeight;                                                            // 0x0008 (size: 0x4)
    float m_ReachDistance;                                                            // 0x000C (size: 0x4)
    float m_ForwardTraceRadius;                                                       // 0x0010 (size: 0x4)
    float m_DownwardTraceRadius;                                                      // 0x0014 (size: 0x4)
    float m_MaxFenceWidth;                                                            // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FClockTime
{
    int32 Hour;                                                                       // 0x0000 (size: 0x4)
    int32 Minute;                                                                     // 0x0004 (size: 0x4)
    double Second;                                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FClockTimeRange
{
    FClockTime From;                                                                  // 0x0000 (size: 0x10)
    FClockTime To;                                                                    // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FCoffinSenseShape
{
    float SenseShapeModifier;                                                         // 0x0000 (size: 0x4)
    float Length;                                                                     // 0x0004 (size: 0x4)
    float GoodVisionLength;                                                           // 0x0008 (size: 0x4)
    float CloseHalfWidth;                                                             // 0x000C (size: 0x4)
    float MiddleHalfWidth;                                                            // 0x0010 (size: 0x4)
    float FarHalfWidth;                                                               // 0x0014 (size: 0x4)

}; // Size: 0x28

struct FCombatAIModifiers
{
    TMap<FString, float> m_AttributeModifiers;                                        // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FCombatAttackType
{
}; // Size: 0x1

struct FCombatDirection
{
}; // Size: 0x1

struct FCombatPose
{
}; // Size: 0x1

struct FContainerVirtualData : public FFastArraySerializerItem
{
    TArray<FItemVirtualData> m_Slots;                                                 // 0x0048 (size: 0x10)
    EInventoryTypes m_InventoryType;                                                  // 0x0058 (size: 0x1)
    FGameplayTagContainer m_ValidCategories;                                          // 0x0060 (size: 0x20)
    int32 m_Capacity;                                                                 // 0x0080 (size: 0x4)

}; // Size: 0x88

struct FContainerVirtualDataArray : public FFastArraySerializer
{
    TArray<FContainerVirtualData> Items;                                              // 0x0108 (size: 0x10)

}; // Size: 0x118

struct FConversationTopicDynamicRequirement
{
    int64 DebugId;                                                                    // 0x0008 (size: 0x8)
    bool bExpectedResult;                                                             // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FConversationTopicForceSettings
{
    EConversationForceWalk ApproachBy;                                                // 0x0000 (size: 0x4)
    EConversationForceRangeType RangeType;                                            // 0x0004 (size: 0x1)
    FGameplayTag ReactionVoiceline;                                                   // 0x0008 (size: 0x8)
    bool bDoAmbientDuringCombat;                                                      // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FConversationTopicListenedToRequirement : public FConversationTopicDynamicRequirement
{
    FName Character;                                                                  // 0x0018 (size: 0x8)
    FText Voiceline;                                                                  // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FConversationTopicLocationRequirement : public FConversationTopicDynamicRequirement
{
    FName Character;                                                                  // 0x0018 (size: 0x8)
    FName Waypoint;                                                                   // 0x0020 (size: 0x8)
    float MaxDistance;                                                                // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FConversationTopicQuestRequirement : public FConversationTopicDynamicRequirement
{
    TSubclassOf<class UQuest> QuestClass;                                             // 0x0018 (size: 0x8)
    bool bAllowWhenAvailable;                                                         // 0x0020 (size: 0x1)
    bool bAllowWhenRunning;                                                           // 0x0021 (size: 0x1)
    bool bAllowWhenSucceeded;                                                         // 0x0022 (size: 0x1)
    bool bAllowWhenFailed;                                                            // 0x0023 (size: 0x1)

}; // Size: 0x28

struct FCookExcludeRule
{
    FString Contains;                                                                 // 0x0000 (size: 0x10)
    bool CaseSensitive;                                                               // 0x0010 (size: 0x1)
    FSoftObjectPath SpecificAsset;                                                    // 0x0018 (size: 0x20)
    TArray<FDirectoryPath> DoNotApplyToDirectories;                                   // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FCraftingMenu_CraftingActionMetadata
{
    FGameplayTag m_GameplayTag;                                                       // 0x0000 (size: 0x8)
    FText m_WindowTitle;                                                              // 0x0008 (size: 0x10)
    bool m_CanCraftMultipleItems;                                                     // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FCraftingProductUIData
{
    TSubclassOf<class UItemDefinition> m_ItemDefinitionClass;                         // 0x0000 (size: 0x8)
    int32 m_AmountGranted;                                                            // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FCreditsRowContent
{
    FText m_PersonName;                                                               // 0x0000 (size: 0x10)
    FText m_PersonPosition;                                                           // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FCreditsSectionContent
{
    FText m_SectionTitle;                                                             // 0x0000 (size: 0x10)
    class UTexture2D* m_LogoTexture;                                                  // 0x0010 (size: 0x8)
    TArray<FCreditsRowContent> m_SectionContent;                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FCrimeVictimGuildHandle
{
    FGameplayTag Guild;                                                               // 0x0000 (size: 0x8)
    ERelationship RelationshipTowardsGuild;                                           // 0x0008 (size: 0x1)
    ERelationshipRelativeRank RelativeRankTowardsGuild;                               // 0x0009 (size: 0x1)
    ERelationshipHostility HostilityTowardsGuild;                                     // 0x000A (size: 0x1)

}; // Size: 0xC

struct FCrimeVictimPersonHandle
{
    FName VictimGlobalID;                                                             // 0x0000 (size: 0x8)
    ERelationship RelationshipTowardsPerson;                                          // 0x0008 (size: 0x1)
    ERelationshipRelativeRank RelativeRankTowardsPerson;                              // 0x0009 (size: 0x1)
    ERelationshipHostility HostilityTowardsPerson;                                    // 0x000A (size: 0x1)

}; // Size: 0xC

struct FCutsceneAudioEventSet
{
    TMap<class FName, class TSoftObjectPtr<UFMODEvent>> AudioEvents;                  // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FDailyRoutineInteractionAnimation
{
}; // Size: 0x320

struct FDailyRoutineSimulatedCharacter
{
    FTransform LastKnownTransform;                                                    // 0x0000 (size: 0x60)
    FTransform LastTransformSetBySimulation;                                          // 0x0060 (size: 0x60)
    FBox MovementBoundsEstimate;                                                      // 0x00C0 (size: 0x38)
    float DistanceUntilUpdate;                                                        // 0x00F8 (size: 0x4)
    float WalkingSpeedUnitsPerSecond;                                                 // 0x00FC (size: 0x4)
    FInGameTime IdleUntil;                                                            // 0x0100 (size: 0x8)

}; // Size: 0x120

struct FDailyRoutineSimulatedCharacterHandle : public FArrayElementHandle
{
}; // Size: 0x8

struct FDailyRoutineSimulatedCharacterState
{
}; // Size: 0x580

struct FDailyRoutineSimulatedCharacterVisuals
{
    TOptional<USkeletalMesh*> PendingMesh;                                            // 0x00C0 (size: 0x10)

}; // Size: 0x330

struct FDailyRoutineSimulatedLightSource
{
    float LightIntensity;                                                             // 0x0000 (size: 0x4)
    float LightRadius;                                                                // 0x0004 (size: 0x4)
    FColor LightColor;                                                                // 0x0008 (size: 0x4)
    FVector PositionOffset;                                                           // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FDailyRoutineSimulationMesh
{
    float SelectionPriority;                                                          // 0x0000 (size: 0x4)
    FGameplayTagContainer SelectIfHasAllOf;                                           // 0x0008 (size: 0x20)
    TSoftObjectPtr<USkeletalMesh> Mesh;                                               // 0x0028 (size: 0x28)
    FTransform OffsetTransform;                                                       // 0x0050 (size: 0x60)
    FTransform CustomOffsetTransform;                                                 // 0x00B0 (size: 0x60)
    TSoftObjectPtr<UAnimSequence> WalkingAnimationLoop;                               // 0x0110 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> IdleAnimationLoop;                                  // 0x0138 (size: 0x28)
    TMap<class FName, class FDailyRoutineSimulatedLightSource> SimulatedLightPresets; // 0x0160 (size: 0x50)

}; // Size: 0x1B0

struct FDailyRoutineStats
{
}; // Size: 0x1A8

struct FDailyRoutineTaskDescription
{
    FClockTime StartTime;                                                             // 0x0000 (size: 0x10)
    class UCharacterAIState* TaskInstance;                                            // 0x0010 (size: 0x8)
    FName AtWaypoint;                                                                 // 0x0018 (size: 0x8)
    float WaypointRadius;                                                             // 0x0020 (size: 0x4)
    TSubclassOf<class UNavArea> InNavArea;                                            // 0x0028 (size: 0x8)
    FDailyRoutineTaskDescriptionConditionDelegate ConditionDelegate;                  // 0x0030 (size: 0x10)
    bool DailyRoutineTaskConditionDelegate();
    class UTerritoryConfig* TerritoryOverride;                                        // 0x0040 (size: 0x8)

}; // Size: 0x58

struct FDailyRoutineValidationData
{
    class AGothicCharacterState* CharacterState;                                      // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FDamageByMagicCircle
{
    FGameplayTag m_CircleTag;                                                         // 0x0000 (size: 0x8)
    float m_Damage;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FDamageProgressionMagicCircle
{
    TArray<FDamageByMagicCircle> m_DamageByMagicCircle;                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FDeathSkillAnimMontage
{
    FGameplayTag m_ItemType;                                                          // 0x0000 (size: 0x8)

}; // Size: 0x58

struct FDebugPathwayInformation
{
}; // Size: 0x30

struct FDeliverySpot
{
    FTransform SpotTransform;                                                         // 0x0000 (size: 0x60)
    FName Spotname;                                                                   // 0x0060 (size: 0x8)
    class ACarriableWorldItem* BlockingItem;                                          // 0x0078 (size: 0x8)
    class UChildActorComponent* PreviewActorComponent;                                // 0x0080 (size: 0x8)
    TSubclassOf<class ACarriableWorldItem> PreviewItemClass;                          // 0x0088 (size: 0x8)

}; // Size: 0x90

struct FDirtVisualSettings
{
    EDirtAmountType DirtAmount;                                                       // 0x0000 (size: 0x1)
    bool HasDirt;                                                                     // 0x0001 (size: 0x1)
    FLinearColor DirtColor1;                                                          // 0x0004 (size: 0x10)
    FLinearColor DirtColor2;                                                          // 0x0014 (size: 0x10)
    float DirtAlbedoIntensity;                                                        // 0x0024 (size: 0x4)
    float DirtAmountIntensity;                                                        // 0x0028 (size: 0x4)
    float DirtAmount0;                                                                // 0x002C (size: 0x4)
    FVector DirtHit0;                                                                 // 0x0030 (size: 0x18)
    float DirtRadius0;                                                                // 0x0048 (size: 0x4)
    float DirtAmount1;                                                                // 0x004C (size: 0x4)
    FVector DirtHit1;                                                                 // 0x0050 (size: 0x18)
    float DirtRadius1;                                                                // 0x0068 (size: 0x4)
    float DirtAmount2;                                                                // 0x006C (size: 0x4)
    FVector DirtHit2;                                                                 // 0x0070 (size: 0x18)
    float DirtRadius2;                                                                // 0x0088 (size: 0x4)

}; // Size: 0x90

struct FDodgeData
{
    float m_SuperArmorResistanceMultiplier;                                           // 0x0000 (size: 0x4)
    FGameplayTag Direction;                                                           // 0x0004 (size: 0x8)
    FGameplayTag Pose;                                                                // 0x000C (size: 0x8)
    FGameplayTag Orientation;                                                         // 0x0014 (size: 0x8)
    TSoftObjectPtr<UAnimMontage> Montage;                                             // 0x0020 (size: 0x28)
    class UAnimMontage* m_Montage;                                                    // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FDroppedItem
{
    TSubclassOf<class UItemDefinition> m_Definition;                                  // 0x0000 (size: 0x8)
    int32 m_Num;                                                                      // 0x0008 (size: 0x4)
    FVector m_Origin;                                                                 // 0x0010 (size: 0x18)
    FQuat m_Rot;                                                                      // 0x0030 (size: 0x20)
    FItemPayload m_Payload;                                                           // 0x0050 (size: 0x88)
    FReplicatedStringMap m_GenericData;                                               // 0x00D8 (size: 0x20)
    bool m_IsDynamic;                                                                 // 0x00F8 (size: 0x1)
    bool m_Switch;                                                                    // 0x00F9 (size: 0x1)

}; // Size: 0x100

struct FDynamicMontage
{
    TSoftObjectPtr<UAnimSequence> Sequence;                                           // 0x0000 (size: 0x28)
    float BlendIn;                                                                    // 0x0028 (size: 0x4)
    float BlendOut;                                                                   // 0x002C (size: 0x4)
    float StartTime;                                                                  // 0x0030 (size: 0x4)
    float PlayRate;                                                                   // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FDynamicTransition
{
}; // Size: 0x2

struct FEquipMontage
{
    EStance m_Stance;                                                                 // 0x0000 (size: 0x1)
    EHoldsterLocation m_HoldsterLocation;                                             // 0x0001 (size: 0x1)
    TSoftObjectPtr<UAnimMontage> m_Montage;                                           // 0x0008 (size: 0x28)

}; // Size: 0x30

struct FEventFloatData
{
}; // Size: 0x50

struct FExpressionMontageContainer
{
    FGameplayTagContainer RequireAnyOfCharacterTags;                                  // 0x0000 (size: 0x20)
    FGameplayTagContainer RequireAllOfCharacterTags;                                  // 0x0020 (size: 0x20)
    FGameplayTagContainer RequireNoneOfCharacterTags;                                 // 0x0040 (size: 0x20)
    int32 Layer;                                                                      // 0x0060 (size: 0x4)
    FGameplayTagContainer ForExpression;                                              // 0x0068 (size: 0x20)
    FGameplayTag Posture;                                                             // 0x0088 (size: 0x8)
    TArray<TSoftObjectPtr<UAnimSequence>> AnimSequences;                              // 0x0090 (size: 0x10)
    TArray<FName> AnimSequencesInPath;                                                // 0x00A0 (size: 0x10)

}; // Size: 0xB0

struct FFXDecal
{
    TSoftObjectPtr<UMaterialInterface> DecalMaterial;                                 // 0x0000 (size: 0x28)
    FVector DecalSize;                                                                // 0x0028 (size: 0x18)
    float LifeSpan;                                                                   // 0x0040 (size: 0x4)

}; // Size: 0x48

struct FFXFMODEvent
{
    TSoftObjectPtr<UFMODEvent> FMODEventPath;                                         // 0x0000 (size: 0x28)
    TMap<FName, float> EventParameters;                                               // 0x0028 (size: 0x50)
    bool bAttachToInstigator;                                                         // 0x0078 (size: 0x1)

}; // Size: 0x80

struct FFXParticleSystem
{
    TMap<TEnumAsByte<EPhysicalSurface>, TSoftObjectPtr<UNiagaraSystem>> NiagaraSystemPathBySurfaceType; // 0x0000 (size: 0x50)
    bool bUnderWaterEffect;                                                           // 0x0050 (size: 0x1)
    FRotator RotationOffset;                                                          // 0x0058 (size: 0x18)
    TMap<class FName, class bool> BoolParameters;                                     // 0x0070 (size: 0x50)
    TMap<FName, float> FloatParameters;                                               // 0x00C0 (size: 0x50)
    TMap<class FName, class FVector> VectorParameters;                                // 0x0110 (size: 0x50)
    TMap<FName, int32> IntParameters;                                                 // 0x0160 (size: 0x50)
    bool bIsLooping;                                                                  // 0x01B0 (size: 0x1)

}; // Size: 0x1B8

struct FFXPerceptionSoundArea
{
    FGameplayTag PerceptionSoundTag;                                                  // 0x0000 (size: 0x8)
    EPerceptionNoiseLoudness PerceptionLoudness;                                      // 0x0008 (size: 0x1)
    EPerceptionSoundLengthType PerceptionSoundLength;                                 // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FFeetDrawData
{
    class AGothicFootstepsTrackerActor* TrackerActor;                                 // 0x0000 (size: 0x8)
    class USkeletalMeshComponent* Component;                                          // 0x0008 (size: 0x8)
    bool bOnGround;                                                                   // 0x0010 (size: 0x1)
    FName BoneName;                                                                   // 0x0014 (size: 0x8)
    FBoneFeetData FootData;                                                           // 0x0020 (size: 0x40)
    FBoneTrackedData TrackData;                                                       // 0x0060 (size: 0x1)

}; // Size: 0x70

struct FFloatByWalkSpeed
{
    TMap<EWalkSpeed, float> m_valuesByWalkSpeed;                                      // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FFogVolumeSettings
{
    float Alpha;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FFreepointActionTags_DEPRECATED
{
    FGameplayTagContainer ActionTags;                                                 // 0x0000 (size: 0x20)
    TSubclassOf<class UFreepointActionTagList> ActionTagList;                         // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FFreepointConfig_DEPRECATED
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    FName LevelName;                                                                  // 0x0008 (size: 0x8)
    FTransform Transform;                                                             // 0x0010 (size: 0x60)
    EFreepointType FreepointType;                                                     // 0x0070 (size: 0x1)
    bool bCanChainAction;                                                             // 0x0071 (size: 0x1)
    bool bAllowAnyOrientationWhenUsing;                                               // 0x0072 (size: 0x1)
    FFreepointUsageRestriction_DEPRECATED UsageRestriction;                           // 0x0078 (size: 0x58)
    FFreepointActionTags_DEPRECATED Actions;                                          // 0x00D0 (size: 0x28)
    TSoftObjectPtr<AActor> InteractObject;                                            // 0x00F8 (size: 0x28)
    EInteractionSpotEntryDirection EntryDirection;                                    // 0x0120 (size: 0x1)
    bool bUseActionTagsForInteractObject;                                             // 0x0121 (size: 0x1)
    TSet<TSubclassOf<UNavArea>> OnNavAreas;                                           // 0x0128 (size: 0x50)

}; // Size: 0x180

struct FFreepointUsageRestriction_DEPRECATED
{
    FGameplayTagContainer CharacterTypeRestriction;                                   // 0x0000 (size: 0x20)
    TArray<FName> CharacterUniqueNameRestriction;                                     // 0x0020 (size: 0x10)
    TArray<class TSubclassOf<UTimeRange>> TimeRanges;                                 // 0x0030 (size: 0x10)
    TSubclassOf<class UWeatherCondition> WeatherCondition;                            // 0x0040 (size: 0x8)
    float CooldownSecondsAfterUse;                                                    // 0x0048 (size: 0x4)
    float Priority;                                                                   // 0x004C (size: 0x4)
    float Radius;                                                                     // 0x0050 (size: 0x4)
    int32 NumUsersAllowed;                                                            // 0x0054 (size: 0x4)

}; // Size: 0x58

struct FFreezeParams
{
    float m_CustomTimeDilation;                                                       // 0x0000 (size: 0x4)
    float m_FreezeDuration;                                                           // 0x0004 (size: 0x4)
    float m_BlendOutDuration;                                                         // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGameEventSend
{
    FGameplayTag m_Verb;                                                              // 0x0000 (size: 0x8)
    FName m_InstigatorName;                                                           // 0x0008 (size: 0x8)
    FName m_EventName;                                                                // 0x0010 (size: 0x8)
    float m_NewValue;                                                                 // 0x0018 (size: 0x4)
    bool m_Forced;                                                                    // 0x001C (size: 0x1)

}; // Size: 0x20

struct FGameStateDataBaseSaveData
{
    TArray<FName> m_DoorsOpen;                                                        // 0x0000 (size: 0x10)
    TArray<FName> m_DoorsClosed;                                                      // 0x0010 (size: 0x10)
    TMap<FName, float> m_GenericData;                                                 // 0x0020 (size: 0x50)
    TArray<FName> m_SavedDoorsMessagesName;                                           // 0x0070 (size: 0x10)
    TArray<FGothicBasicVerbMessage> m_SavedDoorsMessagesStruct;                       // 0x0080 (size: 0x10)
    TMap<class FGuid, class FGenericData> m_InteractiveData;                          // 0x0090 (size: 0x50)
    TMap<class FString, class FReplicatedInventoryMap> m_SavedInventories;            // 0x00E0 (size: 0x50)
    TArray<FTraderData> m_Traders;                                                    // 0x0130 (size: 0x10)
    TMap<FName, int32> m_CreatureKillCounterSaved;                                    // 0x0140 (size: 0x50)

}; // Size: 0x190

struct FGameTimeSaveGameData
{
    FInGameTime CurrentTime;                                                          // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FGameplayAbilityEquip_InventoryPosition : public FGameplayAbilityTargetData
{
}; // Size: 0x30

struct FGameplayAbilityFatigueEffects
{
    TArray<class TSubclassOf<UScriptGameplayEffect>> m_GameplayEffects;               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGameplayAbilitySleepEndedMessageList
{
    TArray<FText> m_Messages;                                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGameplayAbilityTargetData_AutoConversation : public FGameplayAbilityTargetData
{
    TArray<class TSubclassOf<UConversationTopic>> TopicsToChoose;                     // 0x0008 (size: 0x10)
    bool bEndConversationAfterGivenTopicSetIsEmpty;                                   // 0x0018 (size: 0x1)
    bool bIgnoreTopicConditions;                                                      // 0x0019 (size: 0x1)

}; // Size: 0x20

struct FGameplayAbilityTargetData_CameraEventSettings : public FGameplayAbilityTargetData
{
    FName ForcePresetByName;                                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGameplayAbilityTargetData_CastingBegin : public FGameplayAbilityTargetData
{
    int32 m_SpellLevel;                                                               // 0x0008 (size: 0x4)
    int32 m_TotalLevels;                                                              // 0x000C (size: 0x4)
    float m_ManaCost;                                                                 // 0x0010 (size: 0x4)
    float m_CastDuration;                                                             // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FGameplayAbilityTargetData_ClimbTarget : public FGameplayAbilityTargetData
{
    FTraversalInfo m_TraversalInfo;                                                   // 0x0010 (size: 0x150)
    bool m_CalculateEdgeHeightFromFeetLocation;                                       // 0x0160 (size: 0x1)

}; // Size: 0x170

struct FGameplayAbilityTargetData_CutsceneVoiceline : public FGameplayAbilityTargetData
{
    class ACharacter* Character;                                                      // 0x0008 (size: 0x8)
    FText CustomName;                                                                 // 0x0010 (size: 0x10)
    FText Text;                                                                       // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FGameplayAbilityTargetData_EquipItem : public FGameplayAbilityTargetData
{
    TSubclassOf<class UItemDefinition> NextItem;                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGameplayAbilityTargetData_Execution : public FGameplayAbilityTargetData
{
}; // Size: 0x18

struct FGameplayAbilityTargetData_HealthManaBar : public FGameplayAbilityTargetData
{
    int32 m_Heal;                                                                     // 0x0008 (size: 0x4)
    int32 m_Mana;                                                                     // 0x000C (size: 0x4)
    int32 m_Duration;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FGameplayAbilityTargetData_HitData : public FGameplayAbilityTargetData
{
    FGameplayTag Impact;                                                              // 0x0008 (size: 0x8)
    bool CanBeParried;                                                                // 0x0010 (size: 0x1)
    bool CanBeDeflected;                                                              // 0x0011 (size: 0x1)
    FGameplayTag ImpactDirection;                                                     // 0x0014 (size: 0x8)
    FGameplayTag SourceAttackDirection;                                               // 0x001C (size: 0x8)
    TSubclassOf<class UWeaponDefinition> WeaponUsed;                                  // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FGameplayAbilityTargetData_Input : public FGameplayAbilityTargetData
{
    FGameplayTag Direction;                                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGameplayAbilityTargetData_InteractionSpot : public FGameplayAbilityTargetData
{
    FInteractionSpotHandle SpotHandle;                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGameplayAbilityTargetData_LandingHeight : public FGameplayAbilityTargetData
{
    float m_Height;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FGameplayAbilityTargetData_Posture : public FGameplayAbilityTargetData
{
    FGameplayTag Posture;                                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGameplayAbilityTargetData_Ragdoll : public FGameplayAbilityTargetData
{
    float Duration;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FGameplayAbilityTargetData_RainCoverHead : public FGameplayAbilityTargetData
{
    int32 TriggerOnRainLevel;                                                         // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FGameplayAbilityTargetData_Shrink : public FGameplayAbilityTargetData
{
    float m_Scale;                                                                    // 0x0008 (size: 0x4)
    float m_Duration;                                                                 // 0x000C (size: 0x4)

}; // Size: 0x10

struct FGameplayAbilityTargetData_SingleTarget : public FGameplayAbilityTargetData
{
    TWeakObjectPtr<class AActor> Target;                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGameplayAbilityTargetData_SingleTargetComp : public FGameplayAbilityTargetData
{
    TWeakObjectPtr<class USceneComponent> TargetComp;                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGameplayAbilityTargetData_Speak : public FGameplayAbilityTargetData
{
    FText Text;                                                                       // 0x0008 (size: 0x10)
    FName ForceSubtitleLanguage;                                                      // 0x0018 (size: 0x8)
    FGameplayTag Expression;                                                          // 0x0020 (size: 0x8)
    FGameplayTag Posture;                                                             // 0x0028 (size: 0x8)
    FGameplayTag GenericVoiceline;                                                    // 0x0030 (size: 0x8)
    FGenericVoicelineRequestContext Context;                                          // 0x0038 (size: 0x40)
    bool bUnskippable;                                                                // 0x0078 (size: 0x1)
    TSoftObjectPtr<AGothicCharacterState> Other;                                      // 0x0080 (size: 0x28)
    EPerceptionNoiseLoudness Loudness;                                                // 0x00A8 (size: 0x1)

}; // Size: 0xB0

struct FGameplayAbilityTargetData_TriggerCastSpellBegin : public FGameplayAbilityTargetData
{
    EAbilityInputID m_InputID;                                                        // 0x0008 (size: 0x1)
    bool m_InputPressed;                                                              // 0x0009 (size: 0x1)

}; // Size: 0x10

struct FGameplayAbilityTargetData_WalkSpeed : public FGameplayAbilityTargetData
{
    EWalkSpeed m_WalkSpeed;                                                           // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FGameplayEffectContext_EndRiding : public FGameplayEffectContext
{
}; // Size: 0x88

struct FGameplayEffectContext_HitResponse : public FGameplayEffectContext
{
    FGameplayTag Impact;                                                              // 0x0080 (size: 0x8)
    bool CanBeParried;                                                                // 0x0088 (size: 0x1)
    bool CanBeDeflected;                                                              // 0x0089 (size: 0x1)
    FVector AttackLinearVelocity;                                                     // 0x0090 (size: 0x18)
    FGameplayTag SourceDirection;                                                     // 0x00A8 (size: 0x8)
    FGameplayTag SourceAttackDirection;                                               // 0x00B0 (size: 0x8)
    TSubclassOf<class UWeaponDefinition> WeaponUsed;                                  // 0x00B8 (size: 0x8)
    TMap<FGameplayTag, float> MultiplierDamages;                                      // 0x00C0 (size: 0x50)
    float MultiplierSuperArmor;                                                       // 0x0110 (size: 0x4)
    float BowStretch;                                                                 // 0x0114 (size: 0x4)
    TSubclassOf<class UKnockbackData> CustomKnockbackData;                            // 0x0118 (size: 0x8)
    TSubclassOf<class UAttackMeleeConfig> AttackConfig;                               // 0x0120 (size: 0x8)

}; // Size: 0x128

struct FGameplayEffectContext_Taunt : public FGameplayEffectContext
{
    FGameplayTagContainer AllTagsRequiredContainer;                                   // 0x0080 (size: 0x20)
    FGameplayTagContainer OneTagRequiredContainer;                                    // 0x00A0 (size: 0x20)
    FGameplayTagContainer BlockedTags;                                                // 0x00C0 (size: 0x20)

}; // Size: 0xE0

struct FGameplayTargetDataFilter_GothicCharacter : public FGameplayTargetDataFilter
{
}; // Size: 0x20

struct FGameplayTargetDataFilter_WorldItem : public FGameplayTargetDataFilter
{
}; // Size: 0x20

struct FGenericData
{
    TMap<class FGameplayTag, class bool> m_BoolData;                                  // 0x0000 (size: 0x50)
    TMap<FGameplayTag, int32> m_IntData;                                              // 0x0050 (size: 0x50)

}; // Size: 0xA0

struct FGenericVoicelineRequestContext
{
    FGameplayTagContainer TagsMe;                                                     // 0x0000 (size: 0x20)
    FGameplayTagContainer TagsOther;                                                  // 0x0020 (size: 0x20)

}; // Size: 0x40

struct FGestureAnimationEvaluation
{
    class UAnimSequence* AnimSequence;                                                // 0x0000 (size: 0x8)

}; // Size: 0x20

struct FGestureSetEntry
{
    FGameplayTagContainer RequireAll;                                                 // 0x0000 (size: 0x20)
    FGameplayTagContainer RequireAllExact;                                            // 0x0020 (size: 0x20)
    FGameplayTagContainer RequireAny;                                                 // 0x0040 (size: 0x20)
    FGameplayTagContainer RequireNone;                                                // 0x0060 (size: 0x20)
    TSubclassOf<class UGestureSet> GestureSet;                                        // 0x0080 (size: 0x8)

}; // Size: 0x88

struct FGlobalCrimeDataEntry
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    FGameplayTag CrimeType;                                                           // 0x0004 (size: 0x8)
    FGameplayTag AreaTag;                                                             // 0x000C (size: 0x8)
    FInGameTime TimeCommitted;                                                        // 0x0018 (size: 0x8)
    bool bIsForgiven;                                                                 // 0x0020 (size: 0x1)
    ECrimeAffectedEntitySource AffectedEntitySource;                                  // 0x0021 (size: 0x1)
    TSubclassOf<class UItemDefinition> ItemDefinitionClass;                           // 0x0028 (size: 0x8)
    TSubclassOf<class UInteractiveObjectDefinition> InteractiveObjectDefinitionClass; // 0x0030 (size: 0x8)
    FName CriminalGlobalID;                                                           // 0x0038 (size: 0x8)
    FGameplayTag CriminalGuild;                                                       // 0x0040 (size: 0x8)
    TArray<FName> VictimGlobalIDs;                                                    // 0x0048 (size: 0x10)
    FGameplayTagContainer VictimGuilds;                                               // 0x0058 (size: 0x20)
    FName TrueCriminalGlobalID;                                                       // 0x0078 (size: 0x8)

}; // Size: 0x80

struct FGlobalPathingInfo
{
    TEnumAsByte<ENavigationQueryResult::Type> Result;                                 // 0x0000 (size: 0x1)
    TArray<EPathResultReason> ResultReasons;                                          // 0x0008 (size: 0x10)

}; // Size: 0x58

struct FGlossarySubfilterData
{
    FGameplayTag m_FilterTag;                                                         // 0x0000 (size: 0x8)
    TSoftObjectPtr<UTexture2D> m_IconImage;                                           // 0x0008 (size: 0x28)
    FText m_DisplayName;                                                              // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FGlossaryWidgetBucket
{
    FGameplayTag m_FilterTag;                                                         // 0x0000 (size: 0x8)
    TSubclassOf<class UGlossaryCategory> m_CategoryClass;                             // 0x0008 (size: 0x8)
    TArray<class UGlossaryDocument*> m_Documents;                                     // 0x0010 (size: 0x10)
    TArray<class TSubclassOf<UGlossarySubcategory>> m_Subcategories;                  // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FGothicAIMoveRequest
{
    TArray<ENavigationAgent> NavigationAgents;                                        // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FGothicActionContext
{
    TArray<class UInputMappingContext*> InputMappingContexts;                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGothicBasicVerbMessage
{
    FGameplayTag m_Verb;                                                              // 0x0000 (size: 0x8)
    FName m_ConnectedTrigger;                                                         // 0x0008 (size: 0x8)
    FName m_Event;                                                                    // 0x0010 (size: 0x8)
    double m_Magnitude;                                                               // 0x0018 (size: 0x8)
    bool m_Saved;                                                                     // 0x0020 (size: 0x1)
    bool m_IsPlayer;                                                                  // 0x0021 (size: 0x1)
    FName m_UserCharacter;                                                            // 0x0024 (size: 0x8)
    FName m_UserName;                                                                 // 0x002C (size: 0x8)

}; // Size: 0x38

struct FGothicCrashInfoFile
{
    FSentryContextGame Game;                                                          // 0x0000 (size: 0xC0)
    TMap<class FString, class FString> Quests;                                        // 0x00C0 (size: 0x50)
    TMap<FName, int32> Inventory;                                                     // 0x0110 (size: 0x50)
    TMap<class FString, class FSentryContextStack> ThreadStacks;                      // 0x0160 (size: 0x50)
    TMap<int32, FSentryContextStringStack> ContextStackByThreadID;                    // 0x01B0 (size: 0x50)

}; // Size: 0x200

struct FGothicCrimeMemorySaveGameData
{
    TArray<FGlobalCrimeDataEntry> GlobalCrimeDataEntries;                             // 0x0000 (size: 0x10)
    TMap<class FName, class FGothicCrimeMemorySaveGameRelativeCrimeCollection> RelativeCrimeDataEntries; // 0x0010 (size: 0x50)
    TMap<class FGameplayTag, class FGothicCrimeMemorySaveGameLocationMemoryCollection> LocationCrimeDataEntries; // 0x0060 (size: 0x50)

}; // Size: 0xB0

struct FGothicCrimeMemorySaveGameLocationMemoryCollection
{
    TArray<FLocationMemoryCrimeDataEntry> LocationMemories;                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGothicCrimeMemorySaveGameRelativeCrimeCollection
{
    TArray<FRelativeCrimeDataEntry> RelativeCrimes;                                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGothicFXInstanceHandle : public FArrayElementHandle
{
}; // Size: 0x8

struct FGothicFlyDiveSettings
{
    float UseFlyDiveMinDistance;                                                      // 0x0000 (size: 0x4)
    float GroundedMoveBeforeGoalDistance;                                             // 0x0004 (size: 0x4)
    float CharacterZDivergeOffset;                                                    // 0x0008 (size: 0x4)
    float AdaptToCollisionSampleZDistance;                                            // 0x000C (size: 0x4)
    float MinFocusSampleDistance;                                                     // 0x0010 (size: 0x4)
    float AdaptToNavLinkEndZInterpDistance;                                           // 0x0014 (size: 0x4)
    EFlyDiveMode FlyDiveMode;                                                         // 0x0018 (size: 0x1)
    EAdaptZDivergeMode AdaptZDivergeMode;                                             // 0x0019 (size: 0x1)
    TWeakObjectPtr<class ACharacter> RelativeZDivegeCharacter;                        // 0x001C (size: 0x8)

}; // Size: 0x24

struct FGothicInputAction
{
    class UInputAction* InputAction;                                                  // 0x0000 (size: 0x8)
    FGameplayTag InputTag;                                                            // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGothicInputContextData
{
    FGameplayTagContainer m_GameplayTagContainer;                                     // 0x0000 (size: 0x20)
    TArray<class UInputMappingContext*> m_ArrayMappingContext;                        // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FGothicInputContextDataTemporal
{
    FGameplayTagContainer m_GameplayTagContainer;                                     // 0x0000 (size: 0x20)
    FGameplayTagContainer m_GameplayTagContainerBlock;                                // 0x0020 (size: 0x20)
    TArray<class UInputMappingContext*> m_ArrayMappingContext;                        // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FGothicLineTraceParams
{
}; // Size: 0x1

struct FGothicLockPieceData
{
    class AGothicLockPieceActor* m_Plate;                                             // 0x0018 (size: 0x8)
    class AGothicLockPieceActor* m_Bar;                                               // 0x0020 (size: 0x8)
    class AGothicLockPieceActor* m_Latch;                                             // 0x0028 (size: 0x8)

}; // Size: 0x38

struct FGothicLockSaveGameData
{
    TSet<FName> m_UnlockedLocks;                                                      // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FGothicMassFragment_OwnedGameplayTags : public FMassFragment
{
    FGameplayTagContainer OwnedGameplayTags;                                          // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FGothicMassFragment_Significance : public FMassFragment
{
    float BaseSignificance;                                                           // 0x0000 (size: 0x4)
    float FinalSignificance;                                                          // 0x0004 (size: 0x4)
    float ForcedSignificance;                                                         // 0x0008 (size: 0x4)
    bool bAllowedToBeVisible;                                                         // 0x000C (size: 0x1)
    float LastTimeOverSpawningSignificanceThreshold;                                  // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FGothicMassFragment_ViewerInfo : public FMassViewerInfoFragment
{
}; // Size: 0x38

struct FGothicMassFragment_ViewerLineOfSight : public FMassFragment
{
}; // Size: 0x30

struct FGothicMassSharedFragment_SignificanceParameters : public FMassSharedFragment
{
    FCharacterSignificanceSettings SignificanceSettings;                              // 0x0000 (size: 0x14)

}; // Size: 0x14

struct FGothicMassSharedFragment_Viewpoints : public FMassSharedFragment
{
}; // Size: 0x10

struct FGothicMassSharedFragment_WorldTime : public FMassSharedFragment
{
    float TimeSeconds;                                                                // 0x0000 (size: 0x4)
    float RealTimeSeconds;                                                            // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGothicMassTag_CharacterState : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_CharacterVisualsSpawned : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_HasLineOfSightToViewer : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_HasNavMeshAvailable : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_InDailyRoutine : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_LevelCollisionLoaded : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_NPCState : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_PartOfCinematic : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_PendingCharacterVisualsSpawn : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_PossiblyInView : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_PotentiallySignificantEnoughToSpawn : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_SignificantEnoughToPreload : public FMassTag
{
}; // Size: 0x1

struct FGothicMassTag_SignificantEnoughToSpawn : public FMassTag
{
}; // Size: 0x1

struct FGothicMod
{
    TMap<class FString, class FGothicModMapModifications> MapModificationsByMapName;  // 0x0000 (size: 0x50)
    FGothicModScriptDefaultModifications ClassDefaultsMods;                           // 0x0050 (size: 0x50)

}; // Size: 0xA0

struct FGothicModClassModifications
{
}; // Size: 0x50

struct FGothicModMapInteractionSpots
{
    TArray<FInteractionSpot> SpotsToAdd;                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGothicModMapLevelInstances
{
    TArray<TSoftObjectPtr<UWorld>> LevelsToLoad;                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGothicModMapModifications
{
    FGothicModMapLevelInstances LevelInstances;                                       // 0x0000 (size: 0x10)
    FGothicModMapInteractionSpots InteractionSpots;                                   // 0x0010 (size: 0x10)
    FGothicModMapWorldPoints WorldPoints;                                             // 0x0020 (size: 0xB0)

}; // Size: 0xD0

struct FGothicModMapWorldPoints
{
    TArray<FWorldPointConfig> PointsToAdd;                                            // 0x0000 (size: 0x10)
    TMap<class FName, class FItemSpawnConfig> ItemSpawners;                           // 0x0010 (size: 0x50)
    TMap<class FName, class FGothicModWorldPointMod> EventsToModify;                  // 0x0060 (size: 0x50)

}; // Size: 0xB0

struct FGothicModScriptDefaultModifications
{
    TMap<class TSoftClassPtr<UClass>, class FGothicModClassModifications> ModifiedClasses; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FGothicModWorldPointCharacterSpawnCountMod
{
    TMap<FString, int32> DifferenceByCharacter;                                       // 0x0000 (size: 0x50)
    TMap<FString, int32> CountByCharacter;                                            // 0x0050 (size: 0x50)

}; // Size: 0xA0

struct FGothicModWorldPointMod
{
    TMap<class FName, class FGothicModWorldPointCharacterSpawnCountMod> Points;       // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FGothicMountComponentData
{
    TWeakObjectPtr<class AGothicCharacter> m_Character;                               // 0x0000 (size: 0x8)
    FActiveGameplayEffectHandle m_EffectHandle;                                       // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGothicPathfollowSettings
{
    TWeakObjectPtr<class UAbilityTaskGeneric> OwningTask;                             // 0x0000 (size: 0x8)
    FString DebugOwnerName;                                                           // 0x0008 (size: 0x10)
    float CrowdAgentSeparationWeight;                                                 // 0x0018 (size: 0x4)
    float CrowdAgentRadiusMultiplier;                                                 // 0x001C (size: 0x4)
    float CrowdAgentHalfHeightMultiplier;                                             // 0x0020 (size: 0x4)
    float AgentRadiusMultiplier;                                                      // 0x0024 (size: 0x4)
    float AgentHalfHeightMultiplier;                                                  // 0x0028 (size: 0x4)
    bool bSlowDownAtGoal;                                                             // 0x002C (size: 0x1)
    bool bEnableAnticipateTurns;                                                      // 0x002D (size: 0x1)
    bool bStrafeTurnToPotentialBlockingAgent;                                         // 0x002E (size: 0x1)
    ECrowdGroupsBehaviour CrowdGroupsBehaviour;                                       // 0x002F (size: 0x1)
    ECrowdIdleBehaviour CrowdIdleBehaviour;                                           // 0x0030 (size: 0x1)
    EScriptableCrowdAvoidanceQuality CrowdAvoidanceQuality;                           // 0x0031 (size: 0x1)
    bool bEnablePathPolyOptimization;                                                 // 0x0032 (size: 0x1)
    FPathfollowModifyAvoidVelocitySettings ModifyAvoidVelocitySettings;               // 0x0034 (size: 0x24)
    FPathfollowMoveFocusSettings MoveFocusSettings;                                   // 0x0058 (size: 0xC)
    FGothicFlyDiveSettings FlyDiveSettings;                                           // 0x0064 (size: 0x24)

}; // Size: 0x88

struct FGothicPhysicsVolumePriority
{
    TSoftObjectPtr<APhysicsVolume> m_PhysicsVolume;                                   // 0x0000 (size: 0x28)
    int32 m_Priority;                                                                 // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FGothicSaveGameFileMetadata
{
    TMap<class UScriptStruct*, class FInstancedStruct> CustomPayload;                 // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FGothicWaterSplineInstanceData : public FSplineInstanceData
{
    class UGothicWaterSplineMetadata* m_WaterSplineMetadata;                          // 0x01A0 (size: 0x8)

}; // Size: 0x1A8

struct FGothicWaterVolumeVectorFieldCell
{
    FVector M_Center;                                                                 // 0x0000 (size: 0x18)
    float m_Speed;                                                                    // 0x0018 (size: 0x4)
    FVector m_Direction;                                                              // 0x0020 (size: 0x18)

}; // Size: 0x38

struct FGroundMovementModeRequest
{
}; // Size: 0xC

struct FHLODModifierMaterialRemap : public FTableRowBase
{
    TSoftObjectPtr<UMaterialInterface> From;                                          // 0x0008 (size: 0x28)
    TSoftObjectPtr<UMaterialInterface> To;                                            // 0x0030 (size: 0x28)

}; // Size: 0x58

struct FHUDControllerWidgetStruct
{
    class UUserWidget* m_Widget;                                                      // 0x0000 (size: 0x8)
    TSubclassOf<class UUserWidget> m_WidgetClass;                                     // 0x0008 (size: 0x8)
    ESlateVisibility m_LastStateVisibility;                                           // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FHUDNotificationData
{
}; // Size: 0x8

struct FHUDNotificationData_AreaDiscovered : public FHUDNotificationData
{
    FText m_AreaDiscovered;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FHUDNotificationData_Chapter : public FHUDNotificationData
{
    class UGameStory* m_Story;                                                        // 0x0008 (size: 0x8)
    int32 m_ChapterNumber;                                                            // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FHUDNotificationData_GameplayAttribute : public FHUDNotificationData
{
    FGameplayAttribute m_Attribute;                                                   // 0x0008 (size: 0x38)
    float m_NewValue;                                                                 // 0x0040 (size: 0x4)
    float m_OldValue;                                                                 // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FHUDNotificationData_GameplayTag : public FHUDNotificationData
{
    FGameplayTag m_GameplayTag;                                                       // 0x0008 (size: 0x8)
    bool m_WasAdded;                                                                  // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FHUDNotificationData_Generic : public FHUDNotificationData
{
    FString m_String;                                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FHUDNotificationData_Glossary : public FHUDNotificationData
{
    class UGlossaryDocument* m_GlossaryDocument;                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FHUDNotificationData_Item : public FHUDNotificationData
{
    class UItemDefinition* m_Item;                                                    // 0x0008 (size: 0x8)
    int32 m_Count;                                                                    // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FHUDNotificationData_Quest : public FHUDNotificationData
{
    class UQuest* m_Quest;                                                            // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FHUDNotificationData_Recipe : public FHUDNotificationData
{
    class UCraftingRecipeUIData* m_Recipe;                                            // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FHUDNotificationData_SaveGame : public FHUDNotificationData
{
    FText m_Description;                                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FHUDNotificationHandle
{
}; // Size: 0x4

struct FHUDNotificationInputHintManager
{
    TArray<FHUDNotificationInputHintRequest> m_InputHintRequests;                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FHUDNotificationInputHintRequest
{
    class UHUDNotificationWidgetBase* m_Widget;                                       // 0x0000 (size: 0x8)

}; // Size: 0x30

struct FHUDNotificationRequest
{
    TSubclassOf<class UHUDNotificationWidgetBase> m_WidgetClass;                      // 0x0008 (size: 0x8)
    FInstancedStruct m_Data;                                                          // 0x0010 (size: 0x10)
    class UHUDNotificationWidgetBase* m_WidgetInstance;                               // 0x0028 (size: 0x8)

}; // Size: 0x40

struct FHUDNotificationWidget_AnimationData
{
    class UWidgetAnimation* m_Animation;                                              // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FHUDNotification_GameplayAttributeSettings
{
    FGameplayAttribute m_Attribute;                                                   // 0x0000 (size: 0x38)
    TSoftClassPtr<UHUDNotificationWidgetBase> m_NotificationWidgetClass;              // 0x0038 (size: 0x28)
    double m_DesiredTimeOverride;                                                     // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FHUDNotification_GameplayTagSettings
{
    FGameplayTagContainer m_GameplayTagContainer;                                     // 0x0000 (size: 0x20)
    int32 m_EventType;                                                                // 0x0020 (size: 0x4)
    ENotificationGameplayTagType m_TagType;                                           // 0x0024 (size: 0x1)
    TSoftClassPtr<UHUDNotificationWidgetBase> m_NotificationWidgetClass;              // 0x0028 (size: 0x28)
    double m_DesiredTimeOverride;                                                     // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FHashGridWaynet
{
}; // Size: 0x18

struct FHitCollisionDataContainer
{
    TArray<FHitResult> m_OutOverlapping;                                              // 0x0000 (size: 0x10)
    TArray<class UPrimitiveComponent*> m_OverlapComponents;                           // 0x0010 (size: 0x10)
    TMap<class UPrimitiveComponent*, class FHitResult> m_OverlappingMapComponent;     // 0x0020 (size: 0x50)

}; // Size: 0x70

struct FHitCueData
{
    FGameplayTag m_DefaultHitData;                                                    // 0x0000 (size: 0x8)
    TMap<class FGameplayTag, class FGameplayTag> m_HitCueDataBySpecie;                // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FHitSpaceParams
{
    float m_FrontAngleDegrees;                                                        // 0x0000 (size: 0x4)
    float m_BackAngleDegrees;                                                         // 0x0004 (size: 0x4)
    FName m_HitBoneName;                                                              // 0x0008 (size: 0x8)
    FVector m_HitBoneSpace;                                                           // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FHitType
{
}; // Size: 0x1

struct FIgnoredCrimeSetup
{
    FGameplayTagContainer AffectedLocations;                                          // 0x0000 (size: 0x20)
    TMap<class FGameplayTag, class FGameplayTagContainer> ByGuild;                    // 0x0020 (size: 0x50)

}; // Size: 0x70

struct FInGameTime
{
    double TotalSeconds;                                                              // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FIncomingCameraEvent
{
    FGameplayTag EventTag;                                                            // 0x0000 (size: 0x8)
    FGameplayEventData EventData;                                                     // 0x0008 (size: 0xB0)
    uint64 AtFrame;                                                                   // 0x00B8 (size: 0x8)

}; // Size: 0xC0

struct FIndoorDetectionResult
{
    float TotalScore;                                                                 // 0x0000 (size: 0x4)
    bool bIsIndoors;                                                                  // 0x0004 (size: 0x1)
    float IsIndoorsConfidence;                                                        // 0x0008 (size: 0x4)
    FVector FreenessNegativeAxis;                                                     // 0x0010 (size: 0x18)
    FVector FreenessPositiveAxis;                                                     // 0x0028 (size: 0x18)

}; // Size: 0x40

struct FIndoorDetectionSampler
{
    float SweepTraceSphereRadius;                                                     // 0x0000 (size: 0x4)
    int32 NumSamples;                                                                 // 0x0004 (size: 0x4)
    TEnumAsByte<ECollisionChannel> CollisionChannel;                                  // 0x0008 (size: 0x1)
    float TraceRadius;                                                                // 0x000C (size: 0x4)
    float ConeFullAngleDegrees;                                                       // 0x0010 (size: 0x4)
    float ScoreWeight_Indoor_EnclosedByWalls;                                         // 0x00B0 (size: 0x4)
    float ScoreWeight_Indoor_HasRoof;                                                 // 0x00B4 (size: 0x4)
    float ScoreWeight_Outdoor_NoWalls;                                                // 0x00B8 (size: 0x4)
    float ScoreWeight_Outdoor_VisibleSky;                                             // 0x00BC (size: 0x4)
    TArray<class AActor*> IgnoredActors;                                              // 0x00C0 (size: 0x10)

}; // Size: 0xD0

struct FInitialAttributeValues
{
    TMap<FString, float> m_InitialValues;                                             // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FInnerItems
{
    TArray<FName> m_Keys;                                                             // 0x0000 (size: 0x10)
    TArray<FItemSlot> m_Values;                                                       // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FInteraction
{
    FGameplayTag ActionTag;                                                           // 0x0000 (size: 0x8)
    int32 Priority;                                                                   // 0x0008 (size: 0x4)
    float Weight;                                                                     // 0x000C (size: 0x4)
    float DurationSeconds;                                                            // 0x0010 (size: 0x4)
    float DurationVariance;                                                           // 0x0014 (size: 0x4)
    float CooldownOnFail;                                                             // 0x0018 (size: 0x4)
    float LastTimeFailed;                                                             // 0x001C (size: 0x4)
    bool bMayUseCustomAbility;                                                        // 0x0020 (size: 0x1)
    TMap<class FGameplayTag, class FInGameTime> RequireTimeSinceAction;               // 0x0028 (size: 0x50)

}; // Size: 0x78

struct FInteractionAnimTransition
{
    FName FromSection;                                                                // 0x0000 (size: 0x8)
    TSoftObjectPtr<UAnimMontage> FromMontage;                                         // 0x0008 (size: 0x28)
    FName ToSection;                                                                  // 0x0030 (size: 0x8)
    TSoftObjectPtr<UAnimMontage> ToMontage;                                           // 0x0038 (size: 0x28)
    bool bSeamless;                                                                   // 0x0060 (size: 0x1)
    bool bReturnToMainLoopAfterEnd;                                                   // 0x0061 (size: 0x1)
    bool bAutoTransitionForPlayer;                                                    // 0x0062 (size: 0x1)
    bool bIgnoreCooldowns;                                                            // 0x0063 (size: 0x1)
    float CooldownSeconds;                                                            // 0x0064 (size: 0x4)
    float CooldownAfterAnyTransition;                                                 // 0x0068 (size: 0x4)
    float BlockOtherTransitionsForSeconds;                                            // 0x006C (size: 0x4)
    float Probability;                                                                // 0x0070 (size: 0x4)
    float Weight;                                                                     // 0x0074 (size: 0x4)
    FGameplayTagContainer ActionTags;                                                 // 0x0078 (size: 0x20)
    FGameplayTagContainer RequireCharacterHasAnyOf;                                   // 0x0098 (size: 0x20)
    FGameplayTagContainer RequireCharacterHasNoneOf;                                  // 0x00B8 (size: 0x20)
    FInteractionAnimTransitionOnTransition OnTransition;                              // 0x00DC (size: 0x10)
    void InteractionAnimTransitionActivated();
    FInteractionAnimTransitionCondition Condition;                                    // 0x00EC (size: 0x10)
    bool InteractionAnimTransitionCondition();
    FText DisplayText;                                                                // 0x0100 (size: 0x10)
    EInteractionInputKind TransitionKind;                                             // 0x0110 (size: 0x1)
    float OverrideBlendInTime;                                                        // 0x0114 (size: 0x4)
    float BlendOutDurationMultiplier;                                                 // 0x0118 (size: 0x4)

}; // Size: 0x120

struct FInteractionSpot
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FRotator Rotation;                                                                // 0x0018 (size: 0x18)
    FName Name;                                                                       // 0x0030 (size: 0x8)
    FGameplayTagContainer PossibleActions;                                            // 0x0038 (size: 0x20)
    bool bAllowAnyOrientationWhenUsing;                                               // 0x0058 (size: 0x1)
    bool bAllowChainingActions;                                                       // 0x0059 (size: 0x1)
    EInteractionSpotEntryDirection EntryDirection;                                    // 0x005A (size: 0x1)
    float AreaRadius;                                                                 // 0x005C (size: 0x4)
    int32 NumAllowedUsers;                                                            // 0x0060 (size: 0x4)
    float Priority;                                                                   // 0x0064 (size: 0x4)
    TSoftObjectPtr<AActor> ActorToInteractWith;                                       // 0x0068 (size: 0x28)
    TSoftObjectPtr<UDataLayerAsset> DataLayer;                                        // 0x0090 (size: 0x28)
    float CooldownDuration;                                                           // 0x00B8 (size: 0x4)
    float LastTimeUsed;                                                               // 0x00BC (size: 0x4)
    TArray<FInstancedStruct> CustomRequirements;                                      // 0x00E8 (size: 0x10)

}; // Size: 0x118

struct FInteractionSpotClaimToken
{
}; // Size: 0x10

struct FInteractionSpotDefinitionList
{
    TArray<FInteractionSpot> InteractionSpots;                                        // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FInteractionSpotHandle
{
    FName Spotname;                                                                   // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FInteractionSpotRequirements
{
    bool bAlwaysAllowPlayerUse;                                                       // 0x0008 (size: 0x1)
    FGameplayTagContainer AffectsActions;                                             // 0x0010 (size: 0x20)
    EInteractionSpotRequirementsMode AllowWhenConditionsAre;                          // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FInteractionSpotRequirementsPack
{
    bool bEnable_TagClaimRequirements;                                                // 0x0000 (size: 0x1)
    FTagClaimRequirements OwnedCharacterTags;                                         // 0x0008 (size: 0x78)
    bool bEnable_UniqueNameRequirements;                                              // 0x0080 (size: 0x1)
    FUniqueNameRequirements UniqueNames;                                              // 0x0088 (size: 0x88)
    bool bEnable_CharacterSpeciesRequirements;                                        // 0x0110 (size: 0x1)
    FCharacterSpeciesRequirements Species;                                            // 0x0118 (size: 0x58)
    bool bEnable_CharacterTypeTagRequirements;                                        // 0x0170 (size: 0x1)
    FCharacterTypeTagRequirements CharacterType;                                      // 0x0178 (size: 0x58)
    bool bEnable_CharacterGuildRequirements;                                          // 0x01D0 (size: 0x1)
    FCharacterGuildRequirements Guild;                                                // 0x01D8 (size: 0x58)
    bool bEnable_WeatherRequirements;                                                 // 0x0230 (size: 0x1)
    FWeatherRequirements Weather;                                                     // 0x0238 (size: 0x40)
    bool bEnable_OtherSpotOccupiedRequirements;                                       // 0x0278 (size: 0x1)
    FOtherSpotOccupiedRequirements OtherSpot;                                         // 0x0280 (size: 0x78)
    bool bEnable_StoryValueRequirements;                                              // 0x02F8 (size: 0x1)
    FStoryValueRequirements StoryValue;                                               // 0x0300 (size: 0x58)
    bool bEnable_StoryQuestRequirements;                                              // 0x0358 (size: 0x1)
    FStoryQuestRequirements QuestState;                                               // 0x0360 (size: 0x48)
    bool bEnable_TimeRangeRequirements;                                               // 0x03A8 (size: 0x1)
    FTimeRangeRequirements TimeRanges;                                                // 0x03B0 (size: 0x48)
    bool bEnable_AIWorldEventRequirements;                                            // 0x03F8 (size: 0x1)
    FAIWorldEventRequirements AIWorldEvents;                                          // 0x0400 (size: 0x48)
    bool bEnable_InventoryItemRequirements;                                           // 0x0448 (size: 0x1)
    FInventoryItemRequirements InventoryItemRequirements;                             // 0x0450 (size: 0x50)
    bool bEnable_TimeSinceLastUseRequirements;                                        // 0x04A0 (size: 0x1)
    FTimeSinceLastUseRequirements TimeSinceLastUseRequirements;                       // 0x04A8 (size: 0x40)

}; // Size: 0x4E8

struct FInteractionSpotUseToken
{
}; // Size: 0x10

struct FInteractiveComponentConfigurationSet
{
    class UInteractiveObjectDefinition* ItemDefinition;                               // 0x0000 (size: 0x8)
    FName DefaultInteractionBaseName;                                                 // 0x0008 (size: 0x8)
    FGameplayTagContainer AdditionalPossibleActions;                                  // 0x0010 (size: 0x20)

}; // Size: 0x30

struct FInventoryByChapter
{
    TMap<class FString, class FTraderInventoryMap> m_ItemsByChapter;                  // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FInventoryItemRequirements : public FInteractionSpotRequirements
{
    FGameplayTag ItemTypeTag;                                                         // 0x0038 (size: 0x8)
    bool bRequireMinCount;                                                            // 0x0040 (size: 0x1)
    int32 MinCount;                                                                   // 0x0044 (size: 0x4)
    bool bRequireMaxCount;                                                            // 0x0048 (size: 0x1)
    int32 MaxCount;                                                                   // 0x004C (size: 0x4)

}; // Size: 0x50

struct FIslandGroupWrapper
{
    TArray<uint64> NodeIDs;                                                           // 0x0000 (size: 0x10)
    bool bOrdered;                                                                    // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FItemActionHandler
{
    class UItemDefinition* ItemDefinition;                                            // 0x0000 (size: 0x8)
    TSubclassOf<class UActionKeywords> ItemActionClass;                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FItemAdded
{
    FText PickedItemName;                                                             // 0x0000 (size: 0x10)
    int32 PickedItemAmount;                                                           // 0x0010 (size: 0x4)
    EInventoryFilterTypes PickedItemCategory;                                         // 0x0014 (size: 0x1)
    class UTexture2D* Icon;                                                           // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FItemDefinition_LTMData
{
    TMap<class TSubclassOf<UItemDefinition>, class FInGameTime> m_LastUpdates;        // 0x0000 (size: 0x50)
    TMap<class TSubclassOf<UItemDefinition>, class FInGameTime> m_LastInspections;    // 0x0050 (size: 0x50)

}; // Size: 0xA0

struct FItemInShop
{
    class UItemDefinition* m_ItemDef;                                                 // 0x0000 (size: 0x8)
    TSoftObjectPtr<UTexture2D> m_AlternativeIconPath;                                 // 0x0008 (size: 0x28)
    FString m_ItemName;                                                               // 0x0030 (size: 0x10)
    int32 m_ItemAmount;                                                               // 0x0040 (size: 0x4)
    int32 m_ItemPrice;                                                                // 0x0044 (size: 0x4)
    int32 m_ItemPreviousPrice;                                                        // 0x0048 (size: 0x4)
    int32 m_ItemId;                                                                   // 0x004C (size: 0x4)
    EInventoryTypes m_eInventoryType;                                                 // 0x0050 (size: 0x1)
    int32 m_SlotId;                                                                   // 0x0054 (size: 0x4)
    int32 m_ItemAmountDefault;                                                        // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FItemMapWrapper
{
    TMap<int32, TSubclassOf<UItemDefinition>> ItemsList;                              // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FItemPayload
{
    FReplicatedStringMap m_GenericData;                                               // 0x0000 (size: 0x20)
    int32 m_StageLevel;                                                               // 0x0020 (size: 0x4)
    UClass* m_OptionalObject;                                                         // 0x0028 (size: 0x8)
    FInnerItems m_InnerItems;                                                         // 0x0030 (size: 0x20)
    FOwnershipSettings m_Ownership;                                                   // 0x0050 (size: 0x38)

}; // Size: 0x88

struct FItemSlot
{
    TSubclassOf<class UItemDefinition> m_ItemDefinition;                              // 0x0000 (size: 0x8)
    int32 m_ItemCount;                                                                // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FItemSpawnConfig
{
    FName m_WorldPoint;                                                               // 0x0000 (size: 0x8)
    bool m_IsActive;                                                                  // 0x0008 (size: 0x1)
    bool m_Refillable;                                                                // 0x0009 (size: 0x1)
    int32 m_RefillHours;                                                              // 0x000C (size: 0x4)
    TArray<FSpawnItemList> m_InitialItems;                                            // 0x0010 (size: 0x10)
    TArray<FSpawnItemEvent> m_EventItems;                                             // 0x0020 (size: 0x10)
    bool m_InheritOwnerFromArea;                                                      // 0x0030 (size: 0x1)
    TArray<class TSubclassOf<UCharacterDefinition>> m_OwnedByCharacter;               // 0x0038 (size: 0x10)
    FGameplayTagContainer m_OwnedByGuild;                                             // 0x0048 (size: 0x20)

}; // Size: 0x68

struct FItemSpawnPosition
{
    FTransform m_Transform;                                                           // 0x0000 (size: 0x60)
    FString m_Mesh;                                                                   // 0x0060 (size: 0x10)
    int32 m_SocketId;                                                                 // 0x0070 (size: 0x4)
    FTransform m_SocketTransform;                                                     // 0x0080 (size: 0x60)

}; // Size: 0xE0

struct FItemSpawnpointConfig : public FSpawnpointConfig
{
    TSubclassOf<class UItemDefinition> m_ItemDefinition;                              // 0x0070 (size: 0x8)

}; // Size: 0x80

struct FItemTooltipInfo
{
    EInventoryOpenedStates InventoryOpenedState;                                      // 0x0000 (size: 0x1)
    bool IsValid;                                                                     // 0x0001 (size: 0x1)
    FText ItemName;                                                                   // 0x0008 (size: 0x10)
    FText ItemDescription;                                                            // 0x0018 (size: 0x10)
    int32 ItemHotkey;                                                                 // 0x0028 (size: 0x4)
    bool IsEquipped;                                                                  // 0x002C (size: 0x1)
    bool CanBeEquipped;                                                               // 0x002D (size: 0x1)
    bool CanBePurchased;                                                              // 0x002E (size: 0x1)
    bool CanAfford;                                                                   // 0x002F (size: 0x1)
    FText ItemType;                                                                   // 0x0030 (size: 0x10)
    TMap<FGameplayTag, float> EquippedItemStats;                                      // 0x0040 (size: 0x50)
    TMap<FGameplayTag, float> SelectedItemStats;                                      // 0x0090 (size: 0x50)
    TArray<FSelectedItemStats> SelectedItemStatsArray;                                // 0x00E0 (size: 0x10)
    TArray<FGameplayAttribute> PlayerAttributeName;                                   // 0x00F0 (size: 0x10)
    TArray<float> PlayerAttributeValue;                                               // 0x0100 (size: 0x10)
    TMap<FGameplayAttribute, float> WeaponRequiredStats;                              // 0x0110 (size: 0x50)
    FGameplayTag ItemTypeTag;                                                         // 0x0160 (size: 0x8)
    FGameplayTagContainer ItemSpecTagContainer;                                       // 0x0168 (size: 0x20)
    TMap<FGameplayAttribute, float> ItemAttributes;                                   // 0x0188 (size: 0x50)
    TMap<FGameplayAttribute, float> OthersAttributes;                                 // 0x01D8 (size: 0x50)
    FRuneStats RuneStats;                                                             // 0x0228 (size: 0x58)
    FTooltipInfoRecipe InfoRecipe;                                                    // 0x0280 (size: 0xA8)

}; // Size: 0x328

struct FItemTransferInfo
{
    bool m_ToLootContainer;                                                           // 0x0000 (size: 0x1)
    class UInventoryMain* m_Inventory;                                                // 0x0008 (size: 0x8)
    int32 m_ItemId;                                                                   // 0x0010 (size: 0x4)
    EInventoryTypes m_InventoryType;                                                  // 0x0014 (size: 0x1)
    float m_Amount;                                                                   // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FItemVirtualData
{
    int32 m_Id;                                                                       // 0x0000 (size: 0x4)
    EInventoryTypes m_InventoryType;                                                  // 0x0004 (size: 0x1)
    FItemSlot m_SlotData;                                                             // 0x0008 (size: 0x10)
    FItemPayload m_Payload;                                                           // 0x0018 (size: 0x88)

}; // Size: 0xB0

struct FItemsToAdd
{
}; // Size: 0x10

struct FJumpDown_SearchEdgeSettings
{
    float m_StartForwardOffset;                                                       // 0x0000 (size: 0x4)
    float m_MaxJumpDownHeight;                                                        // 0x0004 (size: 0x4)
    float m_MinJumpDownHeight;                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FKnowledgeSet
{
    TSet<FName> Knowledge;                                                            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FLandingMontages
{
    TMap<float, TSoftObjectPtr<UAnimMontage>> Montages;                               // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FLeanAmountS
{
    float LR;                                                                         // 0x0000 (size: 0x4)
    float FB;                                                                         // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FLightConfig
{
    FLinearColor Color;                                                               // 0x0000 (size: 0x10)
    float Intensity;                                                                  // 0x0010 (size: 0x4)
    float VolumetricScattering;                                                       // 0x0014 (size: 0x4)
    class UMaterialInterface* LightFunctionMaterial;                                  // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FLightPreset
{
    float m_Intensity;                                                                // 0x0000 (size: 0x4)
    TMap<float, FColor> m_DayHourColor;                                               // 0x0008 (size: 0x50)
    TMap<float, FColor> m_NightHourColor;                                             // 0x0058 (size: 0x50)

}; // Size: 0xA8

struct FLightSet
{
    FLightValues KeyLightParam;                                                       // 0x0000 (size: 0x430)
    FLightValues RimLightParam;                                                       // 0x0430 (size: 0x430)
    FLightValues KeyReverseLightParam;                                                // 0x0860 (size: 0x430)
    FLightValues RimReverseLightParam;                                                // 0x0C90 (size: 0x430)
    TArray<FLightValues> AdditionalLights;                                            // 0x10C0 (size: 0x10)
    float BarnDoorAngle;                                                              // 0x10D0 (size: 0x4)
    float BarnDoorLength;                                                             // 0x10D4 (size: 0x4)
    float VolumetricScatteringIntensity;                                              // 0x10D8 (size: 0x4)
    float IndirectLightingIntensity;                                                  // 0x10DC (size: 0x4)
    FLightingChannelsEditable SpeakerLightingChannels;                                // 0x10E0 (size: 0x1)
    FLightingChannelsEditable ListenerLightingChannels;                               // 0x10E1 (size: 0x1)
    FLightingChannelsEditable AdditionalParticipantLightingChannels;                  // 0x10E2 (size: 0x1)
    ELightUnits LightUnitType;                                                        // 0x10E3 (size: 0x1)
    EConversationCameraShotMode ShotMode;                                             // 0x10E4 (size: 0x1)
    float DiffuseColorBoost;                                                          // 0x10E8 (size: 0x4)
    float MaxTraceDistance;                                                           // 0x10EC (size: 0x4)
    float EyeIntensity;                                                               // 0x10F0 (size: 0x4)

}; // Size: 0x1100

struct FLightSourceData
{
    float Intensity;                                                                  // 0x0000 (size: 0x4)
    FVector position;                                                                 // 0x0008 (size: 0x18)
    FVector Direction;                                                                // 0x0020 (size: 0x18)

}; // Size: 0x38

struct FLightValues
{
    FRuntimeVectorCurve LightPos;                                                     // 0x0000 (size: 0x188)
    FRuntimeVectorCurve LightRotOffset;                                               // 0x0188 (size: 0x188)
    FLinearColor LightColor;                                                          // 0x0310 (size: 0x10)
    FRuntimeFloatCurve LightIntensityCurve;                                           // 0x0320 (size: 0x88)
    FTransform LightTransform;                                                        // 0x03B0 (size: 0x60)
    float Intensity;                                                                  // 0x0410 (size: 0x4)
    float SourceWidth;                                                                // 0x0414 (size: 0x4)
    float SourceHeight;                                                               // 0x0418 (size: 0x4)
    float AttenuationRadius;                                                          // 0x041C (size: 0x4)
    FLightingChannelsEditable LightingChannels;                                       // 0x0420 (size: 0x1)
    FName LightMaterialName;                                                          // 0x0424 (size: 0x8)
    EConversationCameraRelativeParticipant RelativeParticipant;                       // 0x042C (size: 0x1)

}; // Size: 0x430

struct FLightingChannelsEditable
{
    uint8 bChannel0;                                                                  // 0x0000 (size: 0x1)
    uint8 bChannel1;                                                                  // 0x0000 (size: 0x1)
    uint8 bChannel2;                                                                  // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FLightingMagnetHandle
{
    float Timer;                                                                      // 0x0000 (size: 0x4)
    float CallAfterTime;                                                              // 0x0004 (size: 0x4)
    int32 LastIndex;                                                                  // 0x0008 (size: 0x4)
    ESelectionType NextSelection;                                                     // 0x000C (size: 0x1)

}; // Size: 0x10

struct FLightingModifierDebugValues
{
    TArray<class ULightingModifier*> CurrentModifiers;                                // 0x0000 (size: 0x10)

}; // Size: 0x890

struct FLinkedInstances
{
    FName Group;                                                                      // 0x0000 (size: 0x8)
    TSubclassOf<class UAnimInstance> LinkedAnimInstance;                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FLocationMemoryCrimeDataEntry
{
    FGameplayTag AssociatedGuild;                                                     // 0x0000 (size: 0x8)
    FGameplayTag LocationTag;                                                         // 0x0008 (size: 0x8)
    EAreaBoundMemoryContainerType ContainerType;                                      // 0x0010 (size: 0x1)
    TArray<int32> KnownCrimeIDs;                                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FLocationMemorySpreadingPathway
{
}; // Size: 0x24

struct FLockConnections
{
    TArray<int32> m_Ids;                                                              // 0x0000 (size: 0x10)
    TArray<int32> m_Direction;                                                        // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FLockOneConnection
{
    int32 m_Id;                                                                       // 0x0000 (size: 0x4)
    int32 m_Direction;                                                                // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FLocomotionCurveSettings
{
    class UCurveFloat* m_BuoyancyCurve;                                               // 0x0000 (size: 0x8)
    class UCurveFloat* m_GroundFrictionCurve;                                         // 0x0008 (size: 0x8)
    class UCurveFloat* m_AirFrictionCurve;                                            // 0x0010 (size: 0x8)
    class UCurveFloat* m_DecelerationCurve;                                           // 0x0018 (size: 0x8)
    class UCurveFloat* m_AccelerationCurve;                                           // 0x0020 (size: 0x8)
    class UCurveFloat* m_RotationRateCurve;                                           // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FLogicalLightReceiverState
{
}; // Size: 0x100

struct FLongTermMemoryHandle : public FArrayElementHandle
{
}; // Size: 0x8

struct FLongtermMemoryCrimeDataEntry
{
}; // Size: 0x30

struct FMainPlayerSaveGameData
{
    int32 m_RandomNUmber;                                                             // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FMapMarkerArrayData
{
    TMap<class FVector2D, class FGameplayTag> m_MapMarkersDataArray;                  // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FMapPlayerPosAndRot
{
}; // Size: 0x18

struct FMaterialInstanceDynamicParameterPack
{
    TMap<FName, float> ScalarParameterValues;                                         // 0x0000 (size: 0x50)
    TMap<class FName, class FLinearColor> VectorParameterValues;                      // 0x0050 (size: 0x50)
    TMap<class FName, class UTexture*> TextureParameterValues;                        // 0x00A0 (size: 0x50)

}; // Size: 0xF0

struct FMemorizedEvent
{
    FVector position;                                                                 // 0x0000 (size: 0x18)
    FInGameTime Time;                                                                 // 0x0018 (size: 0x8)
    FInGameTime Duration;                                                             // 0x0028 (size: 0x8)
    FName InstigatorGlobalId;                                                         // 0x0030 (size: 0x8)
    FName AffectedCharacterGlobalId;                                                  // 0x0038 (size: 0x8)
    FGameplayTagContainer EventTags;                                                  // 0x0040 (size: 0x20)
    float Magnitude;                                                                  // 0x0060 (size: 0x4)
    FInstancedStruct Payload;                                                         // 0x0068 (size: 0x10)
    TSoftClassPtr<UObject> OptionalClass1;                                            // 0x0078 (size: 0x28)
    TSoftClassPtr<UObject> OptionalClass2;                                            // 0x00A0 (size: 0x28)

}; // Size: 0xC8

struct FMemoryFilter
{
    class ULongTermMemoryComponent* Owner;                                            // 0x0000 (size: 0x8)

}; // Size: 0x20

struct FModExport_RegionVolume
{
    FTransform Transform;                                                             // 0x0000 (size: 0x60)
    TArray<FVector> Vertices;                                                         // 0x0060 (size: 0x10)
    TArray<FBuilderPoly> Polygons;                                                    // 0x0070 (size: 0x10)
    TArray<class URegionTrait*> Traits;                                               // 0x0080 (size: 0x10)

}; // Size: 0x90

struct FMontageHistory
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    FString Slot;                                                                     // 0x0010 (size: 0x10)
    FString Section;                                                                  // 0x0020 (size: 0x10)
    FString SequenceName;                                                             // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FNameForInputAction : public FTableRowBase
{
    class UInputAction* InputAction;                                                  // 0x0008 (size: 0x8)
    TArray<class UInputMappingContext*> InputMappingContexts;                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FNpcTalentVirtualData
{
    FName m_TalentName;                                                               // 0x0000 (size: 0x8)
    int32 m_TalentLevel;                                                              // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FOcclusionSamplePoint
{
    FVector position;                                                                 // 0x0000 (size: 0x18)
    float OcclusionValue;                                                             // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FOnlineSessionFindResult
{
    FString SessionId;                                                                // 0x0000 (size: 0x10)
    FString serverName;                                                               // 0x0010 (size: 0x10)
    int32 numOpenPublicConnections;                                                   // 0x0020 (size: 0x4)
    int32 pingInMs;                                                                   // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FOptimizedBoneColliderComponent
{
    FTransform Transform;                                                             // 0x0000 (size: 0x60)

}; // Size: 0x70

struct FOptimizedBoneColliderUpdate
{
    TMap<class USceneComponent*, class FOptimizedBoneColliderComponent> ComponentsToUpdateToRelativeTransforms; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FOtherSpotOccupiedRequirements : public FInteractionSpotRequirements
{
    FInteractionSpotHandle OtherSpotHandle;                                           // 0x0038 (size: 0x8)
    EInteractionSpotOccupation OtherSpotMustBe;                                       // 0x0040 (size: 0x1)
    FGameplayTagContainer OtherSpotMustUsedByCharacterThatHasAllOf;                   // 0x0048 (size: 0x20)
    EInteractionSpotConditions OtherSpotConditions;                                   // 0x0068 (size: 0x1)
    FGameplayTag OtherSpotConditionAction;                                            // 0x006C (size: 0x8)

}; // Size: 0x78

struct FOutlineComponentData
{
    class UPrimitiveComponent* RenderingComponent;                                    // 0x0000 (size: 0x8)
    FOutlineRenderingData DefaultOutlineData;                                         // 0x0008 (size: 0xC)
    FOutlineRenderingData DesiredOutlineData;                                         // 0x0014 (size: 0xC)

}; // Size: 0x20

struct FOutlineInteractor
{
    TArray<FOutlineComponentData> ComponentsData;                                     // 0x0000 (size: 0x10)
    FOutlineVFX OutlineVFX;                                                           // 0x0010 (size: 0xC)
    bool KeepTrackFromSensor;                                                         // 0x001C (size: 0x1)

}; // Size: 0x20

struct FOutlineRenderingData
{
    bool RenderCustomDepth;                                                           // 0x0000 (size: 0x1)
    int32 CustomDepthStencil;                                                         // 0x0004 (size: 0x4)
    ERendererStencilMask CustomStencilWriteMask;                                      // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FOutlineStencilUsageData
{
    FLinearColor Color;                                                               // 0x0000 (size: 0x10)
    FName ShaderVariableName;                                                         // 0x0010 (size: 0x8)
    FOutlineRenderingData RenderingData;                                              // 0x0018 (size: 0xC)

}; // Size: 0x24

struct FOutlineVFX
{
    float FadeTime;                                                                   // 0x0000 (size: 0x4)
    int32 StencilValue;                                                               // 0x0004 (size: 0x4)
    bool IsAppearing;                                                                 // 0x0008 (size: 0x1)
    bool NeedsUpdate;                                                                 // 0x0009 (size: 0x1)
    EStencilsUsage StencilUsage;                                                      // 0x000A (size: 0x1)

}; // Size: 0xC

struct FOverrideFogCache
{
    TArray<FFogVolumeSettings> FogSettingsWithAlpha;                                  // 0x0000 (size: 0x10)
    float FogAlpha;                                                                   // 0x0010 (size: 0x4)
    float WeatherAlpha;                                                               // 0x0014 (size: 0x4)
    float ExtraFogStart;                                                              // 0x0018 (size: 0x4)
    bool ShouldStopRain;                                                              // 0x001C (size: 0x1)

}; // Size: 0x20

struct FOverrideTimeByRange
{
    FClockTime From;                                                                  // 0x0000 (size: 0x10)
    FClockTime To;                                                                    // 0x0010 (size: 0x10)
    FClockTime Time;                                                                  // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FOverrideVolumeCache
{
    TArray<float> Alphas;                                                             // 0x0010 (size: 0x10)
    float TemperatureOffset;                                                          // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FOwnedLooseGameplayTags
{
}; // Size: 0x50

struct FOwnershipSettings
{
    FGameplayTag UseOwnershipOfArea;                                                  // 0x0000 (size: 0x8)
    FGameplayTagContainer OwnedByGuild;                                               // 0x0008 (size: 0x20)
    TArray<class TSubclassOf<UCharacterDefinition>> OwnedByCharacter;                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FPageContent
{
    TArray<class UDocumentElement*> m_OrderedElements;                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FParticlePoint
{
    FVector m_Position;                                                               // 0x0000 (size: 0x18)
    FRotator m_Rotator;                                                               // 0x0018 (size: 0x18)
    class AActor* m_ParticleSystem;                                                   // 0x0030 (size: 0x8)

}; // Size: 0x40

struct FPathfollowModifyAvoidVelocitySettings
{
    bool bUseBasicSpeedModification;                                                  // 0x0000 (size: 0x1)
    float MediumRangeVelocityMultiplier;                                              // 0x0004 (size: 0x4)
    float ShortRangeVelocityMultiplier;                                               // 0x0008 (size: 0x4)
    bool bUseFastSpeedModification;                                                   // 0x000C (size: 0x1)
    float FastSpeedVelocityMultiplier;                                                // 0x0010 (size: 0x4)
    bool bUseSlowdownNearCurves;                                                      // 0x0014 (size: 0x1)
    float SlowDownNearCurvesSpeed;                                                    // 0x0018 (size: 0x4)
    float SlowDownNearCurvesForecastTime;                                             // 0x001C (size: 0x4)
    float SteerSpeedAgentRadiusRangeMultiplier;                                       // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FPathfollowMoveFocusSettings
{
    float FocalPointDistance;                                                         // 0x0000 (size: 0x4)
    float FocalPointHeightMultiplier;                                                 // 0x0004 (size: 0x4)
    float FocalPointHigherRankedCharacterHeightMultiplier;                            // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPerceivedAgent
{
    FVector AtPosition;                                                               // 0x0008 (size: 0x18)
    FVector AtNavPosition;                                                            // 0x0020 (size: 0x18)
    FGameplayTagContainer Tags;                                                       // 0x0038 (size: 0x20)
    EPerceptionSense ViaSense;                                                        // 0x0058 (size: 0x1)
    ERelationship Relationship;                                                       // 0x0059 (size: 0x1)
    ERelationshipHostility Hostility;                                                 // 0x005A (size: 0x1)
    ERelationshipRelativeRank RelativeRank;                                           // 0x005B (size: 0x1)
    FPursuedCrimeSet CrimesPursuedBySensor;                                           // 0x0060 (size: 0x50)
    class AGothicCharacterState* RepresentedCharacterState;                           // 0x00B0 (size: 0x8)
    float Awareness;                                                                  // 0x00B8 (size: 0x4)

}; // Size: 0xC0

struct FPerceivedInteractiveObject
{
    class UItemDefinition* ItemDefinition;                                            // 0x0000 (size: 0x8)
    class UInteractiveObjectDefinition* InteractiveObjectDefinition;                  // 0x0008 (size: 0x8)
    FOwnershipSettings ObjectOwnershipSettings;                                       // 0x0010 (size: 0x38)
    TSoftObjectPtr<AInteractiveObjectActor> InteractiveObjectActor;                   // 0x0048 (size: 0x28)

}; // Size: 0x78

struct FPerceptionAgentHandle : public FArrayElementHandle
{
}; // Size: 0x8

struct FPerceptionEvent
{
}; // Size: 0xB0

struct FPerceptionHandler
{
    TWeakObjectPtr<class UObject> WeakContext;                                        // 0x0008 (size: 0x8)
    FPerceptionHandlerHandle Handle;                                                  // 0x0010 (size: 0x8)
    FGameplayTagContainer HandleCharactersWith;                                       // 0x0018 (size: 0x20)
    FGameplayTagContainer HandleCharactersWithAny;                                    // 0x0038 (size: 0x20)
    FGameplayTagContainer IgnoreCharactersWith;                                       // 0x0058 (size: 0x20)
    FGameplayTagContainer HandleTargetCharactersWith;                                 // 0x0078 (size: 0x20)
    FGameplayTagContainer HandleTargetCharactersWithAny;                              // 0x0098 (size: 0x20)
    FGameplayTagContainer IgnoreTargetCharactersWith;                                 // 0x00B8 (size: 0x20)
    FGameplayTagContainer HandleAffectedCharactersWith;                               // 0x00D8 (size: 0x20)
    FGameplayTagContainer HandleAffectedCharactersWithAny;                            // 0x00F8 (size: 0x20)
    FGameplayTagContainer IgnoreAffectedCharactersWith;                               // 0x0118 (size: 0x20)
    FGameplayTagContainer HandleInstigatorCharactersWith;                             // 0x0138 (size: 0x20)
    FGameplayTagContainer HandleInstigatorCharactersWithAny;                          // 0x0158 (size: 0x20)
    FGameplayTagContainer IgnoreInstigatorCharactersWith;                             // 0x0178 (size: 0x20)
    FGameplayTagContainer HandleSensingCharactersWith;                                // 0x0198 (size: 0x20)
    FGameplayTagContainer HandleSensingCharactersWithAny;                             // 0x01B8 (size: 0x20)
    FGameplayTagContainer IgnoreSensingCharactersWith;                                // 0x01D8 (size: 0x20)
    bool bOriginHasToBeACharacter;                                                    // 0x01F8 (size: 0x1)
    bool bTargetHasToBeACharacter;                                                    // 0x01F9 (size: 0x1)
    bool bAffectedHasToBeACharacter;                                                  // 0x01FA (size: 0x1)
    bool bInstigatorHasToBeACharacter;                                                // 0x01FB (size: 0x1)
    float TickRateSeconds;                                                            // 0x0244 (size: 0x4)
    float MaxDistanceToOther;                                                         // 0x0248 (size: 0x4)
    float MinDistanceToOther;                                                         // 0x024C (size: 0x4)
    float EntryAwareness;                                                             // 0x0250 (size: 0x4)
    float ExitAwareness;                                                              // 0x0254 (size: 0x4)
    float MaximalPathLength;                                                          // 0x0258 (size: 0x4)
    float MinimalPathLength;                                                          // 0x025C (size: 0x4)
    bool bFilterForCharactersLookingAtSensor;                                         // 0x0290 (size: 0x1)
    bool bFilterForCharactersLookingAtAllys;                                          // 0x0291 (size: 0x1)
    bool bFilterForCharactersLookingAtSensorOrAllys;                                  // 0x0292 (size: 0x1)
    bool bFilterForSensorLookingAtSomeone;                                            // 0x0293 (size: 0x1)
    bool bRequireFreeLineOfSight;                                                     // 0x0294 (size: 0x1)
    bool bRequireInteractiveObject;                                                   // 0x0295 (size: 0x1)
    TArray<TWeakObjectPtr<AActor>> HandledOriginActors;                               // 0x02B8 (size: 0x10)
    TArray<TWeakObjectPtr<AActor>> ExcludedOriginActors;                              // 0x02C8 (size: 0x10)
    TArray<TWeakObjectPtr<AActor>> ExcludedInstigatorActors;                          // 0x02D8 (size: 0x10)
    TArray<TWeakObjectPtr<AActor>> HandledInstigatorActors;                           // 0x02E8 (size: 0x10)
    TArray<TWeakObjectPtr<AActor>> HandledAffectedActors;                             // 0x02F8 (size: 0x10)
    TArray<TWeakObjectPtr<AActor>> ExcludedAffectedActors;                            // 0x0308 (size: 0x10)
    FGameplayTagContainer AllowedEventTags;                                           // 0x0318 (size: 0x20)
    FGameplayTagContainer AllowedExactEventTags;                                      // 0x0338 (size: 0x20)
    FGameplayTagContainer GainedCharacterTags;                                        // 0x0358 (size: 0x20)
    FGameplayTagContainer LostCharacterTags;                                          // 0x0378 (size: 0x20)
    FGameplayTagContainer HandleEffectCauserWithTags;                                 // 0x0398 (size: 0x20)
    FGameplayTagContainer IgnoreEffectCauserWithTags;                                 // 0x03B8 (size: 0x20)
    FPerceptionHandlerPerceptionGained PerceptionGained;                              // 0x03D8 (size: 0x10)
    void PerceptionDelegate(const FRememberedPerception& Perception, const FPerceptionShortTermMemory& Memory);
    FPerceptionHandlerPerceptionLost PerceptionLost;                                  // 0x03F8 (size: 0x10)
    void PerceptionDelegate(const FRememberedPerception& Perception, const FPerceptionShortTermMemory& Memory);
    FGameplayTagContainer ShouldUpdateOnOriginChangedTag;                             // 0x0418 (size: 0x20)
    FGameplayTagContainer ShouldUpdateOnSensorChangedTag;                             // 0x0438 (size: 0x20)
    FGameplayTagContainer ShouldUpdateOnEvent;                                        // 0x0458 (size: 0x20)
    EOwnershipRelationFlags HandleSensorObjectOwnership;                              // 0x0478 (size: 0x1)
    EOwnershipRelationFlags IgnoreSensorObjectOwnership;                              // 0x0479 (size: 0x1)
    EOwnershipRelationFlags HandleOriginObjectOwnership;                              // 0x047A (size: 0x1)
    EOwnershipRelationFlags IgnoreOriginObjectOwnership;                              // 0x047B (size: 0x1)
    TArray<class TSubclassOf<UInteractiveObjectDefinition>> HandleInteractiveObjects; // 0x0480 (size: 0x10)
    TArray<class TSubclassOf<UInteractiveObjectDefinition>> IgnoreInteractiveObjects; // 0x0490 (size: 0x10)
    FGameplayTag OnlyHandleItemsOfType;                                               // 0x04A0 (size: 0x8)
    FGameplayTagContainer IgnoreItemTypes;                                            // 0x04A8 (size: 0x20)
    FGameplayTagContainer HandleItemSpecs;                                            // 0x04C8 (size: 0x20)
    FGameplayTagContainer IgnoreItemSpecs;                                            // 0x04E8 (size: 0x20)
    TMap<FGameplayTag, float> HandleItemConsumeEffects;                               // 0x0508 (size: 0x50)
    TArray<EPerceptionSense> RequiredSense;                                           // 0x0558 (size: 0x10)
    float HandleItemValue;                                                            // 0x0568 (size: 0x4)
    float DelaySeconds;                                                               // 0x056C (size: 0x4)
    float DelayVariance;                                                              // 0x0570 (size: 0x4)
    float PerceptionGainedCooldownSeconds;                                            // 0x0574 (size: 0x4)
    float PerceptionLostCooldownSeconds;                                              // 0x0578 (size: 0x4)
    bool bRequiresSensing;                                                            // 0x057C (size: 0x1)
    bool bRequiresOriginToBeInSensorArea;                                             // 0x057D (size: 0x1)
    bool bRequiresOriginToBeInSensorGuildArea;                                        // 0x057E (size: 0x1)
    bool bRequiresOriginToBeInSensorPersonalArea;                                     // 0x057F (size: 0x1)
    TArray<FPerceptionHandlerOnShouldHandlePair> OnShouldHandlePair;                  // 0x0580 (size: 0x10)

}; // Size: 0x780

struct FPerceptionHandlerHandle : public FArrayElementHandle
{
}; // Size: 0x8

struct FPerceptionHandlerInvoke
{
}; // Size: 0x18

struct FPerceptionHandlers
{
}; // Size: 0xF0

struct FPerceptionHearingRangeSetting
{
}; // Size: 0x20

struct FPerceptionHearingSettings
{
    FPerceptionHearingRangeSetting HearingRangeSettings;                              // 0x0000 (size: 0x60)
    float WeatherModifier;                                                            // 0x0060 (size: 0x14)
    TMap<FGameplayTag, float> TargetOwnedTagModifiers;                                // 0x0078 (size: 0x50)
    TMap<FGameplayTag, float> SensingOwnedTagModifiers;                               // 0x00C8 (size: 0x50)
    FGameplayTagContainer ExcludingTags;                                              // 0x0118 (size: 0x20)
    bool LoseAwarenessWithExcludingTags;                                              // 0x0138 (size: 0x1)
    float OnScreenSkillModifier;                                                      // 0x013C (size: 0x4)
    float OffScreenSkillModifier;                                                     // 0x0140 (size: 0x4)
    bool bUseLowerOffscreenSkill;                                                     // 0x0144 (size: 0x1)
    FGameplayTagContainer BlockAwarenessWearOffWithSensorTags;                        // 0x0148 (size: 0x20)
    FGameplayTagContainer BlockAwarenessWearOffWithSensedTags;                        // 0x0168 (size: 0x20)
    float AwarenessWearoffFactor;                                                     // 0x0188 (size: 0x4)

}; // Size: 0x190

struct FPerceptionSenseState
{
}; // Size: 0x190

struct FPerceptionSettings
{
    FPerceptionSightSettings Sight;                                                   // 0x0000 (size: 0x280)
    FPerceptionSmellSettings Smell;                                                   // 0x0280 (size: 0x148)
    FPerceptionHearingSettings Hearing;                                               // 0x03C8 (size: 0x190)

}; // Size: 0x558

struct FPerceptionShortTermMemory
{
}; // Size: 0x18

struct FPerceptionShortTermMemoryFilter
{
}; // Size: 0x40

struct FPerceptionSightSettings
{
    FCoffinSenseShape InnerCoffin;                                                    // 0x0000 (size: 0x28)
    FCoffinSenseShape OuterCoffin;                                                    // 0x0028 (size: 0x28)
    FSixthSenseShape SixthSense;                                                      // 0x0050 (size: 0x1C)
    float MinLightIntensity;                                                          // 0x0084 (size: 0x4)
    float MaxLightIntensity;                                                          // 0x0088 (size: 0x4)
    float MinLightModifier;                                                           // 0x008C (size: 0x4)
    float MaxLightModifier;                                                           // 0x0090 (size: 0x4)
    float WeatherModifier;                                                            // 0x0094 (size: 0x14)
    TMap<FGameplayTag, float> MovementModifier;                                       // 0x00A8 (size: 0x50)
    TMap<FGameplayTag, float> MovementModeModifier;                                   // 0x00F8 (size: 0x50)
    float MovementModeDefaultModifier;                                                // 0x0148 (size: 0x4)
    TMap<FGameplayTag, float> TargetOwnedTagModifiers;                                // 0x0150 (size: 0x50)
    TMap<FGameplayTag, float> SensingOwnedTagModifiers;                               // 0x01A0 (size: 0x50)
    FGameplayTagContainer ExcludingTags;                                              // 0x01F0 (size: 0x20)
    bool LoseAwarenessWithExcludingTags;                                              // 0x0210 (size: 0x1)
    float SenseModifier;                                                              // 0x0214 (size: 0x4)
    float SenseModifierThreshold;                                                     // 0x0218 (size: 0x4)
    float AwarenessWearoffFactorNoLineOfSight;                                        // 0x021C (size: 0x4)
    float AwarenessWearoffFactorOutOfShape;                                           // 0x0220 (size: 0x4)
    bool bRequiresFreeLineOfSight;                                                    // 0x0224 (size: 0x1)
    float PeripheralHalfAngle;                                                        // 0x0228 (size: 0x4)
    float MiniMalFocusDistance;                                                       // 0x022C (size: 0x4)
    float HeightParabolAlpha;                                                         // 0x0230 (size: 0x4)
    float HeightParabolOffsetY;                                                       // 0x0234 (size: 0x4)
    float HeightParabolOffsetZ;                                                       // 0x0238 (size: 0x4)
    float ParabolMultiplier;                                                          // 0x023C (size: 0x4)
    FGameplayTagContainer BlockAwarenessWearOffWithSensorTags;                        // 0x0240 (size: 0x20)
    FGameplayTagContainer BlockAwarenessWearOffWithSensedTags;                        // 0x0260 (size: 0x20)

}; // Size: 0x280

struct FPerceptionSmellSettings
{
    float SmellRange;                                                                 // 0x0000 (size: 0x4)
    float WeatherModifier;                                                            // 0x0004 (size: 0x14)
    TMap<FGameplayTag, float> TargetOwnedTagModifiers;                                // 0x0030 (size: 0x50)
    TMap<FGameplayTag, float> SensingOwnedTagModifiers;                               // 0x0080 (size: 0x50)
    float OnScreenSkillModifier;                                                      // 0x00D0 (size: 0x4)
    float OffScreenSkillModifier;                                                     // 0x00D4 (size: 0x4)
    FGameplayTagContainer ExcludingTags;                                              // 0x00D8 (size: 0x20)
    bool LoseAwarenessWithExcludingTags;                                              // 0x00F8 (size: 0x1)
    bool bUseLowerOffscreenSkill;                                                     // 0x00F9 (size: 0x1)
    float AwarenessWearoffFactor;                                                     // 0x00FC (size: 0x4)
    FGameplayTagContainer BlockAwarenessWearOffWithSensorTags;                        // 0x0100 (size: 0x20)
    FGameplayTagContainer BlockAwarenessWearOffWithSensedTags;                        // 0x0120 (size: 0x20)
    bool bIgnoreObstacles;                                                            // 0x0140 (size: 0x1)

}; // Size: 0x148

struct FPerceptionSoundArea
{
    EPerceptionNoiseLoudness Loudness;                                                // 0x0010 (size: 0x1)
    FVector CenterLocation;                                                           // 0x0018 (size: 0x18)
    float LifeUntilTime;                                                              // 0x0030 (size: 0x4)
    float StartedAtTime;                                                              // 0x0034 (size: 0x4)
    float SoundDuration;                                                              // 0x0038 (size: 0x4)
    FGameplayTag PerceptionTag;                                                       // 0x003C (size: 0x8)
    bool bIsInstantSound;                                                             // 0x0044 (size: 0x1)
    bool IsBoundToOriginActor;                                                        // 0x0045 (size: 0x1)

}; // Size: 0x48

struct FPerceptionSoundAreaHandle : public FArrayElementHandle
{
}; // Size: 0x8

struct FPerceptionSystemWorld
{
    TArray<class UPerceptionAgentSettings*> AgentSettings;                            // 0x00E8 (size: 0x10)

}; // Size: 0x8B8

struct FPersonalAreaOwnershipSettings
{
    FGameplayTagContainer OwnedAreas;                                                 // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FPersonalItemOwnershipSettings
{
    TSet<TSubclassOf<UItemDefinition>> OwnedItems;                                    // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPersonalRelationshipEvaluation : public FRelationshipEvaluation
{
    class AGothicCharacterState* Me;                                                  // 0x00C0 (size: 0x8)
    class AGothicCharacterState* Other;                                               // 0x00C8 (size: 0x8)

}; // Size: 0xD0

struct FPickAndEquipMontage : public FEquipMontage
{
    FName m_Height;                                                                   // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FPickpocketPerceptionSightSettings
{
    float m_Modifier;                                                                 // 0x0000 (size: 0x4)
    float m_MinTimeSeconds;                                                           // 0x0004 (size: 0x4)
    float m_AwarenessThreshold;                                                       // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPickpocketTargetCharacterModifierSettings
{
    float m_Modifier;                                                                 // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FPlayerKeys
{
    TArray<FKey> m_RequiredKeys;                                                      // 0x0000 (size: 0x10)
    ECustomKeyBinding m_KeyBind;                                                      // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FPlayerList
{
}; // Size: 0x10

struct FPlayerSaveData
{
    FString m_PlayerID;                                                               // 0x0000 (size: 0x10)
    FVector m_Location;                                                               // 0x0010 (size: 0x18)
    FRotator m_Rotation;                                                              // 0x0028 (size: 0x18)
    bool m_ResumeAtTransform;                                                         // 0x0040 (size: 0x1)
    FReplicatedInventoryMap m_Inventory;                                              // 0x0048 (size: 0x138)
    TArray<FAttachedItem> m_MapOfAttachedItems;                                       // 0x0180 (size: 0x10)

}; // Size: 0x190

struct FPlayersSaveData
{
    TArray<FPlayerSaveData> m_SavedPlayers;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPointItems
{
    class AActor* m_Actor;                                                            // 0x0000 (size: 0x8)
    FName m_Name;                                                                     // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPointOfInterestInfo
{
    bool m_POIAvailable;                                                              // 0x0000 (size: 0x1)
    FTransform m_StaticTransform;                                                     // 0x0010 (size: 0x60)
    TWeakObjectPtr<class AActor> m_Actor;                                             // 0x0070 (size: 0x8)

}; // Size: 0x80

struct FPresetTransitionEntry
{
    TSubclassOf<class UConversationCameraPresetBase> PossibleNextPresetClass;         // 0x0000 (size: 0x8)
    FGameplayTag TransitionTag;                                                       // 0x0008 (size: 0x8)
    EConversationPresetMonologState MonologStateValidity;                             // 0x0010 (size: 0x1)
    float Weight;                                                                     // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FProfileData
{
    FString m_ProfileName;                                                            // 0x0000 (size: 0x10)
    TArray<FString> m_QuickSaveName;                                                  // 0x0010 (size: 0x10)
    TArray<FString> m_AutoSaveName;                                                   // 0x0020 (size: 0x10)
    TArray<FString> m_SavedSlotsNames;                                                // 0x0030 (size: 0x10)
    TSubclassOf<class UDifficultyPreset> m_difficultyPreset;                          // 0x0040 (size: 0x8)
    TSubclassOf<class UCombatDifficultySettings> m_customCombatSettings;              // 0x0048 (size: 0x8)
    TSubclassOf<class UResourcesDifficultySettings> m_customResourcesSettings;        // 0x0050 (size: 0x8)
    TSubclassOf<class UProgressionDifficultySettings> m_customProgressionSettings;    // 0x0058 (size: 0x8)
    bool m_Survival;                                                                  // 0x0060 (size: 0x1)
    bool m_PermanentDeath;                                                            // 0x0061 (size: 0x1)
    bool m_PermanentDeathGameOver;                                                    // 0x0062 (size: 0x1)
    bool m_FakeSloppyCombos;                                                          // 0x0063 (size: 0x1)
    int32 m_MaxQuick;                                                                 // 0x0064 (size: 0x4)
    int32 m_MaxAuto;                                                                  // 0x0068 (size: 0x4)

}; // Size: 0x70

struct FPursuedCrimeSet
{
    TMap<FGameplayTag, float> CrimeAndSeverity;                                       // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPursuedCrimeSetup
{
    FGameplayTagContainer AffectedLocations;                                          // 0x0000 (size: 0x20)
    TMap<class FGameplayTag, class FPursuedCrimeSet> ByGuild;                         // 0x0020 (size: 0x50)

}; // Size: 0x70

struct FPuzzleCreatureCounter
{
    int32 m_RequiredKills;                                                            // 0x0000 (size: 0x4)
    FName m_CreatureName;                                                             // 0x0004 (size: 0x8)
    FName m_DoorToOpenName;                                                           // 0x000C (size: 0x8)
    FName m_SaveState;                                                                // 0x0014 (size: 0x8)
    int32 m_CurrentKills;                                                             // 0x001C (size: 0x4)
    int32 m_NumPlays;                                                                 // 0x0020 (size: 0x4)
    EPuzzleEvent m_PuzzleEvent;                                                       // 0x0024 (size: 0x1)
    UClass* m_ExtraData;                                                              // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FPuzzleStepsCounter
{
    TMap<FName, int32> m_PuzzleCount;                                                 // 0x0000 (size: 0x50)
    FName m_FunctionToCall;                                                           // 0x0050 (size: 0x8)
    FName m_SaveData;                                                                 // 0x0058 (size: 0x8)
    TMap<FName, int32> m_PuzzleDone;                                                  // 0x0060 (size: 0x50)

}; // Size: 0xB0

struct FQuestWidgetBucket
{
    FGameplayTag m_FilterTag;                                                         // 0x0000 (size: 0x8)
    TSubclassOf<class UQuestline> m_QuestlineClass;                                   // 0x0008 (size: 0x8)
    TArray<class UQuest*> m_Quests;                                                   // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FQueuedSmalltalkLine
{
    FGameplayTag GenericVoicelineTag;                                                 // 0x0000 (size: 0x8)
    FText SelectedVoiceline;                                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FQuickStops
{
    FDynamicMontage QuickStopL;                                                       // 0x0000 (size: 0x38)
    FDynamicMontage QuickStopR;                                                       // 0x0038 (size: 0x38)

}; // Size: 0x70

struct FRandomSequence
{
    TSoftObjectPtr<UAnimSequence> m_Path;                                             // 0x0000 (size: 0x28)
    float m_Chance;                                                                   // 0x0028 (size: 0x4)
    int32 m_LoopsBeforeRemove;                                                        // 0x002C (size: 0x4)
    float m_CurrentChance;                                                            // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FRandomSequencePlayer
{
    float m_MinTimeToBreaker;                                                         // 0x0000 (size: 0x4)
    float m_MaxTimeToBreaker;                                                         // 0x0004 (size: 0x4)
    class UAnimSequence* m_BreakerSequenceToPlay;                                     // 0x0010 (size: 0x8)
    bool m_PlayBreaker;                                                               // 0x0018 (size: 0x1)
    EBreakerType m_BreakerType;                                                       // 0x0019 (size: 0x1)

}; // Size: 0x20

struct FRayPoints
{
    FVector position;                                                                 // 0x0000 (size: 0x18)
    class UNiagaraComponent* Ray;                                                     // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FRegionDefinitionMap
{
    TMap<FGameplayTag, float> m_PricesModifiers;                                      // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FRegionNumItems
{
    TMap<TSubclassOf<UItemDefinition>, int32> m_Items;                                // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FRegionStoryActionCharacterCondition
{
    FName CharacterName;                                                              // 0x0000 (size: 0x8)
    FInteractionSpotHandle MustBeCloseToSpot;                                         // 0x0008 (size: 0x8)
    FInteractionSpotHandle MustNotBeCloseToSpot;                                      // 0x0010 (size: 0x8)
    float WithinRadius;                                                               // 0x0018 (size: 0x4)
    FGameplayTagContainer WithTheseTags;                                              // 0x0020 (size: 0x20)
    FGameplayTagContainer WithNoneOfTheseTags;                                        // 0x0040 (size: 0x20)

}; // Size: 0x60

struct FRegionStoryActionQuestCondition
{
    bool bSucceeded;                                                                  // 0x0000 (size: 0x1)
    bool bFailed;                                                                     // 0x0001 (size: 0x1)
    bool bRunning;                                                                    // 0x0002 (size: 0x1)
    bool bAvailable;                                                                  // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FRelationshipEvaluation
{
    ERelationship Relationship;                                                       // 0x0000 (size: 0x1)
    float FriendlinessWeight;                                                         // 0x0004 (size: 0x4)
    ERelationshipHostility Hostility;                                                 // 0x0008 (size: 0x1)
    float HostilityWeight;                                                            // 0x000C (size: 0x4)
    ERelationshipRelativeRank Rank;                                                   // 0x0010 (size: 0x1)
    float RankWeight;                                                                 // 0x0014 (size: 0x4)
    TMap<class FGameplayTag, class FPursuedCrimeSet> PursuedCrimesByArea;             // 0x0018 (size: 0x50)
    TMap<class FGameplayTag, class FGameplayTagContainer> IgnoredCrimesByArea;        // 0x0068 (size: 0x50)
    float AtTime;                                                                     // 0x00B8 (size: 0x4)

}; // Size: 0xC0

struct FRelativeCrimeDataEntry
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    FName WitnessGlobalID;                                                            // 0x0004 (size: 0x8)
    float BaseSeverity;                                                               // 0x000C (size: 0x4)
    bool bIsSuppressed;                                                               // 0x0010 (size: 0x1)
    ERelationship RelationshipTowardsCriminal;                                        // 0x0011 (size: 0x1)
    ERelationshipRelativeRank RelativeRankTowardsCriminal;                            // 0x0012 (size: 0x1)
    ERelationshipHostility HostilityTowardsCriminal;                                  // 0x0013 (size: 0x1)
    bool bInPartyWithCriminal;                                                        // 0x0014 (size: 0x1)
    ECrimeDirectness Directness;                                                      // 0x0015 (size: 0x1)
    TArray<FCrimeVictimGuildHandle> VictimGuildHandles;                               // 0x0018 (size: 0x10)
    TArray<FCrimeVictimPersonHandle> VictimCharacterHandles;                          // 0x0028 (size: 0x10)
    ERelativeCrimeOrigin OriginSource;                                                // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FRememberedBossFightLocations
{
}; // Size: 0x58

struct FRememberedMusicLocations
{
}; // Size: 0x58

struct FRememberedPerception
{
    FPerceivedAgent Sensing;                                                          // 0x0000 (size: 0xC0)
    FPerceivedAgent Origin;                                                           // 0x00C0 (size: 0xC0)
    FPerceivedAgent Affected;                                                         // 0x0180 (size: 0xC0)
    FPerceivedAgent Target;                                                           // 0x0240 (size: 0xC0)
    FPerceivedAgent Instigator;                                                       // 0x0300 (size: 0xC0)
    TSoftObjectPtr<AActor> AffectedActor;                                             // 0x03C0 (size: 0x28)
    TSoftObjectPtr<AActor> TargetActor;                                               // 0x03E8 (size: 0x28)
    TSoftObjectPtr<AActor> EffectCauser;                                              // 0x0410 (size: 0x28)
    TArray<FName> AffectedCharacterUniqueNames;                                       // 0x0438 (size: 0x10)
    FPerceivedInteractiveObject PerceivedObject;                                      // 0x0448 (size: 0x78)
    FGameplayTagContainer EffectCauserTags;                                           // 0x04C0 (size: 0x20)
    FGameplayTagContainer ContextTags;                                                // 0x04E0 (size: 0x20)
    FGameplayTag EventTag;                                                            // 0x0500 (size: 0x8)
    float Magnitude;                                                                  // 0x0508 (size: 0x4)
    float EstimatedImpactAtSeconds;                                                   // 0x050C (size: 0x4)
    float TimeUpdated;                                                                // 0x0510 (size: 0x4)
    float TimeFirstSensed;                                                            // 0x0514 (size: 0x4)

}; // Size: 0x518

struct FReplaceNavAreaPair
{
    TSubclassOf<class UNavArea> NavAreaToReplace;                                     // 0x0000 (size: 0x8)
    TSubclassOf<class UNavArea> NavAreaNew;                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FReplicatedInventoryMap
{
    TArray<EInventoryTypes> m_Keys;                                                   // 0x0010 (size: 0x10)
    FContainerVirtualDataArray m_Values;                                              // 0x0020 (size: 0x118)

}; // Size: 0x138

struct FReplicatedQuestNameTimeMap
{
    TMap<class FName, class FInGameTime> Times;                                       // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FReplicatedQuestStateTimeMap
{
    TMap<class EQuestState, class FInGameTime> Times;                                 // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FReplicatedStringMap
{
    TArray<FName> m_Keys;                                                             // 0x0000 (size: 0x10)
    TArray<FString> m_Values;                                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FReplicatedWorldData
{
    TSubclassOf<class UItemDefinition> m_WorldItemDefinition;                         // 0x0000 (size: 0x8)
    int32 m_ItemCount;                                                                // 0x0008 (size: 0x4)
    FItemPayload m_Payload;                                                           // 0x0010 (size: 0x88)

}; // Size: 0x98

struct FRichCompoundInputHintRow : public FTableRowBase
{
    TArray<FRichCompoundInputHintRow_Entry> m_MKBActions;                             // 0x0008 (size: 0x10)
    TArray<FRichCompoundInputHintRow_Entry> m_ControllerActions;                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FRichCompoundInputHintRow_Entry
{
    class UInputAction* m_InputAction;                                                // 0x0000 (size: 0x8)
    TArray<class UInputMappingContext*> m_InputMappingContexts;                       // 0x0008 (size: 0x10)
    ECoumpoundInputHintLocation m_Location;                                           // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FRuneStats
{
    int32 SpellLevels;                                                                // 0x0000 (size: 0x4)
    TArray<float> ManaCostScByLevel;                                                  // 0x0008 (size: 0x10)
    TArray<float> ManaCostByLevel;                                                    // 0x0018 (size: 0x10)
    TArray<float> CastTimeByLevel;                                                    // 0x0028 (size: 0x10)
    TArray<float> DamageByLevel;                                                      // 0x0038 (size: 0x10)
    FGameplayTag DamageType;                                                          // 0x0048 (size: 0x8)
    ESpellTargetType SpellTargetType;                                                 // 0x0050 (size: 0x1)
    ESpellManaUsage SpellManaUsage;                                                   // 0x0051 (size: 0x1)

}; // Size: 0x58

struct FSaveDataPayload
{
    bool m_QuickSave;                                                                 // 0x0000 (size: 0x1)
    bool m_AutoSave;                                                                  // 0x0001 (size: 0x1)
    FString m_SlotName;                                                               // 0x0008 (size: 0x10)
    int32 m_ProfileId;                                                                // 0x0018 (size: 0x4)
    FString m_PlayerSaveName;                                                         // 0x0020 (size: 0x10)
    bool m_IsPlayerSaveNameCustom;                                                    // 0x0030 (size: 0x1)
    TArray<uint8> m_CompressedBitmap;                                                 // 0x0038 (size: 0x10)
    TSubclassOf<class UDifficultyPreset> m_difficultyPreset;                          // 0x0048 (size: 0x8)
    TSubclassOf<class UCombatDifficultySettings> m_customCombatSettings;              // 0x0050 (size: 0x8)
    TSubclassOf<class UResourcesDifficultySettings> m_customResourcesSettings;        // 0x0058 (size: 0x8)
    TSubclassOf<class UProgressionDifficultySettings> m_customProgressionSettings;    // 0x0060 (size: 0x8)
    bool m_PermaDeath;                                                                // 0x0068 (size: 0x1)
    bool m_PermaDeathGameOver;                                                        // 0x0069 (size: 0x1)
    bool m_SurvivalMode;                                                              // 0x006A (size: 0x1)
    bool m_FakeSloppyCombos;                                                          // 0x006B (size: 0x1)
    bool m_ForceSave;                                                                 // 0x006C (size: 0x1)

}; // Size: 0x70

struct FSaveGamePublicData
{
    FString m_SlotName;                                                               // 0x0000 (size: 0x10)
    FString m_PlayerSaveName;                                                         // 0x0010 (size: 0x10)
    bool m_IsPlayerSaveNameCustom;                                                    // 0x0020 (size: 0x1)
    TArray<uint8> m_CompressedBitmap;                                                 // 0x0028 (size: 0x10)
    int32 m_ChapterID;                                                                // 0x0038 (size: 0x4)
    TSubclassOf<class UDifficultyPreset> m_difficultyPreset;                          // 0x0040 (size: 0x8)
    TSubclassOf<class UCombatDifficultySettings> m_customCombatSettings;              // 0x0048 (size: 0x8)
    TSubclassOf<class UResourcesDifficultySettings> m_customResourcesSettings;        // 0x0050 (size: 0x8)
    TSubclassOf<class UProgressionDifficultySettings> m_customProgressionSettings;    // 0x0058 (size: 0x8)
    FString m_MapName;                                                                // 0x0060 (size: 0x10)
    FDateTime m_Date;                                                                 // 0x0070 (size: 0x8)
    double m_TimePlayed;                                                              // 0x0078 (size: 0x8)
    double m_TimeLoaded;                                                              // 0x0080 (size: 0x8)
    bool m_QuickSave;                                                                 // 0x0088 (size: 0x1)
    bool m_AutoSave;                                                                  // 0x0089 (size: 0x1)
    int32 m_ProfileId;                                                                // 0x008C (size: 0x4)

}; // Size: 0x90

struct FScarsVisualSettings
{
    bool HasScars;                                                                    // 0x0000 (size: 0x1)
    bool IsDarkSkin;                                                                  // 0x0001 (size: 0x1)
    FVector SelectedMasks;                                                            // 0x0008 (size: 0x18)
    FVector SelectedTextures;                                                         // 0x0020 (size: 0x18)
    float ScarNormalIntensity;                                                        // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FScoredCombatTarget
{
    float Score;                                                                      // 0x0000 (size: 0x4)
    float SuspendUpdatesUntilWorldTime;                                               // 0x0004 (size: 0x4)
    class AGothicCharacter* Character;                                                // 0x0008 (size: 0x8)
    TArray<FAICombatTargetScoringEntryDescription> EntryDescriptions;                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FScoredItemAction
{
    float Score;                                                                      // 0x0000 (size: 0x4)
    FItemActionHandler ItemActionHandler;                                             // 0x0008 (size: 0x10)
    TArray<FAIItemActionScoringEntryDescription> EntryDescriptions;                   // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FScreenshotData
{
    TArray<uint8> Data;                                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FScriptGameplayAttributeRef
{
    TSubclassOf<class UAttributeSet> AttributeSetClass;                               // 0x0000 (size: 0x8)
    FName Name;                                                                       // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FScriptableHLODBuildContext
{
    class UWorld* World;                                                              // 0x0000 (size: 0x8)
    TArray<class UActorComponent*> SourceComponents;                                  // 0x0008 (size: 0x10)
    class UObject* AssetsOuter;                                                       // 0x0018 (size: 0x8)
    FString AssetsBaseName;                                                           // 0x0020 (size: 0x10)
    FVector WorldPosition;                                                            // 0x0030 (size: 0x18)
    double MinVisibleDistance;                                                        // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FSelectedItemStats
{
    FGameplayTag StatTag;                                                             // 0x0000 (size: 0x8)
    float StatValue;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSensedAgentInfo
{
    float TimeUpdated;                                                                // 0x0000 (size: 0x4)
    float TimeFirstSensed;                                                            // 0x0004 (size: 0x4)
    FVector position;                                                                 // 0x0008 (size: 0x18)
    FVector NavPosition;                                                              // 0x0020 (size: 0x18)
    FGameplayTagContainer Tags;                                                       // 0x0038 (size: 0x20)
    FVector FromPosition;                                                             // 0x0058 (size: 0x18)
    FVector FromNavPosition;                                                          // 0x0070 (size: 0x18)
    float Awareness;                                                                  // 0x0088 (size: 0x4)
    bool bHasFullAwareness;                                                           // 0x008C (size: 0x1)

}; // Size: 0x90

struct FSentryContextCallstack
{
    FString Callstack;                                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSentryContextEditor
{
    TArray<FString> OpenAssets;                                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSentryContextGame
{
    TArray<FString> OwnedGameplayTags;                                                // 0x0000 (size: 0x10)
    TArray<FString> ActiveAbilities;                                                  // 0x0010 (size: 0x10)
    TMap<FString, float> NearbyCharacters;                                            // 0x0020 (size: 0x50)
    TMap<FName, float> NearbyInteractionSpots;                                        // 0x0070 (size: 0x50)

}; // Size: 0xC0

struct FSentryContextStack
{
    TArray<class UObject*> UObjects;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSentryContextStringStack
{
    TArray<FString> Context;                                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSentryContexts
{
    FSentryContextCallstack AngelscriptCallstack;                                     // 0x0000 (size: 0x10)
    TMap<class FString, class FString> GameMisc;                                      // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FSentryReportData
{
    FString Release;                                                                  // 0x0000 (size: 0x10)
    FString Environment;                                                              // 0x0010 (size: 0x10)
    TMap<class FString, class FString> Tags;                                          // 0x0020 (size: 0x50)
    FSentryUser User;                                                                 // 0x0070 (size: 0x10)
    FSentryContexts Contexts;                                                         // 0x0080 (size: 0x60)

}; // Size: 0xE0

struct FSentryUser
{
    FString UserName;                                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSettingDescription
{
    FText m_Title;                                                                    // 0x0000 (size: 0x10)
    TSoftObjectPtr<UTexture2D> m_Image;                                               // 0x0010 (size: 0x28)
    FText m_Text;                                                                     // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FSettingsMessageHandle
{
}; // Size: 0x4

struct FSimpleInventoryItemConfiguration
{
    FText m_TabName;                                                                  // 0x0000 (size: 0x10)
    TSubclassOf<class UInventoryMain> m_TabType;                                      // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FSingleLightModifier
{
    float MinThreshold;                                                               // 0x0000 (size: 0x4)
    float MaxThreshold;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x50

struct FSingleQuestSaveGameData
{
    EQuestState CurrentState;                                                         // 0x0000 (size: 0x1)
    TMap<class EQuestState, class FInGameTime> StateReachedAtTime;                    // 0x0008 (size: 0x50)
    TMap<class FName, class FInGameTime> TimeLastViewedByPlayer;                      // 0x0058 (size: 0x50)

}; // Size: 0xA8

struct FSingleStorySaveGameData
{
    TMap<FName, int32> StoryPropertyValues;                                           // 0x0000 (size: 0x50)
    TMap<class FName, class EDataLayerRuntimeState> StoryDataLayers;                  // 0x0050 (size: 0x50)
    TMap<class TSubclassOf<UQuest>, class FSingleQuestSaveGameData> QuestDataByClass; // 0x00A0 (size: 0x50)

}; // Size: 0xF0

struct FSixthSenseShape
{
    float SenseShapeModifier;                                                         // 0x0000 (size: 0x4)
    float VerticalOffset;                                                             // 0x0004 (size: 0x4)
    float HalfLength;                                                                 // 0x0008 (size: 0x4)
    float HalfWidth;                                                                  // 0x000C (size: 0x4)
    float BlindSpotHalfAngle;                                                         // 0x0010 (size: 0x4)

}; // Size: 0x1C

struct FSkillAnimConfig
{
    FGameplayTag ItemType;                                                            // 0x0000 (size: 0x8)
    TMap<class EWeaponSkill, class TSubclassOf<UItemAnimConfig>> AnimConfigs;         // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FSkillAnimMontage
{
    FGameplayTag m_ItemType;                                                          // 0x0000 (size: 0x8)
    TMap<class EWeaponSkill, class TSoftObjectPtr<UAnimMontage>> m_AnimConfigs;       // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FSlotInfo
{
    class AItemVisual* m_SlotVisual;                                                  // 0x0000 (size: 0x8)
    EInventoryTypes m_SlotInvType;                                                    // 0x0008 (size: 0x1)
    int32 m_SlotInvSlot;                                                              // 0x000C (size: 0x4)
    class UItemDefinition* m_SlotDef;                                                 // 0x0010 (size: 0x8)
    int32 m_SlotMagnitude;                                                            // 0x0018 (size: 0x4)
    UClass* m_ExtraData;                                                              // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FSpawnItemEvent
{
    FName m_Event;                                                                    // 0x0000 (size: 0x8)
    TArray<FSpawnItemList> m_Items;                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSpawnItemList
{
    int32 m_NumElements;                                                              // 0x0000 (size: 0x4)
    TSubclassOf<class UItemDefinition> m_Item;                                        // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSpawnLocation
{
    FVector m_Location;                                                               // 0x0000 (size: 0x18)
    FVector m_Normal;                                                                 // 0x0018 (size: 0x18)
    int32 m_StepIndex;                                                                // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FSpawnLocationArray
{
    TArray<FSpawnLocation> SpawnLocations;                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSpawnLocationQueryParams
{
    float m_MaxRange;                                                                 // 0x0000 (size: 0x4)
    float m_InitialRangeOffset;                                                       // 0x0004 (size: 0x4)
    float m_RangeStep;                                                                // 0x0008 (size: 0x4)
    float m_MaxAngleStep;                                                             // 0x000C (size: 0x4)
    float m_MinAngleStep;                                                             // 0x0010 (size: 0x4)
    float m_AngleStepOffset;                                                          // 0x0014 (size: 0x4)
    float m_MaxSlope;                                                                 // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FSpawnSlot
{
    TSubclassOf<class ACarriableWorldItem> SpawnItem;                                 // 0x0000 (size: 0x8)
    class ACarriableWorldItem* ActiveItem;                                            // 0x0008 (size: 0x8)
    FTransform RelativeTransform;                                                     // 0x0010 (size: 0x60)
    FTimerHandle RefillTimerHandle;                                                   // 0x0078 (size: 0x8)
    float RefillTimerSeconds;                                                         // 0x0080 (size: 0x4)

}; // Size: 0x90

struct FSpawningRequestID
{
}; // Size: 0x8

struct FSpawnpointConfig
{
    FName m_Name;                                                                     // 0x0000 (size: 0x8)
    FTransform m_Transform;                                                           // 0x0010 (size: 0x60)

}; // Size: 0x70

struct FSpeakingQueueEntry
{
    FGameplayTag SoundTag;                                                            // 0x0000 (size: 0x8)
    FGameplayAbilityTargetData_Speak TargetData;                                      // 0x0008 (size: 0xB0)
    class UAbilityTask_SayVoiceline* SayVoiceline;                                    // 0x00B8 (size: 0x8)

}; // Size: 0xC0

struct FSpellContext : public FGameplayAbilityTargetData
{
    TArray<TWeakObjectPtr<AActor>> Targets;                                           // 0x0008 (size: 0x10)
    bool m_TargetAdquiredByDatamodule;                                                // 0x0018 (size: 0x1)
    class USpellConfigurationContainer* m_SpellConfigurationContainer;                // 0x0020 (size: 0x8)
    TWeakObjectPtr<class UGameplayAbility> m_OwningAbility;                           // 0x0028 (size: 0x8)
    TScriptInterface<class ISpellAnimationDirector> m_AnimationDirector;              // 0x0030 (size: 0x10)
    TWeakObjectPtr<class AGothicCharacter> m_CurrentCharacter;                        // 0x0040 (size: 0x8)
    float m_CastMontageTaskRemainingTime;                                             // 0x0048 (size: 0x4)
    int32 m_CurrentSpellLevel;                                                        // 0x004C (size: 0x4)
    bool m_IsRechargableSpellCancellableAfterFirstCharge;                             // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FSpellLevelRange
{
    float CastTime;                                                                   // 0x0000 (size: 0x4)
    float CastManaCost;                                                               // 0x0004 (size: 0x4)
    float ManaCostSc;                                                                 // 0x0008 (size: 0x4)
    TSubclassOf<class UScriptGameplayAbility> m_SpellClass;                           // 0x0010 (size: 0x8)
    TSubclassOf<class USpellConfigLevelData> m_SpellConfigLevelData;                  // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FSpellsManaCost
{
    TArray<float> ActivationCostPerLevel;                                             // 0x0000 (size: 0x10)
    float ContinousCost;                                                              // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FStanceMapMontage
{
    TMap<class EStance, class TSoftObjectPtr<UAnimMontage>> m_StanceMap;              // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FStartTurnDirections
{
    FDynamicMontage Pivot180L;                                                        // 0x0000 (size: 0x38)
    FDynamicMontage Pivot180R;                                                        // 0x0038 (size: 0x38)
    FDynamicMontage Pivot135L;                                                        // 0x0070 (size: 0x38)
    FDynamicMontage Pivot135R;                                                        // 0x00A8 (size: 0x38)
    FDynamicMontage Pivot90L;                                                         // 0x00E0 (size: 0x38)
    FDynamicMontage Pivot90R;                                                         // 0x0118 (size: 0x38)

}; // Size: 0x150

struct FStaticRelationshipEvaluation : public FRelationshipEvaluation
{
    FGameplayTag MyGuild;                                                             // 0x00C0 (size: 0x8)
    FGameplayTag OthersGuild;                                                         // 0x00C8 (size: 0x8)
    FGameplayTag MySpecies;                                                           // 0x00D0 (size: 0x8)
    FGameplayTag OthersSpecies;                                                       // 0x00D8 (size: 0x8)
    FGameplayTag MyLocation;                                                          // 0x00E0 (size: 0x8)
    FGameplayTag OthersLocation;                                                      // 0x00E8 (size: 0x8)

}; // Size: 0xF0

struct FSticker
{
    int32 m_Texture;                                                                  // 0x0000 (size: 0x4)

}; // Size: 0x18

struct FStoryQuestRequirements : public FInteractionSpotRequirements
{
    TSubclassOf<class UQuest> QuestClass;                                             // 0x0038 (size: 0x8)
    bool bAllowWhenAvailable;                                                         // 0x0040 (size: 0x1)
    bool bAllowWhenRunning;                                                           // 0x0041 (size: 0x1)
    bool bAllowWhenSucceeded;                                                         // 0x0042 (size: 0x1)
    bool bAllowWhenFailed;                                                            // 0x0043 (size: 0x1)

}; // Size: 0x48

struct FStoryRegionTraitSaveGameData
{
    int32 NumTimesToTrigger;                                                          // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FStorySaveGameData
{
    TMap<class TSubclassOf<UGameStory>, class FSingleStorySaveGameData> SaveDataByStoryClass; // 0x0000 (size: 0x50)
    TMap<class FName, class FKnowledgeSet> CharacterKnowledgeByUniqueName;            // 0x0050 (size: 0x50)
    TMap<class TSoftObjectPtr<URegionTrait>, class FStoryRegionTraitSaveGameData> RegionTraits; // 0x00A0 (size: 0x50)

}; // Size: 0xF0

struct FStoryValueRequirements : public FInteractionSpotRequirements
{
    TSubclassOf<class UGameStory> StoryClass;                                         // 0x0038 (size: 0x8)
    FString PropertyPath;                                                             // 0x0040 (size: 0x10)
    EInteractionSpotComparisonOp ComparisonOp;                                        // 0x0050 (size: 0x1)
    float CompareAgainst;                                                             // 0x0054 (size: 0x4)

}; // Size: 0x58

struct FStructBoneOverride
{
    FName m_BoneName;                                                                 // 0x0000 (size: 0x8)
    float m_Density;                                                                  // 0x0008 (size: 0x4)
    float m_TestRadius;                                                               // 0x000C (size: 0x4)

}; // Size: 0x10

struct FSummonAIData
{
    class AGothicCharacter* Character;                                                // 0x0000 (size: 0x8)
    int32 RequestID;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FSuperArmorParams
{
    float m_ImmunityAfterHitStandardSc;                                               // 0x0000 (size: 0x4)
    float m_StartRegenerateSc;                                                        // 0x0004 (size: 0x4)
    float m_HpRegenerateTick;                                                         // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FTagClaimRequirements : public FInteractionSpotRequirements
{
    FGameplayTagContainer MustHaveAnyOf;                                              // 0x0038 (size: 0x20)
    FGameplayTagContainer MustNotHaveAnyOf;                                           // 0x0058 (size: 0x20)

}; // Size: 0x78

struct FTagMontage
{
    FGameplayTagContainer MetaData;                                                   // 0x0000 (size: 0x20)
    TSoftObjectPtr<UAnimMontage> Montage;                                             // 0x0020 (size: 0x28)

}; // Size: 0x48

struct FTagMontageArray
{
    FGameplayTagContainer MetaData;                                                   // 0x0000 (size: 0x20)
    TArray<TSoftObjectPtr<UAnimMontage>> Montages;                                    // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FTattooVisualSettings
{
    bool HasTattoo;                                                                   // 0x0000 (size: 0x1)
    TSoftObjectPtr<UTexture2D> HeadTattooMap;                                         // 0x0008 (size: 0x28)
    FLinearColor TattooColorHead;                                                     // 0x0030 (size: 0x10)
    TSoftObjectPtr<UTexture2D> TorsoTattooMap;                                        // 0x0040 (size: 0x28)
    FLinearColor TattooColorTorso;                                                    // 0x0068 (size: 0x10)
    TSoftObjectPtr<UTexture2D> LegsTattooMap;                                         // 0x0078 (size: 0x28)
    FLinearColor TattooColorLegs;                                                     // 0x00A0 (size: 0x10)
    float TattooColorIntensity;                                                       // 0x00B0 (size: 0x4)
    float TattooNormalIntensity;                                                      // 0x00B4 (size: 0x4)
    float TattooSubsurfaceOpacityMultiplier;                                          // 0x00B8 (size: 0x4)

}; // Size: 0xC0

struct FTauntAnimationContainer
{
    TArray<TSoftObjectPtr<UAnimMontage>> Animations;                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FTimeRangeRequirements : public FInteractionSpotRequirements
{
    TArray<FClockTimeRange> AvailableInRange;                                         // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FTimeSinceLastUseRequirements : public FInteractionSpotRequirements
{
    FInGameTime TimeRequiredToPass;                                                   // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FTooltipInfoParameters
{
    class AActor* Actor;                                                              // 0x0000 (size: 0x8)
    class UItemDefinition* Item;                                                      // 0x0008 (size: 0x8)
    class UItemDefinition* CompareItem;                                               // 0x0010 (size: 0x8)
    int32 ItemHotkey;                                                                 // 0x0018 (size: 0x4)
    bool bCanBeEquipped;                                                              // 0x001C (size: 0x1)
    bool bIsEquipped;                                                                 // 0x001D (size: 0x1)
    bool bCanBePurchased;                                                             // 0x001E (size: 0x1)
    bool bCanAfford;                                                                  // 0x001F (size: 0x1)
    EInventoryOpenedStates OpenedState;                                               // 0x0020 (size: 0x1)
    int32 SlotId;                                                                     // 0x0024 (size: 0x4)

}; // Size: 0x188

struct FTooltipInfoRecipe
{
    TMap<class FGameplayTag, class bool> m_PlayerHasRequiredTagsToLearn;              // 0x0000 (size: 0x50)
    int32 SpellLevels;                                                                // 0x0050 (size: 0x4)
    TArray<float> ManaCostScByLevel;                                                  // 0x0058 (size: 0x10)
    TArray<float> ManaCostByLevel;                                                    // 0x0068 (size: 0x10)
    TArray<float> CastTimeByLevel;                                                    // 0x0078 (size: 0x10)
    TArray<float> DamageByLevel;                                                      // 0x0088 (size: 0x10)
    FGameplayTag DamageType;                                                          // 0x0098 (size: 0x8)
    ESpellTargetType SpellTargetType;                                                 // 0x00A0 (size: 0x1)
    ESpellManaUsage SpellManaUsage;                                                   // 0x00A1 (size: 0x1)

}; // Size: 0xA8

struct FTopicRules
{
    TArray<FKnowledgeSet> RequiredKnowledge;                                          // 0x0000 (size: 0x10)
    TArray<FKnowledgeSet> KnowledgeThatHides;                                         // 0x0010 (size: 0x10)
    TArray<FInstancedStruct> DynamicRequirements;                                     // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FTrackedActorSet
{
    TMap<class TWeakObjectPtr<AActor>, class FBox> TrackedActorBounds;                // 0x00A0 (size: 0x50)
    TMap<class TWeakObjectPtr<USceneComponent>, class FBox> TrackedComponentBounds;   // 0x00F0 (size: 0x50)

}; // Size: 0x140

struct FTradeListSellItemNew
{
    int32 m_ItemIndexInItemList;                                                      // 0x0000 (size: 0x4)
    int32 m_Price;                                                                    // 0x0004 (size: 0x4)
    int32 m_Num;                                                                      // 0x0008 (size: 0x4)
    class UItemDefinition* m_ItemDef;                                                 // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FTraderData
{
    FName m_TradersUniqueName;                                                        // 0x0000 (size: 0x8)
    TMap<TSubclassOf<UItemDefinition>, int32> m_Items;                                // 0x0008 (size: 0x50)
    TMap<TSubclassOf<UItemDefinition>, int32> m_DefaultItems;                         // 0x0058 (size: 0x50)
    TArray<FString> m_GeneratedEvents;                                                // 0x00A8 (size: 0x10)
    TMap<class TSubclassOf<UDifficultySettings>, class FInventoryByChapter> m_ItemsByDifficulty; // 0x00B8 (size: 0x50)
    double m_TotalSeconds;                                                            // 0x0108 (size: 0x8)

}; // Size: 0x110

struct FTraderDefinitionMap
{
    TMap<FGameplayTag, float> m_PricesModifiers;                                      // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FTraderInventoryMap
{
    TMap<TSubclassOf<UItemDefinition>, int32> m_Items;                                // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FTraderItem
{
    TSubclassOf<class UItemDefinition> m_ItemDefinition;                              // 0x0000 (size: 0x8)
    int32 m_ItemCount;                                                                // 0x0008 (size: 0x4)
    FString m_Chapter;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FTravellingData
{
    class UCameraDefinition* m_DestinationTravellingCameraConf;                       // 0x01A8 (size: 0x8)
    class ACharacter* m_PossessedCharacter;                                           // 0x01B8 (size: 0x8)

}; // Size: 0x1C0

struct FTraversalInfo
{
    FTransform m_FirstHitPoint;                                                       // 0x0010 (size: 0x60)
    FTransform m_FirstTargetPoint;                                                    // 0x0070 (size: 0x60)
    FTransform m_LastHitPoint;                                                        // 0x00D0 (size: 0x60)
    bool m_HasLastHitPoint;                                                           // 0x0130 (size: 0x1)
    float m_ObstacleHeight;                                                           // 0x0134 (size: 0x4)
    float m_ObstacleWidth;                                                            // 0x0138 (size: 0x4)
    EMovementState m_MovementState;                                                   // 0x013C (size: 0x1)
    EClimbType m_ClimbType;                                                           // 0x013D (size: 0x1)
    bool m_IsStuck;                                                                   // 0x013E (size: 0x1)
    TWeakObjectPtr<class UPrimitiveComponent> m_TargetObject;                         // 0x0140 (size: 0x8)
    EWalkSpeed m_Speed;                                                               // 0x0148 (size: 0x1)
    EWalkSpeed m_Input;                                                               // 0x0149 (size: 0x1)

}; // Size: 0x150

struct FTurnDirections
{
    FDynamicMontage Pivot180L;                                                        // 0x0000 (size: 0x38)
    FDynamicMontage Pivot180R;                                                        // 0x0038 (size: 0x38)
    FDynamicMontage Pivot135L;                                                        // 0x0070 (size: 0x38)
    FDynamicMontage Pivot135R;                                                        // 0x00A8 (size: 0x38)
    FDynamicMontage Pivot90L;                                                         // 0x00E0 (size: 0x38)
    FDynamicMontage Pivot90R;                                                         // 0x0118 (size: 0x38)

}; // Size: 0x150

struct FTurn_Info
{
    float m_RotationAmount;                                                           // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FTutorialIconHandlerSubsystem_Data
{
    class UInputAction* InputAction;                                                  // 0x0000 (size: 0x8)
    TArray<class UInputMappingContext*> InputMappingContexts;                         // 0x0008 (size: 0x10)
    FSlateBrush Brush;                                                                // 0x0020 (size: 0xD0)

}; // Size: 0xF0

struct FUDeflectedFX : public FTableRowBase
{
    class UNiagaraSystem* NiagaraSystem;                                              // 0x0008 (size: 0x8)
    FGameplayTag EffectTag;                                                           // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FUIMapSaveData
{
    TMap<class FGameplayTag, class FMapMarkerArrayData> m_MapsMarkersData;            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FUltraDynamicPostProcessSettings
{
    FVector4 GlobalContrast;                                                          // 0x0000 (size: 0x20)
    float SkyLightLeaking;                                                            // 0x0020 (size: 0x4)
    float SunVolumetricScattering;                                                    // 0x0024 (size: 0x4)

}; // Size: 0x30

struct FUltraDynamicSkySettings
{
    float SunAngle;                                                                   // 0x0000 (size: 0x4)
    float OverallIntensity;                                                           // 0x0004 (size: 0x4)
    float Contrast;                                                                   // 0x0008 (size: 0x4)
    float Saturation;                                                                 // 0x000C (size: 0x4)
    float DirectionalBalance;                                                         // 0x0010 (size: 0x4)
    float NightBrightness;                                                            // 0x0014 (size: 0x4)
    float SkyLightIntensity;                                                          // 0x0018 (size: 0x4)
    float SkyLightTemperature;                                                        // 0x001C (size: 0x4)
    FLinearColor SkyLightColorMultiplierDay;                                          // 0x0020 (size: 0x10)
    FLinearColor SkyLightColorMultiplierDawn;                                         // 0x0030 (size: 0x10)
    FLinearColor SkyLightColorMultiplierNight;                                        // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FUltraDynamicWindSettings
{
    float WindRotationSpeed;                                                          // 0x0000 (size: 0x4)
    float MaxWindStrength;                                                            // 0x0004 (size: 0x4)
    float MaxWindSpeed;                                                               // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FUniqueNameRequirements : public FInteractionSpotRequirements
{
    TSet<FName> MustHaveAnyOfTheseUniqueNames;                                        // 0x0038 (size: 0x50)

}; // Size: 0x88

struct FUpdateHitsDataContainer
{
    class UPrimitiveComponent* m_OverlapComponent;                                    // 0x0000 (size: 0x8)
    FHitResult m_HitResult;                                                           // 0x0008 (size: 0xF8)

}; // Size: 0x100

struct FVelocityBlendS
{
    float F;                                                                          // 0x0000 (size: 0x4)
    float B;                                                                          // 0x0004 (size: 0x4)
    float L;                                                                          // 0x0008 (size: 0x4)
    float R;                                                                          // 0x000C (size: 0x4)

}; // Size: 0x10

struct FViewItemWidget_MouseSettings
{
    int32 m_ButtonsWithLongClick;                                                     // 0x0004 (size: 0x4)
    double m_ButtonPressTime;                                                         // 0x0008 (size: 0x8)
    double m_ButtonHoldTime;                                                          // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FVisualHitData
{
    class UScalarMaterialPropertyProvider* m_HitRadiusProperty;                       // 0x0000 (size: 0x8)
    class UVectorMaterialPropertyProvider* m_HitLocationProperty;                     // 0x0008 (size: 0x8)
    class UScalarMaterialPropertyProvider* m_AmountProperty;                          // 0x0010 (size: 0x8)
    class UScalarMaterialPropertyProvider* m_WaterVerticalMask;                       // 0x0018 (size: 0x8)
    class UScalarMaterialPropertyProvider* m_WaterVerticalWetness;                    // 0x0020 (size: 0x8)
    TScriptInterface<class IDisposable> m_ActiveEffect;                               // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FVoiceTypeSubset
{
    FGameplayTag VoiceType;                                                           // 0x0000 (size: 0x8)
    FGameplayTag Subset;                                                              // 0x0008 (size: 0x8)
    int32 Layer;                                                                      // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FVoicelineAssignment
{
    FGameplayTag Tag;                                                                 // 0x0000 (size: 0x8)
    FText Text;                                                                       // 0x0008 (size: 0x10)
    float Weight;                                                                     // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FVoicelineData
{
    FText TalkingCharacterName;                                                       // 0x0000 (size: 0x10)
    FText Text;                                                                       // 0x0010 (size: 0x10)
    float Duration;                                                                   // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FWalkSpeedModifier
{
}; // Size: 0x20

struct FWaynet
{
    TArray<FWaynetNode> WaynetNodesByID;                                              // 0x0000 (size: 0x10)
    TMap<uint32, FWaynetEdge> EdgesByHash;                                            // 0x0010 (size: 0x50)
    bool bHasBeenBuilt;                                                               // 0x0070 (size: 0x1)
    TArray<FIslandGroupWrapper> IslandGroups;                                         // 0x0078 (size: 0x10)
    TArray<FWaynetNode> ProjectionFailedNodes;                                        // 0x0088 (size: 0x10)
    class AGlobalNavigationData* GND;                                                 // 0x00E8 (size: 0x8)

}; // Size: 0xF0

struct FWaynetEdge
{
    uint64 SourceNodeId;                                                              // 0x0000 (size: 0x8)
    uint64 DestinationNodeId;                                                         // 0x0008 (size: 0x8)
    FWaynetPath Path;                                                                 // 0x0010 (size: 0xC0)
    FGameplayTagContainer NavLinkAllowedSpecies;                                      // 0x00D0 (size: 0x20)
    bool bBelongsToConnectiveActor;                                                   // 0x00F0 (size: 0x1)

}; // Size: 0xF8

struct FWaynetNode
{
}; // Size: 0x70

struct FWaynetPath
{
}; // Size: 0xC0

struct FWaynetProjectionResult
{
}; // Size: 0x1B0

struct FWaynetQueryIdentifier
{
}; // Size: 0x18

struct FWeatherProbability
{
    TMap<EWeather, float> Probabilities;                                              // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FWeatherRequirements : public FInteractionSpotRequirements
{
    TSubclassOf<class UWeatherCondition> RequireWeatherCondition;                     // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FWeatherSaveGame
{
    EWeather CurrentWeather;                                                          // 0x0000 (size: 0x1)
    TArray<EWeather> DailyWeathers;                                                   // 0x0008 (size: 0x10)
    TMap<EWeather, float> WeatherModifiers;                                           // 0x0018 (size: 0x50)

}; // Size: 0x68

struct FWorldCreatureDefinition
{
    class UAIState_DailyRoutine* m_DailyRoutineTemplate;                              // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FWorldItemDefinition
{
}; // Size: 0x18

struct FWorldPointConfig
{
    FName m_Name;                                                                     // 0x0000 (size: 0x8)
    FName m_Scene;                                                                    // 0x0008 (size: 0x8)
    FTransform m_Transform;                                                           // 0x0010 (size: 0x60)
    TSubclassOf<class UWorldPointScript> m_WorldPointScript;                          // 0x0070 (size: 0x8)
    class UWorldPointScript* m_WorldPointScriptInstance;                              // 0x0078 (size: 0x8)
    FString m_WorldPointScriptName;                                                   // 0x0080 (size: 0x10)
    FItemSpawnConfig m_ItemSpawnConfig;                                               // 0x0090 (size: 0x68)
    TArray<FItemSpawnPosition> m_ItemSpawnPositions;                                  // 0x00F8 (size: 0x10)
    bool m_IsActive;                                                                  // 0x0108 (size: 0x1)
    class UObject* m_OptionalObject;                                                  // 0x0110 (size: 0x8)
    float m_Radius;                                                                   // 0x0118 (size: 0x4)
    FTransform m_ActorTransform;                                                      // 0x0120 (size: 0x60)

}; // Size: 0x180

struct FWorldPointElement
{
    int32 m_Id;                                                                       // 0x0000 (size: 0x4)
    EWorldPointElementType m_Type;                                                    // 0x0004 (size: 0x1)

}; // Size: 0x78

struct FWorldPointSaveGameData
{
    double m_CurrentSeconds;                                                          // 0x0000 (size: 0x8)
    bool m_RegenItems;                                                                // 0x0008 (size: 0x1)
    FName m_PointUniqueName;                                                          // 0x000C (size: 0x8)
    TMap<int32, FName> m_EmptyCoordItem;                                              // 0x0018 (size: 0x50)
    TArray<FName> m_EventsToCall;                                                     // 0x0068 (size: 0x10)
    TMap<int32, FName> m_Items;                                                       // 0x0078 (size: 0x50)

}; // Size: 0xC8

struct FWorldPointsSaveGameData
{
    TArray<FName> m_ActiveEvents;                                                     // 0x0000 (size: 0x10)
    TMap<class FName, class FWorldPointSaveGameData> m_WorldPoint;                    // 0x0010 (size: 0x50)
    TMap<int32, FDroppedItem> m_SavedDropItemsArray;                                  // 0x0060 (size: 0x50)
    int32 m_NumDropItems;                                                             // 0x00B0 (size: 0x4)

}; // Size: 0xB8

struct FZDivergeSampleLocation
{
}; // Size: 0x38

class AAIAgentCharacter : public AGothicCharacter
{
    class USkeletalMesh* ReplicatedMesh;                                              // 0x09D0 (size: 0x8)
    TSubclassOf<class UAIAgentConfig> DefaultAIAgentConfig;                           // 0x09D8 (size: 0x8)
    class UNPCTalkBalloonComponent* m_TalkBalloonComponent;                           // 0x09E0 (size: 0x8)

    void OnRep_ReplicatedMesh();
    void HandleDefeated(class AActor* DefeatingCharacterActor);
    void HandleDeathAS();
    void HandleDeath(class AActor* DyingCharacterActor);
}; // Size: 0x9F0

class AAIAgentController : public AAIController
{
}; // Size: 0x3C8

class AAITestSpawner : public AActor
{
    bool bEnable;                                                                     // 0x0298 (size: 0x1)
    TSubclassOf<class USpawnAIAgentDefinition> CharacterKind;                         // 0x02A0 (size: 0x8)
    TSubclassOf<class UAIState_DailyRoutine> DailyRoutine;                            // 0x02A8 (size: 0x8)
    class UChildActorComponent* PreviewCharacterActorComponent;                       // 0x02B0 (size: 0x8)
    class USkeletalMeshComponent* OldRootComponent;                                   // 0x02B8 (size: 0x8)

    void SpawnCharacter();
}; // Size: 0x2C0

class AActorMapBoundingBox : public AActor
{
    FGameplayTag ZoneTagMap;                                                          // 0x0290 (size: 0x8)

}; // Size: 0x298

class AAdditionalConversationLight : public AActor
{
    FName Name;                                                                       // 0x0290 (size: 0x8)
    bool bIsForSpeaker;                                                               // 0x0298 (size: 0x1)
    class URectLightComponent* RectLightComponent;                                    // 0x02A0 (size: 0x8)
    FLightValues LightValues;                                                         // 0x02B0 (size: 0x430)

}; // Size: 0x6E0

class AAmbientCharacter : public AClientAuthoritativeCharacter
{
}; // Size: 0x740

class AAmbientItemSpawner : public AActor
{
    bool bAllowRefillWhilePlayerIsLooking;                                            // 0x02A8 (size: 0x1)
    bool bShowPreviewActors;                                                          // 0x02A9 (size: 0x1)
    FInteractionSpotHandle NavigationSpotHandle;                                      // 0x02AC (size: 0x8)
    TArray<FSpawnSlot> ItemSlots;                                                     // 0x02B8 (size: 0x10)
    class UStaticMeshComponent* StaticMesh;                                           // 0x02C8 (size: 0x8)
    FVector NavSpotRelativePosition;                                                  // 0x02D0 (size: 0x18)
    FName NavSpotName;                                                                // 0x02E8 (size: 0x8)

    void HandleItemDestroyed(class AActor* DestroyedItem);
}; // Size: 0x2F0

class AAmbientLifeWarningFlock : public AActor
{
    TSubclassOf<class UAmbientLifeConfig> m_AmbientConfigDefinition;                  // 0x0290 (size: 0x8)
    class USceneComponent* m_RootComponent;                                           // 0x02A0 (size: 0x8)
    class UAmbientPerceptionComponent* m_PerceptionComponent;                         // 0x02A8 (size: 0x8)
    TArray<FTransform> m_Positions;                                                   // 0x0350 (size: 0x10)
    TArray<class ACharacter*> m_Creatures;                                            // 0x0370 (size: 0x10)
    FGameplayMessageListenerHandle m_ListenerHandle;                                  // 0x03D0 (size: 0x20)
    TArray<FGameplayMessageListenerHandle> m_Listeners;                               // 0x03F8 (size: 0x10)

    void Server_SpawnCreature(const FTransform Transform, TSubclassOf<class ACharacter> charToSpawn, class UWorld* World);
    void OnCreatureDestroyed(class AActor* Target);
    void HandlePerceptionGained(const FRememberedPerception& Perception, const FPerceptionShortTermMemory& Memory);
}; // Size: 0x408

class AAnimatedInteractiveObjectActor : public AInteractiveObjectActor
{

    void BP_PlayAnimationMontage(class UAnimMontage* Montage, FName StartSection);
    FName BP_GetCurrentMontageSection();
}; // Size: 0x928

class AArcheryWeaponVisual : public AItemVisual
{
    class USkeletalMeshComponent* m_MeshComp;                                         // 0x0330 (size: 0x8)
    class AArrowVisual* m_ArrowNotched;                                               // 0x0338 (size: 0x8)
    FName m_HandleSocketName;                                                         // 0x0340 (size: 0x8)
    FName m_StringSocketName;                                                         // 0x0348 (size: 0x8)
    bool m_HasArrowNotched;                                                           // 0x03AA (size: 0x1)

    void OnItemAddedInMainContainer(const class UItemDefinition* new_item, int32 Count);
    void MulticastDetachArrow(class AArrowVisual* arrow);
    void MulticastAttachArrow(class AArrowVisual* arrow, const FName& SocketName);
    bool HasArrowNotched();
}; // Size: 0x3B0

class AArrowVisual : public AProjectileVisual
{
    float m_Bounciness;                                                               // 0x0428 (size: 0x4)
    float m_Friction;                                                                 // 0x042C (size: 0x4)
    float m_BounceVelocityStopSimulatingThreshold;                                    // 0x0430 (size: 0x4)
    float m_MinFrictionFraction;                                                      // 0x0434 (size: 0x4)
    float m_SurfaceHardnessMakesBounce;                                               // 0x0438 (size: 0x4)
    class UStaticMeshComponent* m_MeshComp;                                           // 0x0440 (size: 0x8)

    void MulticastStop();
    void MulticastDetachFromActor();
    void MulticastBreakArrow(float randomValue);
    bool HasBouncingWhenHit_Scriptable(class AActor* HitActor, float surfaceHardness);
    void DoInteractableArrowFallBehaviour_Scriptable(class AItemVisualWorld* InteractableArrow, float kineticEnergyCoef, bool hasBouncingWhenHit);
    bool CanAttachArrowOnHitActor_Scriptable(class AActor* HitActor, float surfaceHardness);
    void BP_OnStopped();
    void BP_OnStartFlying();
    void BP_OnOverlapWater(const FVector& impactLocation, const FVector& ImpactNormal);
    void BP_OnOverlap(const FVector& impactLocation, const FVector& ImpactNormal, const class UG1RPhysicsMaterial* PhysicsMaterial);
    void BP_OnHit(const class AActor* actorHit, const FVector& HitLocation, const FVector& hitDirection, const FVector& SurfaceNormal, const class UG1RPhysicsMaterial* PhysicsMaterial);
    void BP_OnBreak(float randomValue);
}; // Size: 0x4C0

class ABaitVisual : public AItemVisual
{
    class USphereComponent* m_CollisionComp;                                          // 0x0328 (size: 0x8)
    class UProjectileMovementComponent* m_MovementComp;                               // 0x0330 (size: 0x8)
    class UParticleSystemComponent* m_ParticleComp;                                   // 0x0338 (size: 0x8)
    class UStaticMeshComponent* m_MeshComp;                                           // 0x0340 (size: 0x8)

    void OnOverlapBeginServer(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const FHitResult& SweepResult);
    void Multicast_StopArrow(const FHitResult SweepResult);
}; // Size: 0x348

class ABarrierManager : public AActor
{
    float BarrierLocalRadius;                                                         // 0x0290 (size: 0x4)
    float m_SafeZoneDistance;                                                         // 0x0294 (size: 0x4)
    float m_WarningZoneDistance;                                                      // 0x0298 (size: 0x4)
    float m_RedZoneDistance;                                                          // 0x029C (size: 0x4)
    class AActor* m_Barrier;                                                          // 0x02A0 (size: 0x8)
    class AActor* m_BarrierCollider;                                                  // 0x02A8 (size: 0x8)
    class AActor* CloseDistanceBarrier;                                               // 0x02B0 (size: 0x8)
    class APostProcessVolume* m_PostProcess;                                          // 0x02B8 (size: 0x8)
    TScriptInterface<class IActivableActor> CloseDistanceBarrierActivableActor;       // 0x02C0 (size: 0x10)
    TArray<TScriptInterface<IAreaContainerDetector>> CustomSafeZones;                 // 0x02D0 (size: 0x10)
    float m_BarrierRayRandomFactor;                                                   // 0x02F0 (size: 0x4)
    float m_GroundRayRandomFactor;                                                    // 0x02F4 (size: 0x4)
    float m_MaxHeight;                                                                // 0x02F8 (size: 0x4)
    uint8 m_GroundRaysAmount;                                                         // 0x02FC (size: 0x1)
    uint8 m_BarrierRaysAmount;                                                        // 0x02FD (size: 0x1)
    float m_NewRayBarrierDist;                                                        // 0x0300 (size: 0x4)
    float m_NewRayGroundDist;                                                         // 0x0304 (size: 0x4)
    float m_MinBarrierRayDistance;                                                    // 0x0308 (size: 0x4)
    FLinearColor m_LightColor;                                                        // 0x030C (size: 0x10)
    float m_LightIntensity;                                                           // 0x031C (size: 0x4)
    float m_LightVolumetricScattering;                                                // 0x0320 (size: 0x4)
    float m_PostProcessFactor;                                                        // 0x0324 (size: 0x4)
    class UMaterialInterface* m_LightFunctionMaterial;                                // 0x0328 (size: 0x8)
    TSubclassOf<class UGameplayEffect> m_OrangeZoneEffect;                            // 0x0338 (size: 0x8)
    TSubclassOf<class UGameplayEffect> m_RedZoneEffect;                               // 0x0340 (size: 0x8)
    class UNiagaraSystem* m_BarrierRayParticleSystem;                                 // 0x0348 (size: 0x8)
    class UNiagaraSystem* m_FeetRayParticleSystem;                                    // 0x0350 (size: 0x8)
    TArray<FString> m_GroundRaysSourceBones;                                          // 0x0358 (size: 0x10)
    TArray<FString> m_RedRaysSourceBones;                                             // 0x0368 (size: 0x10)
    TMap<uint32, UBarrierCharacterHandler*> CharacterHandlers;                        // 0x0378 (size: 0x50)
    FGameplayTag m_FX_BarrierWarning;                                                 // 0x03CC (size: 0x8)
    FGameplayTag m_FX_BarrierOrange;                                                  // 0x03D4 (size: 0x8)
    FGameplayTag m_FX_BarrierOrange_NPC;                                              // 0x03DC (size: 0x8)
    FGameplayTag m_FX_BarrierRed;                                                     // 0x03E4 (size: 0x8)
    FGameplayTag m_FX_BarrierRed_NPC;                                                 // 0x03EC (size: 0x8)

    void SetActiveState(bool State);
    FGameplayEffectSpecHandle CreateSpecFromGameplayEffect(const class UGameplayEffect* GameplayEffect, const class AGothicCharacter* Character);
}; // Size: 0x3F8

class ABarrierParticlesManager : public AActor
{
    class AActor* m_ParticleActor;                                                    // 0x0290 (size: 0x8)
    float m_ActivationDistance;                                                       // 0x0298 (size: 0x4)
    uint64 m_ChecksPerFrame;                                                          // 0x02A0 (size: 0x8)
    float m_SphereTraceRadius;                                                        // 0x02A8 (size: 0x4)
    float m_UpDisplacement;                                                           // 0x02AC (size: 0x4)
    TArray<FParticlePoint> m_ParticlePoints;                                          // 0x02B0 (size: 0x10)
    TArray<class AActor*> m_ParticleSystemsPool;                                      // 0x02C0 (size: 0x10)

    TArray<FParticlePoint> GetLandscapePoints();
}; // Size: 0x2D8

class ABookCaptureActor : public ALightweightSceneCapture2D
{
    int32 m_MaxNumPageFlips;                                                          // 0x02A8 (size: 0x4)
    int32 m_CurrentPageFlip;                                                          // 0x02AC (size: 0x4)
    int32 m_NumPages;                                                                 // 0x02B0 (size: 0x4)
    int32 m_CurrentLeftPage;                                                          // 0x02B4 (size: 0x4)
    int32 m_CurrentRightPage;                                                         // 0x02B8 (size: 0x4)
    class UDocument* m_CurrentDocument;                                               // 0x02C0 (size: 0x8)
    class UUserWidget* m_BookCoverWidget;                                             // 0x02C8 (size: 0x8)
    class UUserWidget* m_LeftPageWidget;                                              // 0x02D0 (size: 0x8)
    class UUserWidget* m_RightPageWidget;                                             // 0x02D8 (size: 0x8)
    class UUserWidget* m_BlankPageWidget;                                             // 0x02E0 (size: 0x8)
    TArray<class UUserWidget*> m_PageWidgets;                                         // 0x02E8 (size: 0x10)
    FBookCaptureActor_OnPageFlipped m_OnPageFlipped;                                  // 0x02F8 (size: 0x10)
    void OnPageFlipped(bool _LeftPage);
    class UMaterialInterface* m_BookMaterialTemplate;                                 // 0x0308 (size: 0x8)
    class UTexture* m_BaseTextureOverride;                                            // 0x0310 (size: 0x8)
    TMap<int32, FPageContent> m_OrderedPages;                                         // 0x0318 (size: 0x50)
    int32 m_RenderTargetSize_PageX;                                                   // 0x0368 (size: 0x4)
    int32 m_RenderTargetSize_PageY;                                                   // 0x036C (size: 0x4)
    class USkeletalMeshComponent* m_BookMeshComponent;                                // 0x0370 (size: 0x8)
    class UAnimSequence* m_Animation_OpenBook;                                        // 0x0378 (size: 0x8)
    class UAnimSequence* m_Animation_CloseBook;                                       // 0x0380 (size: 0x8)
    class UAnimSequence* m_Animation_PrevPage;                                        // 0x0388 (size: 0x8)
    class UAnimSequence* m_Animation_NextPage;                                        // 0x0390 (size: 0x8)
    FName m_BaseTextureName;                                                          // 0x0398 (size: 0x8)
    FName m_TintColorParam;                                                           // 0x03A0 (size: 0x8)
    TMap<class EBookCapturePage, class FName> m_PageMaterialParamNames;               // 0x03A8 (size: 0x50)
    class UMaterialInstanceDynamic* m_DynamicBookMaterial;                            // 0x0400 (size: 0x8)
    TArray<class UTextureRenderTarget2D*> m_RendertargetForPage;                      // 0x0410 (size: 0x10)
    class UTextureRenderTarget2D* m_FinalRenderTarget;                                // 0x0420 (size: 0x8)
    TArray<class UUserWidget*> m_WidgetForPage;                                       // 0x0428 (size: 0x10)
    FBookCaptureActor_OnBookInitialized m_OnBookInitialized;                          // 0x0438 (size: 0x10)
    void OnBookInitialized(FText _BookTitle, class UBookCoverConfiguration* _BookCover);

    void SetTintColor(FLinearColor _Color);
    void SetPageWidgets(EBookCapturePage _Page, class UUserWidget* _PageWidget);
    void SetInitialPages(class UUserWidget* _WidgetCover);
    void OnBookWidgetConstructed();
    void OnBookWidgetClosed();
    void InitializeBook(TSubclassOf<class UWritingDocument> _Document, class UBookCoverConfiguration* _BookCoverConfig);
    EBookCaptureAnimState GetAnimState();
    void EnsureWidgetSet(EBookCapturePage _Page, class UUserWidget* _Widget, bool _RequireInit);
    class UUserWidget* CreateWidget(TSubclassOf<class UUserWidget> _WidgetClass);
    bool CanAnimateToPrevPage();
    bool CanAnimateToNextPage();
    void CallRebuildWidget(class UUserWidget* _PageWidget);
    void BP_TestPreviousPage();
    void BP_TestNextPage();
    void BP_AnimateOpenBook();
    void BP_AnimateCloseBook();
    void AnimateToPreviousPage();
    void AnimateToNextPage();
    void AnimatePageTo(bool _NextPage);
    void AnimateOpenBook();
    void AnimateCloseBook();
}; // Size: 0x458

class ACarriableWorldItem : public AItemVisualWorld
{
    bool bIsClickable;                                                                // 0x0AD0 (size: 0x1)
    bool bCustomCollision;                                                            // 0x0AD1 (size: 0x1)
    float DestructionCheckIntervall;                                                  // 0x0AD4 (size: 0x4)
    EWorldItemState State;                                                            // 0x0AD8 (size: 0x1)

}; // Size: 0xAE8

class ACharacterCanTransformInto : public AGothicCharacter
{
    TWeakObjectPtr<class USpawnCharacterCanTransformIntoDefinition> m_SpawnDefinition; // 0x09D0 (size: 0x8)
    class UDataModuleComponent* m_DataModuleComponent;                                // 0x09E8 (size: 0x8)
    class UAnimMontage* m_AnimMontage;                                                // 0x09F0 (size: 0x8)
    class AGothicCharacter* m_FromCharacter;                                          // 0x09F8 (size: 0x8)
    class AGothicCharacter* m_ToCharacter;                                            // 0x0A00 (size: 0x8)
    class UAnimMontage* m_Montage;                                                    // 0x0A08 (size: 0x8)

    void TransformFrom(class AGothicCharacter* fromCharacter, class AGothicCharacter* toCharacter, float InitialDelay, float Duration, class UAnimMontage* Montage);
    void OnUntransformMontageBlendInEnded(class UAnimMontage* Montage, bool bInterrupted);
    void OnTransformMontageBlendInEnded(class UAnimMontage* Montage, bool bInterrupted);
    void OnControllerChanged(class APawn* Pawn, class AController* OldController, class AController* NewController);
    void MulticastTransformationVisuals(class AGothicCharacter* fromCharacter, class AGothicCharacter* toCharacter, class UAnimMontage* Montage);
    void MulticastStartCameraTravelBeforePossess(class AGothicCharacter* fromCharacter, class AGothicCharacter* toCharacter, float InitialDelay, float Duration);
    void MulticastSaveTransformData(class AGothicCharacter* fromCharacter, class AGothicCharacter* toCharacter, float InitialDelay, float Duration, class UAnimMontage* Montage);
    void MulticastEnterUntransformingState();
    void BP_BeforeDestruction();
}; // Size: 0xA20

class ACheckElementsInsideVolume : public AActor
{
    class UBoxComponent* Box;                                                         // 0x0290 (size: 0x8)
    TMap<FString, int32> ElementsExpected;                                            // 0x0298 (size: 0x50)
    TArray<class AItemVisualWorld*> ElementsInside;                                   // 0x02E8 (size: 0x10)
    TMap<FString, int32> AccumulatedCounts;                                           // 0x02F8 (size: 0x50)

    void OnValid();
    void OnOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
    void OnOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const FHitResult& SweepResult);
}; // Size: 0x348

class ACinematicCharacter : public ACharacter
{
    class UGothicAbilitySystemComponent* AbilitySystemComponent;                      // 0x0670 (size: 0x8)
    FText m_CharacterName;                                                            // 0x0678 (size: 0x10)
    bool ForceCinematicLOD;                                                           // 0x0688 (size: 0x1)

    class UAbilitySystemComponent* GetAbilitySystemComponent();
}; // Size: 0x690

class ACinematicsTesting : public AActor
{
    bool IsEnabled;                                                                   // 0x0290 (size: 0x1)
    float SafeDistancePercentage;                                                     // 0x0294 (size: 0x4)
    float DistanceFromCameraToShotCenter;                                             // 0x0298 (size: 0x4)
    float FadeRadius;                                                                 // 0x029C (size: 0x4)
    TSoftObjectPtr<UMaterialParameterCollection> CinematicParameterCollection;        // 0x02A0 (size: 0x28)

}; // Size: 0x2C8

class AClientAuthoritativeCharacter : public ACharacter
{
    bool bHasOverrideRootMotion;                                                      // 0x0668 (size: 0x1)

    void ClientAuthoritativeMove(const FClientAuthoritativeMoveData& MoveData);
}; // Size: 0x670

class AClientAuthoritativePlayerController : public APlayerController
{
}; // Size: 0x858

class AClimbableWall : public AInteractiveObjectActor
{
    class UBoxComponent* m_BoxComponent;                                              // 0x0928 (size: 0x8)
    class AGothicCharacter* m_Character;                                              // 0x0938 (size: 0x8)
    class UCapsuleComponent* m_CharacterCapsuleComponent;                             // 0x0940 (size: 0x8)

}; // Size: 0x958

class AConcertStageManager : public AGothicGASActor
{
    class AGothicAmbientSoundActor* m_AudioTrack;                                     // 0x02A8 (size: 0x8)
    bool m_WasPaused;                                                                 // 0x02B0 (size: 0x1)
    bool m_WaitingToResumeSequenceFromPause;                                          // 0x02B1 (size: 0x1)
    bool m_ActivateSequenceOnLoad;                                                    // 0x02B2 (size: 0x1)
    bool m_ActivateAudioTrackOnLoad;                                                  // 0x02B3 (size: 0x1)
    bool m_IsAudioTrackSyncEnabled;                                                   // 0x02B4 (size: 0x1)
    bool m_IsPlayerOutOfRange;                                                        // 0x02B5 (size: 0x1)
    class APlayerController* m_PC;                                                    // 0x02B8 (size: 0x8)
    class ALevelSequenceActor* m_SequenceActor;                                       // 0x02C0 (size: 0x8)
    FQualifiedFrameTime m_SequenceFrameTime;                                          // 0x02C8 (size: 0x10)
    int32 m_AudioTrackTime;                                                           // 0x02D8 (size: 0x4)
    int32 m_MaxUnsyncFrames;                                                          // 0x02DC (size: 0x4)
    FGothicFXInstanceHandle m_SFXTrackHandle;                                         // 0x02E0 (size: 0x8)
    FGameplayTag m_SFXTag;                                                            // 0x02E8 (size: 0x8)
    int32 m_AudioStartEventFrame;                                                     // 0x02F0 (size: 0x4)
    FGameplayMessageListenerHandle m_PreSaveListenerHandle;                           // 0x02F8 (size: 0x20)
    FGameplayMessageListenerHandle m_PostSaveListenerHandle;                          // 0x0318 (size: 0x20)

    void ResetAll_Scriptable();
    void ResetAll();
    void PlaySequence();
    void Play();
    void OnSequenceStopped();
    void OnSequenceFinished_Scriptable();
    void OnSequenceFinished();
    void OnRecoveredSavedData_Scriptable(const FReplicatedStringMap& Data);
    void OnFillSaveData_Scriptable(FReplicatedStringMap& Data);
    void OnAudioTrackStart();
    void OnAudioTrackEnds();
    bool IsSequenceStarted();
    bool IsSequenceCompleted();
    void ForceSaveSequenceFinished();
    void BP_OnPreSaveMessage(FGameplayTag Channel, const FGothicBasicVerbMessage& Payload);
    void BP_OnPostSaveMessage(FGameplayTag Channel, const FGothicBasicVerbMessage& Payload);
}; // Size: 0x368

class AConversationCameraPresetChoice : public AConversationCameraV2
{
    FGameplayTagContainer SpeakEventSubscriptions;                                    // 0x26D8 (size: 0x20)
    FGameplayTagContainer TopicEventSubscriptions;                                    // 0x26F8 (size: 0x20)
    FGameplayTagContainer TopicChoiceEventSubscriptions;                              // 0x2718 (size: 0x20)
    FGameplayTagContainer PriorityEventSubscriptions;                                 // 0x2738 (size: 0x20)
    FGameplayTagContainer PriorityEventIgnores;                                       // 0x2758 (size: 0x20)
    FGameplayTagContainer ReverseShotSubscriptions;                                   // 0x2778 (size: 0x20)
    FGameplayTagContainer SkipLineSubscriptions;                                      // 0x2798 (size: 0x20)
    class AGothicCharacter* NextSpeaker;                                              // 0x27B8 (size: 0x8)
    class AGothicCharacter* NextListener;                                             // 0x27C0 (size: 0x8)
    TArray<class UAbilitySystemComponent*> AbilitySystemComponents;                   // 0x27C8 (size: 0x10)
    bool bNewPresetOnSameSpeaker;                                                     // 0x292A (size: 0x1)
    float MinSpeakTime;                                                               // 0x292C (size: 0x4)
    TArray<FIncomingCameraEvent> LatestEvents;                                        // 0x2930 (size: 0x10)
    int32 NumFramesToBufferEvents;                                                    // 0x2940 (size: 0x4)
    uint64 FirstEventFrame;                                                           // 0x2948 (size: 0x8)
    FGameplayTag LastUsedEventTag;                                                    // 0x2950 (size: 0x8)
    float RapidSkipSecondsTimeWindow;                                                 // 0x2958 (size: 0x4)

    bool DetermineNewSpeakerListener(const FGameplayEventData& EventData);
    void BindPresetTagSubscriptionDelegateForPlayer(class UAbilitySystemComponent* ASC);
    void BindPresetTagSubscriptionDelegateForParticipant(class UAbilitySystemComponent* ASC);
    void AddParticipantsAbilitySystemComponent(class UAbilitySystemComponent* ASC);
}; // Size: 0x2970

class AConversationCameraV2 : public ACineCameraActor
{
    class AGothicCharacter* ConversationInitiator;                                    // 0x0A28 (size: 0x8)
    class AGothicCharacter* ConversationInitiatorPartner;                             // 0x0A30 (size: 0x8)
    class AGothicCharacter* MainParticipant;                                          // 0x0A38 (size: 0x8)
    FIndoorDetectionSampler IndoorDetectionConfig;                                    // 0x0A40 (size: 0xD0)
    bool bUseRightSide;                                                               // 0x0B10 (size: 0x1)
    class APostProcessVolume* Volume;                                                 // 0x0B18 (size: 0x8)
    class UConversationCameraLightingAdjuster* LightingAdjuster;                      // 0x0B20 (size: 0x8)
    FCameraViewParameters CurrentPresetParams;                                        // 0x0B28 (size: 0x18)
    class AEnvironmentLightIntensityCaptureActor* EnvironmentIntensityCaptureActor;   // 0x0B40 (size: 0x8)
    TMap<class FName, class TSoftObjectPtr<UMaterialInterface>> AdditionalLightMaterials; // 0x0B48 (size: 0x50)
    TMap<class FName, class TSoftObjectPtr<UCameraAnimationSequence>> CameraAnimSequences; // 0x0B98 (size: 0x50)
    float LastExternalLightIntensityScore;                                            // 0x0BE8 (size: 0x4)
    FLinearColor LastExternalLightColor;                                              // 0x0BEC (size: 0x10)
    float MonologTimeThreshold;                                                       // 0x0BFC (size: 0x4)
    float CurrentMonologTimer;                                                        // 0x0C00 (size: 0x4)
    bool bForceAlwaysOutside;                                                         // 0x0C04 (size: 0x1)
    bool bForceAlwaysInside;                                                          // 0x0C05 (size: 0x1)
    TArray<class UConversationCameraPresetBase*> AllPresetInstances;                  // 0x0C08 (size: 0x10)
    TMap<class AGothicCharacter*, class bool> CharacterInShadowMap;                   // 0x0C18 (size: 0x50)
    float PreferredCharacterDistance;                                                 // 0x0C68 (size: 0x4)
    float ReferenceDistance;                                                          // 0x0C6C (size: 0x4)
    TMap<class AGothicCharacter*, class FTransform> ParticipantIdealTransforms;       // 0x0C70 (size: 0x50)
    FString FirstConversationTopicName;                                               // 0x0CC0 (size: 0x10)
    TArray<class AGothicCharacter*> Participants;                                     // 0x0CD0 (size: 0x10)
    TMap<class AGothicCharacter*, class bool> ParticipantInsideResults;               // 0x1E10 (size: 0x50)
    int32 DefaultTestAmount;                                                          // 0x1E60 (size: 0x4)
    float ObstructionSweepTestSize;                                                   // 0x1E64 (size: 0x4)
    float ObstructionSweepTestCharacterDistance;                                      // 0x1E68 (size: 0x4)
    class AActor* LastCamera;                                                         // 0x1E70 (size: 0x8)
    TMap<class AGothicCharacter*, class FActorLightingChannels> InitialParticipantLightingChannels; // 0x1E78 (size: 0x50)
    int32 PresetReuseBuffer;                                                          // 0x1EC8 (size: 0x4)
    bool bUseTagFallback;                                                             // 0x1ED4 (size: 0x1)
    float ActorPositionThreshold;                                                     // 0x1ED8 (size: 0x4)
    float ActorLerpSpeed;                                                             // 0x1EDC (size: 0x4)
    class ADynamicNavObstacle* NavObstacleCameraView;                                 // 0x1EE0 (size: 0x8)
    class ADynamicNavObstacle* NavObstacleParticipants;                               // 0x1EE8 (size: 0x8)
    float InputAdjustmentRestrictionX;                                                // 0x1EF0 (size: 0x4)
    float InputAdjustmentRestrictionY;                                                // 0x1EF4 (size: 0x4)
    float NavObstacleCameraDistance;                                                  // 0x1EF8 (size: 0x4)
    TSoftObjectPtr<UMaterialParameterCollection> CinematicParameterCollection;        // 0x1F30 (size: 0x28)
    TArray<class UGothicConversationCameraModifier*> AppliedCameraModifiers;          // 0x1F58 (size: 0x10)
    FPostProcessSettings PostProcessSettings;                                         // 0x1F70 (size: 0x6F0)
    float AlphaFadeDistance;                                                          // 0x2660 (size: 0x4)
    float AlphaFadePercentage;                                                        // 0x2664 (size: 0x4)
    float AlphaFadeRadius;                                                            // 0x2668 (size: 0x4)
    float AlphaFadeDistanceResetValue;                                                // 0x266C (size: 0x4)
    float AlphaFadeOffsetResetValue;                                                  // 0x2670 (size: 0x4)
    float EyeIntensityResetValue;                                                     // 0x2674 (size: 0x4)
    float AlphaFadeRadiusResetValues;                                                 // 0x2678 (size: 0x4)
    float FeetHeightAddedForObstructionCheck;                                         // 0x267C (size: 0x4)
    FVector HideCharacterAroundCameraExtent;                                          // 0x26A0 (size: 0x18)
    bool bDebugShowSideChoiceTest;                                                    // 0x26B9 (size: 0x1)

    void UpdateLightActors();
    void UpdateCinematicParameters(const bool IsEnabled, const float SafeDistancePercentage, const float DistanceFromCameraToShotCenter, const float FadeRadius, const float EyeIntensity);
    void StopCurrentCamAnimationSequence();
    void SpawnAdditionalLight(const FLightValues& LightValues);
    void SetValidRandomPresetByTag(class AGothicCharacter* Speaker, class AGothicCharacter* Listener, FGameplayTag PresetTag, const bool bIgnoreTransitionList);
    void SetPresetClasses();
    bool SetPresetByName(const FName PresetName, class AGothicCharacter* Speaker, class AGothicCharacter* Listener, const bool bUseRandomSelectionChecks, const bool bForcePreset);
    void SetFoV(const float Value);
    void SetDefaultCameraPreset(class AGothicCharacter* Speaker, class AGothicCharacter* Listener, FGameplayTag LastPresetTag, bool bOnlyUseFallbackWithSameTag);
    bool SetCurrentPreset(class UConversationCameraPresetBase* NewPreset, class AGothicCharacter* Speaker, class AGothicCharacter* Listener);
    void SetCinematicResetParameters();
    void SetCineCamParameters();
    bool SetCameraAsViewTarget();
    void RemoveEnvironmentLightCapture();
    void RemoveAppliedCameraModifiers();
    void RemoveAppliedCameraModifier(class UGothicConversationCameraModifier* CamMod);
    float ReadEnvironmentLightCapture(const FVector& Direction);
    void PlayCurrentCamAnimationSequence();
    void MaterialDistanceFadeLoadingComplete();
    void LoadCamAnimationSequenceAsync();
    void LoadAlphaFadeMaterialAsync();
    void LoadAdditionalLightsMaterialAsync();
    bool IsPresetValid(class UConversationCameraPresetBase* PresetParameters, class AGothicCharacter* Speaker, class AGothicCharacter* Listener, const bool bDoChecksForRandomSelection);
    void InvertPresetToCorrectSide(class UConversationCameraPresetBase* Preset, class AGothicCharacter* Speaker, class AGothicCharacter* Listener);
    void HideParticipants();
    void HideNearbyCharactersIfNeeded();
    void HandleLightMaterialLoadingComplete();
    void HandleIndoorDetectionResultsAvailable(const FIndoorDetectionResult& Result, TWeakObjectPtr<class AGothicCharacter> Participant);
    void HandleAnimationSequenceComplete();
    class UConversationCameraPresetBase* GetWeightedRandomPresetFromSelection(TArray<class UConversationCameraPresetBase*>& Presets);
    class UConversationCameraPresetBase* GetRandomPresetFromSelectionNoWeight(TArray<class UConversationCameraPresetBase*>& Presets);
    class UConversationCameraPresetBase* GetPresetByName(FName PresetName);
    class UConversationCameraPresetBase* GetPresetByClass(const TSubclassOf<class UConversationCameraPresetBase>& PresetSubClass);
    TArray<class AGothicCharacter*> GetParticipants();
    TSoftObjectPtr<UCameraAnimationSequence> GetCamAnimationSequence(const FName SequenceName);
    TSoftObjectPtr<UMaterialInterface> GetAdditionalLightMaterial(const FName MaterialName);
    void ForceCaptureEnvironmentLightIfNeeded();
    void DoWhenPresetChanges();
    void DoAfterNewCamPositionWasApplied();
    void ChooseCameraSide(const class AGothicCharacter* Speaker, const class AGothicCharacter* Listener);
    void CameraStop();
    void CameraStart(class AGothicCharacter* InitiatingParticipant, class AGothicCharacter* Listener);
    void AttachEnvironmentLightCapture();
    void ApplyCameraModifiers();
    void AddParticipant(class AGothicCharacter* NewParticipant);
    bool ActorIsAdditionalParticipant(class AGothicCharacter* Participant);
}; // Size: 0x26E0

class ACooperativeGameMode : public AMultiplayerGameMode
{
}; // Size: 0x3D0

class ACustomNavCollisionStaticMeshActor : public AStaticMeshActor
{
}; // Size: 0x2A0

class ADebuffEffectActorByTag : public AEffectActorBase
{

    void OnGameplayEffectAppliedToTargetDynamicDelegate(class UAbilitySystemComponent* TargetAbilitySystemComponent, const FGameplayEffectSpec& GameplayEffectSpec, FActiveGameplayEffectHandle ActiveGameplayEffectHandle);
    void OnGameplayEffectAppliedToSelfDynamicDelegate(class UAbilitySystemComponent* TargetAbilitySystemComponent, const FGameplayEffectSpec& GameplayEffectSpec, FActiveGameplayEffectHandle ActiveGameplayEffectHandle);
    void OnDecreasedStack();
    void OnAllowPlayOutMontageOnPrematureRemoval();
    void OnActiveGameplayEffectAddedToSelfDynamicDelegate(class UAbilitySystemComponent* TargetAbilitySystemComponent, const FGameplayEffectSpec& GameplayEffectSpec, FActiveGameplayEffectHandle ActiveGameplayEffectHandle);
}; // Size: 0x2F8

class ADeliverySpotGroup : public AActor
{
    bool bIsFinalDestination;                                                         // 0x02A8 (size: 0x1)
    bool bShowPreviewItems;                                                           // 0x02A9 (size: 0x1)
    FInteractionSpotHandle NavigationSpotHandle;                                      // 0x02AC (size: 0x8)
    bool bAdjustItemOnPutDown;                                                        // 0x02B4 (size: 0x1)
    FName Spotname;                                                                   // 0x02B8 (size: 0x8)
    TArray<FDeliverySpot> DeliverySpots;                                              // 0x02C0 (size: 0x10)
    class UStaticMeshComponent* StaticMesh;                                           // 0x02D0 (size: 0x8)

    void SetSpotItem(FInteractionSpotHandle SpotHandle, class AActor* Item);
    bool HasSpotsLeft();
    TArray<FInteractionSpotHandle> GetOwnedInteractionSpots();
}; // Size: 0x2D8

class ADynamicNavObstacle : public AActor
{
    class UBoxComponent* BoxComponent;                                                // 0x0290 (size: 0x8)
    bool bIsEnabled;                                                                  // 0x0298 (size: 0x1)
    FVector ObstacleExtends;                                                          // 0x02A0 (size: 0x18)
    class USceneComponent* CachedReferenceComponent;                                  // 0x02C8 (size: 0x8)
    float CachedReferenceExtentScale;                                                 // 0x02D0 (size: 0x4)

    void SetNavObstacleEnabled(bool bShouldBeEnabled);
    void OnRep_ObstacleExtends();
    void OnRep_IsEnabled();
}; // Size: 0x2D8

class AEditorIndoorDetectionTestActor : public AActor
{
    bool bUpdateOnTick;                                                               // 0x0290 (size: 0x1)
    class UIndoorDetectionComponent* IndoorDetectionComponent;                        // 0x0298 (size: 0x8)

}; // Size: 0x2A0

class AEditorNavigationInvoker : public AActor
{
    class UGothicNavigationInvokerComponent* Invoker;                                 // 0x0290 (size: 0x8)
    class USphereComponent* SphereComponent;                                          // 0x0298 (size: 0x8)

}; // Size: 0x2A0

class AEffectActorBase : public AGothicGASActor
{
    class AActor* m_Target;                                                           // 0x02A8 (size: 0x8)
    class UEffectComponentBase* m_OwnerComponent;                                     // 0x02B0 (size: 0x8)
    bool m_IsActive;                                                                  // 0x02B8 (size: 0x1)
    FActiveGameplayEffectHandle m_VisualEffectHandle;                                 // 0x02BC (size: 0x8)
    TSubclassOf<class UGameplayEffect> m_VisualGameplayEffect;                        // 0x02C8 (size: 0x8)
    TSubclassOf<class UGameplayAbility> m_DebuffEffectGameplayAbility;                // 0x02D0 (size: 0x8)
    FGameplayAbilitySpecHandle m_DebuffEffectGameplayAbilitySpecHandle;               // 0x02D8 (size: 0x4)

    void SetIsActive(bool Value);
    void RestartEffect();
    void RemoveVisualEffect();
    void ReActivateEffect();
    void OnPrematureRemoval();
    void OnPreDestroyDebuffActor();
    void OnDieMeBefore(const FGameplayEventData GameplayEventData);
    void OnDeactivateEffectEvent_Multicast(const FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);
    void OnDeactivateEffectCompleted();
    void OnActivateEffectEvent_Multicast();
    bool HasDuration(const FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);
    class AActor* GetTarget();
    class UEffectComponentBase* GetOwnerComponent();
    bool GetIsActive();
    class UGothicAbilitySystemComponent* GetGothicAbilitySystemComponent();
    void DeactivateEffect(const FGameplayEffectRemovalInfo& FGameplayEffectRemovalInfo);
    void ClearDelegates();
    void BindDelegates();
    void ApplyVisualEffect();
    void ActivateEffect();
}; // Size: 0x2F8

class AEnvironmentLightIntensityCaptureActor : public AActor
{
    class UEnvironmentLightIntensityCaptureComponent* EnvironmentLightIntensityComponent; // 0x0290 (size: 0x8)

    class UEnvironmentLightIntensityCaptureComponent* GetCaptureComponent();
}; // Size: 0x298

class AExplosionVisual : public AActor
{
    class UGothicFXComponent* m_FXComponent;                                          // 0x0290 (size: 0x8)
    FGameplayTag m_FXTag;                                                             // 0x0298 (size: 0x8)

    void OnExplode(const FHitResult& HitResult, int32 spellLevel);
    void Multicast_OnExplode(const FHitResult& HitResult, int32 spellLevel);
}; // Size: 0x2A0

class AFloatingItemActor : public AEffectActorBase
{
    class AItemVisual* m_ItemVisual;                                                  // 0x02F8 (size: 0x8)
    class URotatingMovementComponent* m_RotatingMovementComp;                         // 0x0300 (size: 0x8)
    class URotatingMovementComponent* m_ItemVisualRotatingMovementComp;               // 0x0308 (size: 0x8)
    class USkeletalMeshComponent* m_TargetMesh;                                       // 0x0310 (size: 0x8)
    class UDataModule_Animation* m_DataModule_Animation;                              // 0x0318 (size: 0x8)

    void StopInmediate();
    void RestoreItemInHand();
    void OnStartRecoveringRune_Multicast(float totalCastingTime);
    void OnStartRecoveringRune(float totalCastingTime);
    void OnLaunchSpellOnServer_Scriptable();
    void OnLaunchSpellOnServer();
    void OnCancelSpellOnServer_Scriptable();
    void ObtainItemVisualFromCarryComponent(class AGothicCharacter* GothicCharacter);
    void MulticastCancelSpell();
    void DetachItemVisualFromOwner();
    void DeactivateItemRotatingMovement();
    void BP_RestoreItemInHand();
    void BP_CancelCastSpell();
    void AttachItemVisualToTarget(FName Name, EAttachmentRule AttachmentRule, bool bInWeldSimulatedBodies);
}; // Size: 0x320

class AFloatingRuneGameplayCueNotify_Pool : public AGameplayCueNotify_Pool
{
}; // Size: 0x330

class AFloatingRune_VFXCue : public AVFXCue
{
    class AItemVisual* m_ItemVisual;                                                  // 0x0388 (size: 0x8)
    class URotatingMovementComponent* m_RotatingMovementComp;                         // 0x0390 (size: 0x8)

    void SpawnItemVisual(class AGothicCharacter* CharacterToAttach);
    void OnStartRecoveringRune(float totalCastingTime);
}; // Size: 0x398

class AFreepointManager : public AGothicSingletonManager
{

    class AFreepointManager* GetInstance(class UObject* WorldContextObject);
}; // Size: 0x2A8

class AFreezeDebuffEffectActor : public ADebuffEffectActorByTag
{
    class UProceduralMeshComponent* m_CustomMesh;                                     // 0x02F8 (size: 0x8)

    void GenerateExtraGeometry(class UGothicSkeletalMeshComponent* Mesh);
}; // Size: 0x300

class AFreezeVisual : public AActor
{
    class UProceduralMeshComponent* m_CustomMesh;                                     // 0x0290 (size: 0x8)

    void GenerateExtraGeometry(class UGothicSkeletalMeshComponent* Mesh);
}; // Size: 0x298

class AG1RGameModeCooperative : public ACooperativeGameMode
{
    TSubclassOf<class UWorldDefinition> m_WorldDefinition;                            // 0x03D0 (size: 0x8)
    TSubclassOf<class UPlayerConfig> m_MainPlayerConfig;                              // 0x03D8 (size: 0x8)
    TArray<class TSubclassOf<UPlayerConfig>> m_SecondaryPlayerConfig;                 // 0x03E0 (size: 0x10)
    bool m_CleanSaveGame;                                                             // 0x03F0 (size: 0x1)
    bool m_CanAutosave;                                                               // 0x03F1 (size: 0x1)

}; // Size: 0x3F8

class AG1RGameState : public AGameState
{
    TArray<class AGothicSingletonManager*> m_GameplayManagers;                        // 0x0310 (size: 0x10)
    class UG1RGameQueryComponent* m_QueryComponent;                                   // 0x0320 (size: 0x8)
    TWeakObjectPtr<class AGothicWorldActor> m_GothicWorldActor;                       // 0x0328 (size: 0x8)
    class UTraderManager* m_TraderManager;                                            // 0x0330 (size: 0x8)
    TSubclassOf<class UWorldDefinition> m_WorldDefinition;                            // 0x0338 (size: 0x8)
    TArray<FName> m_DoorsOpen;                                                        // 0x0340 (size: 0x10)
    TArray<FName> m_DoorsClosed;                                                      // 0x0350 (size: 0x10)
    TArray<FName> m_GenericDataName;                                                  // 0x0360 (size: 0x10)
    TArray<float> m_GenericDataFloat;                                                 // 0x0370 (size: 0x10)
    TArray<FName> m_TempGenericDataName;                                              // 0x0380 (size: 0x10)
    TArray<float> m_TempGenericDataFloat;                                             // 0x0390 (size: 0x10)
    TMap<class FString, class TSubclassOf<UItemDefinition>> m_ItemMapClasses;         // 0x03A0 (size: 0x50)
    TMap<class FString, class TSubclassOf<UTraderConfig>> m_TraderMapClasses;         // 0x03F0 (size: 0x50)
    TMap<class FString, class TSubclassOf<UGothicLockConfig>> m_LockMapClasses;       // 0x0440 (size: 0x50)
    TMap<class FGameplayTag, class TSubclassOf<USpawnMeshes_AIAgent>> m_NpcSkelMeshesMapClasses; // 0x0490 (size: 0x50)
    TMap<class FString, class TSubclassOf<UInteractiveObjectDefinition>> m_InteractiveMapClasses; // 0x04E0 (size: 0x50)
    TArray<FGameplayTagContainer> m_MagicCircles;                                     // 0x0530 (size: 0x10)
    TArray<int32> m_TorchIds;                                                         // 0x0540 (size: 0x10)

    void Server_SetDoorOpenState(bool IsOpen, const FName& doorConfigName);
    void Server_SaveFloatData(const FName& DataName, float Data, bool isTemp);
    void Server_GiveXP(class AActor* xpInstigator, class AActor* xpObjective, const FGameplayTag& bountyType);
    void SaveWorldFloatData(const class UWorld* World, const FName& DataName, float Data);
    void SaveFloatData(const FName& DataName, float Data);
    bool IsDoorOpenWorld(const class UWorld* World, const FName& doorConfigName);
    bool IsDoorOpen(const FName& doorConfigName);
    void GlobalSaveFloatData(const class UObject* WorldContextObject, const FName& DataName, float Data);
    bool GlobalGetFloatData(const class UObject* WorldContextObject, const FName& DataName, float& Data);
    bool GetWorldFloatData(const class UWorld* World, const FName& DataName, float& Data);
    class UWorldDefinition* GetWorldDefinition(const class UWorld* World);
    int32 GetTorchId();
    bool GetFloatData(const FName& DataName, float& Data);
    TArray<class AGothicPlayerState*> GetAllPlayers();
    bool DoesDoorExist(const class UWorld* World, const FName& doorConfigName);
    bool CanDoorBeOpenedWorld(class AActor* doorActor);
    bool CanDoorBeOpened(class AActor* doorActor);
}; // Size: 0x550

class AGameplayCueNotify_Pool : public AGameplayCueNotify_Actor
{
    TSubclassOf<class AVFXCue> m_cueClass;                                            // 0x0318 (size: 0x8)
    FGameplayTag m_CancelTag;                                                         // 0x0320 (size: 0x8)

    bool HasOpenCues();
    class AVFXCue* GetOpenCueByIndex(int32 Index);
}; // Size: 0x328

class AGameplayObjectWithEditorIcon : public AActor
{
    class USceneComponent* m_SceneComponent;                                          // 0x0290 (size: 0x8)

}; // Size: 0x298

class AGlobalNavigationData : public ARecastNavMesh
{
    bool bAddConnectiveObjects;                                                       // 0x0688 (size: 0x1)
    bool bRemoveExtremEdges;                                                          // 0x0689 (size: 0x1)
    float ExtremEdgeDistanceThresholdFactor;                                          // 0x068C (size: 0x4)
    bool bRemoveLongEdges;                                                            // 0x0690 (size: 0x1)
    float LongEdgeDistanceThresholdFactor;                                            // 0x0694 (size: 0x4)
    float EdgeLongestAllowedDistance;                                                 // 0x0698 (size: 0x4)
    bool bUseConnectOnSameStoreyLevel;                                                // 0x069C (size: 0x1)
    float ConnectNodeOnStoreyRadius;                                                  // 0x06A0 (size: 0x4)
    float ConnectNodeOnStoreyHalfHeight;                                              // 0x06A4 (size: 0x4)
    bool bReconnectIslands;                                                           // 0x06A8 (size: 0x1)
    int32 WaynetEgdeCount;                                                            // 0x06AC (size: 0x4)
    int32 WaynetNodeCount;                                                            // 0x06B0 (size: 0x4)
    TSoftClassPtr<UNavigationAreaFilter> WaynetAreaFilterClass;                       // 0x06B8 (size: 0x28)
    FWaynet Waynet;                                                                   // 0x06E0 (size: 0xF0)
    bool bIsEditorCameraNavigationInvoker;                                            // 0x07D0 (size: 0x1)
    FVector2f CameraInvokerRadiusRange;                                               // 0x07D4 (size: 0x8)
    float SearchRadius;                                                               // 0x07DC (size: 0x4)
    float AStarHeuristicScale;                                                        // 0x07E0 (size: 0x4)
    float MetaRepathingRadiusFallback;                                                // 0x07EC (size: 0x4)
    float MetaDiversionPointRadius;                                                   // 0x07F0 (size: 0x4)
    FVector WaynetQueryExtent;                                                        // 0x07F8 (size: 0x18)
    bool bLoadWorldPartitionBeforeBuild;                                              // 0x0811 (size: 0x1)
    bool bMapCheckWaynetIslands;                                                      // 0x0812 (size: 0x1)
    bool bDrawAbstractWaynet;                                                         // 0x0813 (size: 0x1)
    double Height_AbstractWaynet;                                                     // 0x0818 (size: 0x8)
    double Thickness_AbstractWaynet;                                                  // 0x0820 (size: 0x8)
    FColor Color_AbstractWaynet;                                                      // 0x0828 (size: 0x4)
    bool bDrawPathWaynet;                                                             // 0x082C (size: 0x1)
    double Height_PathWaynet;                                                         // 0x0830 (size: 0x8)
    double Thickness_PathWaynet;                                                      // 0x0838 (size: 0x8)
    FColor Color_PathWaynet;                                                          // 0x0840 (size: 0x4)
    bool bVisualizeIssues;                                                            // 0x0844 (size: 0x1)
    float Height_Issues;                                                              // 0x0848 (size: 0x4)

}; // Size: 0x850

class AGlobalNavigationTestingActor : public ANavigationTestingActor
{
    EFindPathType PathfindingType;                                                    // 0x03C0 (size: 0x4)
    TSubclassOf<class UAIAgentConfig_Navigation> NavigationConfig;                    // 0x03C8 (size: 0x8)
    FGameplayTag QuerierSpeciesTag;                                                   // 0x03D0 (size: 0x8)

}; // Size: 0x3D8

class AGothicAIController : public AAIAgentController
{

    FVector TryGetValidNavLocation();
    bool IsPathfollowingPaused();
    bool IsPathfollowingComponentInitialized();
    bool IsFullyOutSideNavMesh();
    TEnumAsByte<EPathFollowingStatus::Type> GetPathfollowingStatus();
    FGothicPathfollowSettings GetMutableCurrentPathfollowSetting();
    FGothicPathfollowSettings GetCurrentPathfollowSetting();
    class UGameplayAbility_CharacterAI* GetAIAbility();
    void BP_ResumeMove();
    void BP_PauseMove();
    float BP_GetRequestedWorldSpaceZDivergeHeightTheoretically(EAdaptZDivergeMode ZDivergeMode, const FVector& AtLocation, float ZOffset);
    float BP_GetRequestedWorldSpaceZDivergeHeight();
    class AGothicCharacterState* BP_GetCharacterState();
    float BP_GetActualPossibleWorldZDivergeHeight();
}; // Size: 0x3D0

class AGothicAmbientSoundActor : public AFMODAmbientSound
{
}; // Size: 0x298

class AGothicBloodDecal : public ADecalActor
{
    class UCanvasRenderTarget2D* m_CanvasRenderTarget2D;                              // 0x0298 (size: 0x8)
    FVector M_Center;                                                                 // 0x02A8 (size: 0x18)
    FVector m_MinPoint;                                                               // 0x02C0 (size: 0x18)
    FVector m_MaxPoint;                                                               // 0x02D8 (size: 0x18)
    FBox m_Box;                                                                       // 0x02F0 (size: 0x38)
    class UMaterialInstanceDynamic* m_MaterialInstanceDynamic;                        // 0x0338 (size: 0x8)

}; // Size: 0x340

class AGothicBloodFallingDrops : public AActor
{
    class UNiagaraComponent* m_BloodParticleComponent;                                // 0x0298 (size: 0x8)
    class UNiagaraSystem* m_BloodParticles;                                           // 0x02A0 (size: 0x8)
    TArray<FVector> m_BloodDrops;                                                     // 0x02A8 (size: 0x10)
    class UMaterialInterface* m_DecalMaterial;                                        // 0x02B8 (size: 0x8)
    FVector m_PreviousLocation;                                                       // 0x02C0 (size: 0x18)

    void StartParticles(float creatureScale, FLinearColor BloodColor, float bloodAmount, class UStaticMeshComponent* MeshComponent);
    void SetDecalMaterial(class UMaterialInterface* Material);
    void SetBloodParticles(class UNiagaraSystem* bloodParticles);
    void ProcessBloodDrops();
    void DestroyActor();
    void AttachParticlesToMesh(class USkeletalMeshComponent* MeshComponent, const FName& SocketName);
}; // Size: 0x2D8

class AGothicBloodManager : public AGothicSingletonManager
{
    TArray<class AGothicBloodDecal*> m_Decals;                                        // 0x02A0 (size: 0x10)
    int32 m_MaxDecalNum;                                                              // 0x02B0 (size: 0x4)
    float m_TexScale;                                                                 // 0x02B4 (size: 0x4)

    class AGothicBloodManager* GetInstance(class UObject* WorldContextObject);
}; // Size: 0x310

class AGothicCameraManager : public APlayerCameraManager
{
    class UCameraDefinition* m_CameraConfig;                                          // 0x24B8 (size: 0x8)
    float LineOfSightProbeSize;                                                       // 0x24C0 (size: 0x4)
    float m_TimeSinceLastEnemyCheck;                                                  // 0x24EC (size: 0x4)
    float m_EnemyCheckInterval;                                                       // 0x24F0 (size: 0x4)
    int32 m_EnemiesGroundAround;                                                      // 0x24F4 (size: 0x4)
    int32 m_EnemiesFlyAround;                                                         // 0x24F8 (size: 0x4)
    bool m_TargetIsBig;                                                               // 0x24FC (size: 0x1)
    class ACharacter* m_Character;                                                    // 0x2500 (size: 0x8)
    TArray<class UGothicCameraModifier*> m_UsedModifierList;                          // 0x2508 (size: 0x10)
    TSubclassOf<class UScriptGameplayAbility> m_Spell;                                // 0x2518 (size: 0x8)
    FCameraBehaviour m_SpellCameraBehaviour;                                          // 0x2520 (size: 0x60)
    FCameraBehaviour m_CinematicCameraBehaviour;                                      // 0x2580 (size: 0x60)
    class UAbilitySystemComponent* m_AbilitySystemComponent;                          // 0x27B0 (size: 0x8)
    ECamConditions m_CurrentBehaviour;                                                // 0x27B8 (size: 0x1)
    float m_ViewPitchMinCache;                                                        // 0x27BC (size: 0x4)
    float m_ViewPitchMaxCache;                                                        // 0x27C0 (size: 0x4)

    void RefreshCameraConfig();
}; // Size: 0x27E0

class AGothicCharacter : public AClientAuthoritativeCharacter
{
    FGothicCharacterOnStanceChangedDelegate OnStanceChangedDelegate;                  // 0x06C8 (size: 0x10)
    void OnStanceChangedDelegate(EStance stance);
    FGothicCharacterOnGameplayIsReadyDynamicDelegate OnGameplayIsReadyDynamicDelegate; // 0x0700 (size: 0x10)
    void GameplayIsReadyDynamicDelegate();
    FBonesSettings m_BonesSettings;                                                   // 0x0740 (size: 0x50)
    class UWidgetComponent* CurrentDebugWidgetComp;                                   // 0x0790 (size: 0x8)
    class UNPCHealthBarComponent* m_HealthBarComponent;                               // 0x0798 (size: 0x8)
    class UHUDDisplayCombatMarkerPositionComponent* m_HUDDisplayCombatMarkerPositionComponent; // 0x07A0 (size: 0x8)
    class URagdollComponent* m_RagdollComponent;                                      // 0x07A8 (size: 0x8)
    class UCarryComponent* m_CarryComponent;                                          // 0x07B0 (size: 0x8)
    class UGothicMagicComponent* m_MagicComponent;                                    // 0x07B8 (size: 0x8)
    class UGothicTimeDilationComponent* m_TimeDilationComponent;                      // 0x07C0 (size: 0x8)
    class UGothicWaterVolumeSensor* m_GothicWaterVolumeSensor;                        // 0x07C8 (size: 0x8)
    class UWalkSpeedModifierComponent* m_WalkSpeedModifierComponent;                  // 0x07D0 (size: 0x8)
    class UCharacterPerceptionComponent* m_PerceptionComponent;                       // 0x07D8 (size: 0x8)
    class USubCapsuleManagerComponent* m_SubCapsuleManagerComponent;                  // 0x07E0 (size: 0x8)
    class UGothicFXComponent* m_FXComponent;                                          // 0x07E8 (size: 0x8)
    class UCharacterVisualsComponent* m_CharacterVisualsComponent;                    // 0x07F0 (size: 0x8)
    class UCharacterTrinketsComponent* m_CharacterTrinketsComponent;                  // 0x07F8 (size: 0x8)
    class UQuiverComponent* m_QuiverComponent;                                        // 0x0800 (size: 0x8)
    class UGothicBloodComponent* m_BloodComponent;                                    // 0x0808 (size: 0x8)
    class UGothicMaterialsComponent* m_MaterialsComponent;                            // 0x0810 (size: 0x8)
    class UFocalPointComponent* m_FocalPointComponent;                                // 0x0818 (size: 0x8)
    class UGothicWeatherComponent* m_WeatherComponent;                                // 0x0820 (size: 0x8)
    class UGothicDirtComponent* m_DirtComponent;                                      // 0x0828 (size: 0x8)
    class UGothicFootstepsDataComponent* m_FootstepsDataComponent;                    // 0x0830 (size: 0x8)
    class UDataModule_Locomotion* m_DataModule_Locomotion;                            // 0x0838 (size: 0x8)
    class UDataModule_BaseStats* m_DataModule_BaseStats;                              // 0x0840 (size: 0x8)
    class UDataModule_Targeting* m_DataModule_Targeting;                              // 0x0848 (size: 0x8)
    class AGothicMutilatedSkeletalMeshActor* m_MutilatedSkeletalMeshActor;            // 0x0850 (size: 0x8)
    class UGothicAnimationComponent* m_AnimComponent;                                 // 0x0858 (size: 0x8)
    class UGothicCinematicActorComponent* m_GothicCinematicActorComponent;            // 0x08A8 (size: 0x8)
    class UMPSyncCharacterComponent* m_SyncCharacterComponent;                        // 0x08B0 (size: 0x8)
    TArray<class UPrimitiveComponent*> m_CollisionComponents;                         // 0x0918 (size: 0x10)
    class AGothicCharacterState* m_CharacterState;                                    // 0x0938 (size: 0x8)
    class UGothicCameraSpringArmComponent* m_CameraBoom;                              // 0x0980 (size: 0x8)
    class UCameraComponent* m_FollowCamera;                                           // 0x0988 (size: 0x8)
    FName m_EyesLocationSocketName;                                                   // 0x0990 (size: 0x8)
    FName m_HeadBone;                                                                 // 0x0998 (size: 0x8)
    class UInteractiveComponent* m_InteractiveComponent;                              // 0x09B0 (size: 0x8)

    void StopAutoHideHealthBar();
    void ShowCharacter();
    void SetVisibilityCharacterAndEverythingItCarries(bool IsVisible);
    void SetDelayedCustomTimerDilatation(float CustomTime, float Duration);
    void SetCustomTimeDilation(float CustomTime);
    void SetCustomAnimGlobalRateScale(float CustomRate);
    void SetAsHiddenSpectatorCharacter(bool Enable);
    void ServerNotifyInventoryQuickItemsMayHaveBeenModified(EInventoryTypes slotType);
    void ServerDoPossess(class APawn* characterToPossess);
    void Server_StopMontage(class UAnimMontage* MontageToStop);
    void Server_SetAnimRootMotionTranslationScale(float Scale);
    void Server_PlayMontage(class UAnimMontage* MontageToPlay, float InPlayRate, EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages);
    void Server_PlayDynamicMontage(class UAnimSequenceBase* Animation, FName SlotName, float BlendInTime, float BlendOutTime, float PlayRate, float StartTime, FName SyncGroup);
    void Server_JumpToSectionMontage(FName SectionName, class UAnimMontage* MontageToPlay);
    void Server_InitializeSkills(const TArray<class TSubclassOf<UScriptGameplayEffect>>& skills);
    void Server_InitializeSavedData();
    void Server_InitializeAbilities(const class UGameplayEffect* AbilitySet);
    void Server_ApplyTagsAndEffectsSavedData();
    void SendGlobalEvent(FGameplayTag verb, FName instigatorName, FName EventName, float NewValue, bool forced, FName UserName);
    void ResetTimeDilatation();
    void RecreatePhysicsAndClothState();
    void OnResetStates();
    void OnOverlapBeginServer(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const FHitResult& SweepResult);
    void MulticastPlayUnTransformMontage(class UAnimMontage* Montage);
    void MulticastNotifyInventoryQuickItemsMayHaveBeenModified(EInventoryTypes slotType);
    void Multicast_StopMontage(class UAnimMontage* MontageToStop);
    void Multicast_SetEnableCollisions(bool Enabled);
    void Multicast_SetCustomTimerDilatation(float CustomTime, float Duration);
    void Multicast_SendGlobalEvent(FGameplayTag verb, FName instigatorName, FName EventName, float NewValue, bool forced, FName UserName);
    void Multicast_PlayMontage(class UAnimMontage* MontageToPlay, float InPlayRate, EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages, bool play_local);
    void Multicast_PlayDynamicMontage(class UAnimSequenceBase* Animation, FName SlotName, float BlendInTime, float BlendOutTime, float PlayRate, float StartTime, FName SyncGroup, bool play_local);
    void Multicast_JumpToSectionMontage(FName SectionName, class UAnimMontage* MontageToPlay, bool play_local);
    void MakeRideable();
    bool IsPlayerCharacterOrPlayerControlled();
    bool IsPlayerCharacter();
    bool IsNPCCharacter();
    bool IsDefeated();
    bool IsDead();
    bool HasGameplayTag(const FGameplayTag& Tag);
    bool HasAnyGameplayTags(const FGameplayTagContainer& TagContainer);
    bool HasAllGameplayTags(const FGameplayTagContainer& TagContainer);
    bool HasAbility(TSubclassOf<class UGameplayAbility> AbilityClass);
    class UGothicWeatherComponent* GetWeatherComponent();
    class UWalkSpeedModifierComponent* GetWalkSpeedModifierComponent();
    class UCueVisualConfig* GetVisualDebuffConfig(FGameplayTag DebuffTag);
    class USubCapsuleManagerComponent* GetSubCapsuleManagerComponent();
    class UGothicRiderComponent* GetRiderComponent();
    class UCharacterRelationshipComponent* GetRelationship();
    class UQuiverComponent* GetQuiverComponent();
    class UCharacterPerceptionComponent* GetPerception();
    FNavAgentProperties GetNavAgentPropertiesRef();
    class UGothicMountComponent* GetMountComponent();
    class UGothicMagicComponent* GetMagicComponent();
    int32 GetMagicCircleIndexFrom(const FGameplayTag& GameplayTag);
    class UInventoryComponent* GetInventory();
    class UNPCHealthBarComponent* GetHealthBarComponent();
    class UGothicMovementComponent* GetGothicMovementComponent();
    class UGothicMaterialsComponent* GetGothicMaterialsComponent();
    class UGothicBloodComponent* GetGothicBloodComponent();
    class UGothicFXComponent* GetFXComponent();
    class UFocalPointComponent* GetFocalPointComponent();
    FVector GetFeetLocation();
    float GetEyesToCenterOffsetXY();
    FName GetEyesSocketName();
    FVector GetEyesLocation();
    float GetEyesHeightFromFeet();
    float GetEyesHeight();
    float GetDistanceToHitCollision(const FVector& Point);
    class UDataModule_Targeting* GetDataModule_Targeting();
    TArray<class UPrimitiveComponent*> GetCollisionComponents();
    class UCharacterVisualsComponent* GetCharacterVisualsComponent();
    FName GetCharacterUniqueName();
    FGameplayTag GetCharacterMagicCircleTag();
    int32 GetCharacterMagicCircleLevelFromAttr();
    FName GetCharacterGlobalId();
    FText GetCharacterDisplayName();
    class UCharacterDefinition* GetCharacterDefinition();
    class UCarryComponent* GetCarryComponent();
    class UGothicAnimationComponent* GetAnimationComponent();
    class UAbilitySystemComponent* GetAbilitySystemComponent();
    void ClientTeleportTo(const FVector& DestLocation, const FRotator& DestRotation, bool bIsATest, bool bNoCheck);
    void ClientSetSpellToCamera(const FCameraBehaviour& CameraBehaviour);
    void Client_AttachToComponent(class USceneComponent* Parent, EAttachmentRule AttachmentRule, bool weldSimulatedBodies, FName SocketName);
    bool CanCastSpell(const FGameplayTag& spellTag);
    void BP_OnOverlapWater(const FHitResult& HitResult);
    bool BP_IsGameplayReady();
    class AGothicCharacterState* BP_GetCharacterState();
    void ActiveFreezeFrame(float CustomTime, float FreezeDuration, float BlendOutDuration);
}; // Size: 0x9C0

class AGothicCharacterState : public APlayerState
{
    TSubclassOf<class UGothicCharacterPersonality> m_CurrentPersonality;              // 0x0368 (size: 0x8)
    bool bPersistent;                                                                 // 0x0370 (size: 0x1)
    class UGothicAbilitySystemComponent* AbilitySystemComponent;                      // 0x0378 (size: 0x8)
    class UDataModuleComponent* DataModuleComponent;                                  // 0x0380 (size: 0x8)
    class ULongTermMemoryComponent* LongTermMemoryComponent;                          // 0x0388 (size: 0x8)
    class UCharacterRelationshipComponent* CharacterRelationshipComponent;            // 0x0390 (size: 0x8)
    class UPersonalBelongingsComponent* PersonalBelongingsComponent;                  // 0x0398 (size: 0x8)
    class UPreferredLocationComponent* PreferredLocationComponent;                    // 0x03A0 (size: 0x8)
    class UGenericVoicelineComponent* GenericVoicelineComponent;                      // 0x03A8 (size: 0x8)
    class URegionCharacterComponent* RegionComponent;                                 // 0x03B0 (size: 0x8)
    class UGothicNavigationInvokerComponent* GothicNavigationInvokerComponent;        // 0x03B8 (size: 0x8)
    class UInventoryComponent* InventoryComponent;                                    // 0x03C0 (size: 0x8)
    class UInteractorComponent* InteractorComponent;                                  // 0x03C8 (size: 0x8)
    class UCharacterConfig* CharacterConfig;                                          // 0x03D0 (size: 0x8)
    FMassEntityConfig MassEntityConfig;                                               // 0x03D8 (size: 0x30)
    FString m_PartyConfigId;                                                          // 0x0410 (size: 0x10)
    int32 m_PartySlotIndex;                                                           // 0x0420 (size: 0x4)
    class AGothicCharacter* OwnedCharacter;                                           // 0x0428 (size: 0x8)
    FName CharacterGlobalId;                                                          // 0x0430 (size: 0x8)
    TSet<AGothicCharacterState*> InPartyWith;                                         // 0x0438 (size: 0x50)

    class AGothicCharacterState* TryGetCharacterStateFromActor(const class AActor* Actor);
    void SetTrueGuild(TSubclassOf<class UGameplayEffect_Guild> GuildEffectClass);
    void SetPersistent(bool Value);
    void SetCurrentPersonality(const TSubclassOf<class UGothicCharacterPersonality> personality);
    void SetCharacterTransform(const FTransform& Transform);
    void SetCharacterRotation(const FRotator& Rotation);
    void SetCharacterLocationAndDirection(const FVector& Location, const FVector& Forward);
    void SetCharacterLocation(const FVector& Location);
    FName MakeCharacterGlobalId(const class UObject* WorldContextObject, FName CharacterUniqueName, FString SpawnedBy, int32 SpawnIndex, const FVector& Location);
    void LeavePartyOf(class AGothicCharacterState* Other);
    void LearnRecipe(TSubclassOf<class UItemRecipeDefinition> RecipeDefinition);
    void JoinPartyOf(class AGothicCharacterState* Other);
    bool IsTrulyPartOfGuild(const FGameplayTag& GuildTag);
    bool IsPersistent();
    bool IsOfSpecies(const FGameplayTag& SpeciesTag);
    bool IsInPartyWith(const class AGothicCharacterState* Other);
    bool IsInFullyLoadedRegion(float Radius);
    bool IsDefeated();
    bool IsDead();
    bool IsCharacterVisible();
    bool IsApparentlyPartOfGuild(const FGameplayTag& GuildTag);
    bool HasLearnedRecipe(TSubclassOf<class UItemRecipeDefinition> RecipeDefinition);
    bool HasEverLeftArea(FGameplayTag Area);
    bool HasEverEnteredArea(FGameplayTag Area);
    void HandlePawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
    class UGenericVoicelineComponent* GetVoiceline();
    FGameplayTag GetSpecies();
    class UCharacterRelationshipComponent* GetRelationship();
    class URegionCharacterComponent* GetRegionTraits();
    class UPreferredLocationComponent* GetPreferredLocation();
    class UGothicCharacterPersonality* GetPersonality();
    class ULongTermMemoryComponent* GetLongTermMemory();
    FGameplayTag GetLastEnteredArea();
    class UInventoryComponent* GetInventory();
    class AGothicCharacter* GetInstigatorCharacter();
    FGameplayTag GetGuild();
    FGothicPathfollowSettings GetDefaultPathfollowingSetting();
    TSubclassOf<class UInteractiveObjectDefinition> GetDefaultInteraction();
    FGameplayTag GetDefaultFacialExpression();
    TSubclassOf<class UGothicCharacterPersonality> GetCurrentPersonality();
    FName GetCharacterUniqueName();
    FTransform GetCharacterTransform();
    FRotator GetCharacterRotation();
    float GetCharacterRadius();
    FVector GetCharacterLookingDirection();
    FVector GetCharacterLocation();
    float GetCharacterHalfHeight();
    FName GetCharacterGlobalId();
    class AGothicCharacter* GetCharacterEvenDuringInit();
    FText GetCharacterDisplayName();
    class UCharacterDefinition* GetCharacterDefinition();
    class AGothicCharacter* GetCharacter();
    FGameplayTag GetAreaTagOfLocation();
    FVector GetApproximateNavAgentLocation();
    FVector GetApproximateFeetLocation();
    TArray<class TSubclassOf<UItemRecipeDefinition>> GetAllKnownRecipes();
    FGameplayTagContainer GetAllAreaTagsOfLocation();
    class AGothicCharacterState* FindClosestByUniqueName(const class UObject* WorldContextObject, FName UniqueName, const FVector& Location);
    class AGothicCharacterState* FindByUniqueName(const class UObject* WorldContextObject, FName UniqueName);
    class AGothicCharacterState* FindByGlobalId(const class UObject* WorldContextObject, FName GlobalId);
    TArray<class AGothicCharacterState*> FindAllInRadiusAroundWithTags(const class UObject* WorldContextObject, const FVector& Location, float Radius, const FGameplayTagContainer& WithAnyOf, const FGameplayTagContainer& WithoutAnyOf);
    TArray<class AGothicCharacterState*> FindAllInRadiusAround(const class UObject* WorldContextObject, const FVector& Location, float Radius);
    TArray<class AGothicCharacterState*> FindAllByUniqueName(const class UObject* WorldContextObject, FName UniqueName);
}; // Size: 0x4A0

class AGothicDirectionalLight : public AActor
{
    bool m_UpdateWithGameTime;                                                        // 0x0291 (size: 0x1)
    float m_DawnHour;                                                                 // 0x0294 (size: 0x4)
    FVector m_DawnRotation;                                                           // 0x0298 (size: 0x18)
    EWeather m_CurrentLightPreset;                                                    // 0x02B0 (size: 0x1)
    TMap<class EWeather, class FLightPreset> m_LightPresets;                          // 0x02B8 (size: 0x50)
    TMap<class EWeather, class FLightPreset> m_FogPresets;                            // 0x0308 (size: 0x50)
    class UDirectionalLightComponent* m_NightDirectionalLightComponent;               // 0x0368 (size: 0x8)
    class UDirectionalLightComponent* m_DayDirectionalLightComponent;                 // 0x0370 (size: 0x8)
    class UStaticMeshComponent* M_Moon;                                               // 0x0378 (size: 0x8)
    TSoftObjectPtr<AExponentialHeightFog> m_ExponentialHeightFog;                     // 0x0380 (size: 0x28)
    class UArrowComponent* m_DayArrowComponent;                                       // 0x03A8 (size: 0x8)
    class UArrowComponent* m_NightArrowComponent;                                     // 0x03B0 (size: 0x8)

}; // Size: 0x3B8

class AGothicDiveAIController : public AGothicAIController
{
}; // Size: 0x3D0

class AGothicFlyAIController : public AGothicAIController
{
}; // Size: 0x3D0

class AGothicFootstepsTrackerActor : public AActor
{
    class UPhysicMaterialsColor* PhysicMaterialsColor;                                // 0x0290 (size: 0x8)
    class UMaterialInterface* DecalMaterial;                                          // 0x0298 (size: 0x8)
    float DecalSizeFactor;                                                            // 0x02A0 (size: 0x4)
    float DecalLifetime;                                                              // 0x02A4 (size: 0x4)
    TArray<class UDecalComponent*> Decals;                                            // 0x02A8 (size: 0x10)
    int32 MaxFeetTracking;                                                            // 0x02B8 (size: 0x4)
    float DetectionRadius;                                                            // 0x02BC (size: 0x4)
    class APlayerController* PlayerController;                                        // 0x02C0 (size: 0x8)
    TMap<class AGothicCharacter*, class USkeletalTracker*> TrackedCharactersData;     // 0x02C8 (size: 0x50)

}; // Size: 0x318

class AGothicGASActor : public AActor
{
    class UGothicAbilitySystemComponent* AbilitySystem;                               // 0x0298 (size: 0x8)
    class UGothicFXComponent* m_FXComponent;                                          // 0x02A0 (size: 0x8)

    void StopEffect(const FGameplayTag& EffectTag);
    void PlayEffect(const FGameplayTag& EffectTag);
    void NotifyEnvironmentDebuffToInteractableGasObjectActor_Scriptable(class UAbilitySystemComponent* InteractiveActorAbilitySystemComponent);
    class UGothicFXComponent* GetFXComponent();
    TArray<class TSubclassOf<UGameplayEffect>> GetDebuffGameplayEffectsToApplyWhenOverlap_Scriptable();
}; // Size: 0x2A8

class AGothicGCNotify_Actor : public AGameplayCueNotify_Actor
{

    bool HasExecutedOnRemove();
    class UCueVisualConfig* GetCueVisualConfig(class AActor* MyTarget);
}; // Size: 0x300

class AGothicGameMode : public AGameMode
{
    TSubclassOf<class UGameStory> MainStoryClass;                                     // 0x0370 (size: 0x8)
    TSubclassOf<class UDifficultyPreset> DifficultyPresetOverride;                    // 0x0378 (size: 0x8)

}; // Size: 0x380

class AGothicHUDBase : public AHUD
{
    TMap<class TSoftClassPtr<UHUDControllerBase>, class UHUDControllerBase*> m_Controllers; // 0x0380 (size: 0x50)
    class UGothicHUDConfiguration* m_HUDConfiguration;                                // 0x03D0 (size: 0x8)
    class UUserWidget* m_FocusWidget;                                                 // 0x03D8 (size: 0x8)
    TArray<class UUserWidget*> m_FocusWidgets;                                        // 0x03E0 (size: 0x10)
    FVector2D m_LastMousePos;                                                         // 0x03F0 (size: 0x10)
    bool m_bMousePositionWasManuallySetLastFrame;                                     // 0x0400 (size: 0x1)
    bool m_IfIsFirstFrame;                                                            // 0x0401 (size: 0x1)
    class UHUDVisibilityStateManagerSubsystem* m_HUDSubsystem;                        // 0x0418 (size: 0x8)

    void SetFocusWidget(class UUserWidget* Widget);
    void PushFocusWidget(class UUserWidget* Widget);
    class UUserWidget* PopFocusWidget();
    void OnMousePositionSet(int32 MouseX, int32 MouseY);
    void LoadConfiguration();
    class UUserWidget* GetFocusWidget();
    void EndPlay(const TEnumAsByte<EEndPlayReason::Type> EndPlayReason);
    void DrawHUD();
}; // Size: 0x420

class AGothicInvokerActor : public AActor
{
    class UGothicNavigationInvokerComponent* GothicNavigationInvokerComponent;        // 0x0290 (size: 0x8)
    class UAIAgentConfig_Navigation* NavigationConfigDefaultObject;                   // 0x0298 (size: 0x8)

    bool HasFinishedNavMeshGeneration();
    class AGothicInvokerActor* CreateInvokerActor(const class UObject* WorldContext, const FVector& SpawnLocation, const class USpawnAIAgentDefinition* AIAgentSpawnDefinition, float InCustomInvokerGenerationRadius, bool bInOnlyUsedPreferredNavType);
}; // Size: 0x2A8

class AGothicLockPickActor : public ASkeletalMeshActor
{
    class ULockPickAnimInstance* m_LockPickAnimInstance;                              // 0x0358 (size: 0x8)

    void OnStopTickingTimerFired();
}; // Size: 0x368

class AGothicLockPieceActor : public AStaticMeshActor
{
    EGothicLockPieceType m_LockPieceType;                                             // 0x02A0 (size: 0x1)
    int32 m_PieceId;                                                                  // 0x02A4 (size: 0x4)
    bool m_CanEverBeHighlighted;                                                      // 0x02A8 (size: 0x1)
    bool m_CanEverShake;                                                              // 0x02A9 (size: 0x1)
    class UMaterialInstanceDynamic* m_MaterialInstanceDynamic;                        // 0x02B0 (size: 0x8)
    class USceneComponent* m_RuntimeRootComponent;                                    // 0x0320 (size: 0x8)

}; // Size: 0x330

class AGothicLockSceneActor : public AInfo
{
    float m_LockPieceInterpolationSpeed;                                              // 0x0290 (size: 0x4)
    bool m_UseConstantInterpolationSpeed;                                             // 0x0294 (size: 0x1)
    float m_LockBarDownOffset;                                                        // 0x0298 (size: 0x4)
    float m_LockBarUpOffset;                                                          // 0x029C (size: 0x4)
    float m_BarDistanceThresholdForInterpolation;                                     // 0x02A0 (size: 0x4)
    TMap<int32, float> m_RotationToBarOffset;                                         // 0x02A8 (size: 0x50)
    float m_LockPieceTranslationStep;                                                 // 0x02F8 (size: 0x4)
    TArray<FGothicLockPieceData> m_LockPieceData;                                     // 0x0300 (size: 0x10)
    class UCurveFloat* m_LatchCurve;                                                  // 0x0318 (size: 0x8)
    FLinearColor m_HighlightColor;                                                    // 0x0328 (size: 0x10)
    class UGothicLockCameraHelperComponent* m_CameraHelper;                           // 0x0338 (size: 0x8)
    class AGothicLockPickActor* m_LockPickActor;                                      // 0x0340 (size: 0x8)
    float m_ShakeSpeed;                                                               // 0x0348 (size: 0x4)
    float m_ShakeDuration;                                                            // 0x034C (size: 0x4)
    float m_ShakeAmplitude;                                                           // 0x0350 (size: 0x4)

    void UpdateMPC();
    void SetSceneVisible(bool IsVisible);
}; // Size: 0x358

class AGothicLockedStreamingSourceActor : public AActor
{
    TArray<FName> AffectedGrids;                                                      // 0x0290 (size: 0x10)
    bool bShouldBlockOnSlowLoading;                                                   // 0x02A0 (size: 0x1)
    class USphereComponent* DefaultStreamingSource;                                   // 0x02A8 (size: 0x8)
    class USphereComponent* OuterShapeComponent;                                      // 0x02B0 (size: 0x8)

}; // Size: 0x2B8

class AGothicMutilatedSkeletalMeshActor : public AActor
{
    class USkeletalMeshComponent* m_SkeletalMeshComponent;                            // 0x0290 (size: 0x8)
    class UStaticMeshComponent* m_StaticMeshComponent;                                // 0x0298 (size: 0x8)
    class USkeletalMeshComponent* m_Source;                                           // 0x02A0 (size: 0x8)
    FName m_BoneToCut;                                                                // 0x02A8 (size: 0x8)
    FVector m_LastPosition;                                                           // 0x02B8 (size: 0x18)

}; // Size: 0x2D0

class AGothicNPCState : public AGothicCharacterState
{
    class UAIState_DailyRoutine* DailyRoutineTemplate;                                // 0x04A0 (size: 0x8)
    class UAIState_DailyRoutine* DailyRoutineTemplateAtSpawn;                         // 0x04A8 (size: 0x8)
    FInGameTime DailyRoutineAssignedAtTime;                                           // 0x04B0 (size: 0x8)
    FVector DailyRoutineStartedAtLocation;                                            // 0x04B8 (size: 0x18)
    class UDailyRoutineSimulationComponent* DailyRoutineSimulation;                   // 0x04D0 (size: 0x8)
    class UGameplayAbility_CharacterAI* AIAbility;                                    // 0x04D8 (size: 0x8)
    FCharacterSignificanceSettings SpawningSettings;                                  // 0x04E0 (size: 0x14)
    FGothicNPCStateOnCharacterSpawned OnCharacterSpawned;                             // 0x04F8 (size: 0x10)
    void GothicCharacterStateCharacterVisualsSpawned(class AGothicNPCState* CharacterState, class AGothicCharacter* Character);
    FGothicNPCStateOnCharacterDestroyed OnCharacterDestroyed;                         // 0x0508 (size: 0x10)
    void GothicCharacterStateCharacterVisualsDestroyed(class AGothicNPCState* CharacterState);
    TSoftClassPtr<AGothicCharacter> VisualCharacterClass;                             // 0x0518 (size: 0x28)
    ENPCSpawnState SpawnState;                                                        // 0x0550 (size: 0x1)
    class UCustomizableObjectInstance* VisualCustomizableObjectInstance;              // 0x0558 (size: 0x8)
    float ForcedSignificanceOverride;                                                 // 0x0564 (size: 0x4)
    bool bRemovedFromWorld;                                                           // 0x0590 (size: 0x1)
