#ifndef UE4SS_SDK_GeometryScriptingCore_HPP
#define UE4SS_SDK_GeometryScriptingCore_HPP

#include "GeometryScriptingCore_enums.hpp"

struct FComputeNegativeSpaceOptions
{
    ENegativeSpaceSampleMethod SampleMethod;                                          // 0x0000 (size: 0x1)
    bool bRequireSearchSampleCoverage;                                                // 0x0001 (size: 0x1)
    bool bOnlyConnectedToHull;                                                        // 0x0002 (size: 0x1)
    int32 MaxVoxelsPerDim;                                                            // 0x0004 (size: 0x4)
    int32 TargetNumSamples;                                                           // 0x0008 (size: 0x4)
    double MinSampleSpacing;                                                          // 0x0010 (size: 0x8)
    double NegativeSpaceTolerance;                                                    // 0x0018 (size: 0x8)
    double MinRadius;                                                                 // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FGeometryScript3DGridParameters
{
    EGeometryScriptGridSizingMethod SizeMethod;                                       // 0x0000 (size: 0x1)
    float GridCellSize;                                                               // 0x0004 (size: 0x4)
    int32 GridResolution;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGeometryScriptAppendMeshOptions
{
    EGeometryScriptCombineAttributesMode CombineMode;                                 // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FGeometryScriptBakeOutputType
{
    EGeometryScriptBakeOutputMode OutputMode;                                         // 0x0000 (size: 0x1)
    FGeometryScriptBakeTypeOptions RGBA;                                              // 0x0008 (size: 0x18)
    FGeometryScriptBakeTypeOptions R;                                                 // 0x0020 (size: 0x18)
    FGeometryScriptBakeTypeOptions G;                                                 // 0x0038 (size: 0x18)
    FGeometryScriptBakeTypeOptions B;                                                 // 0x0050 (size: 0x18)
    FGeometryScriptBakeTypeOptions A;                                                 // 0x0068 (size: 0x18)

}; // Size: 0x80

struct FGeometryScriptBakeRenderCaptureOptions
{
    TArray<FGeometryScriptRenderCaptureCamera> Cameras;                               // 0x0000 (size: 0x10)
    EGeometryScriptBakeResolution RenderCaptureResolution;                            // 0x0010 (size: 0x1)
    double FieldOfViewDegrees;                                                        // 0x0018 (size: 0x8)
    double NearPlaneDist;                                                             // 0x0020 (size: 0x8)
    EGeometryScriptBakeResolution Resolution;                                         // 0x0028 (size: 0x1)
    EGeometryScriptBakeSamplesPerPixel SamplesPerPixel;                               // 0x0029 (size: 0x1)
    bool bRenderCaptureAntiAliasing;                                                  // 0x002A (size: 0x1)
    float CleanupTolerance;                                                           // 0x002C (size: 0x4)
    bool bBaseColorMap;                                                               // 0x0030 (size: 0x1)
    bool bNormalMap;                                                                  // 0x0031 (size: 0x1)
    bool bPackedMRSMap;                                                               // 0x0032 (size: 0x1)
    bool bMetallicMap;                                                                // 0x0033 (size: 0x1)
    bool bRoughnessMap;                                                               // 0x0034 (size: 0x1)
    bool bSpecularMap;                                                                // 0x0035 (size: 0x1)
    bool bEmissiveMap;                                                                // 0x0036 (size: 0x1)
    bool bOpacityMap;                                                                 // 0x0037 (size: 0x1)
    bool bSubsurfaceColorMap;                                                         // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FGeometryScriptBakeSourceMeshOptions
{
    class UTexture2D* SourceNormalMap;                                                // 0x0000 (size: 0x8)
    int32 SourceNormalUVLayer;                                                        // 0x0008 (size: 0x4)
    EGeometryScriptBakeNormalSpace SourceNormalSpace;                                 // 0x000C (size: 0x1)

}; // Size: 0x10

struct FGeometryScriptBakeTargetMeshOptions
{
    int32 TargetUVLayer;                                                              // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FGeometryScriptBakeTextureOptions
{
    EGeometryScriptBakeResolution Resolution;                                         // 0x0000 (size: 0x1)
    EGeometryScriptBakeBitDepth BitDepth;                                             // 0x0001 (size: 0x1)
    EGeometryScriptBakeSamplesPerPixel SamplesPerPixel;                               // 0x0002 (size: 0x1)
    class UTexture2D* SampleFilterMask;                                               // 0x0008 (size: 0x8)
    EGeometryScriptBakeFilteringType FilteringType;                                   // 0x0010 (size: 0x1)
    float ProjectionDistance;                                                         // 0x0014 (size: 0x4)
    bool bProjectionInWorldSpace;                                                     // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FGeometryScriptBakeTypeOptions
{
    EGeometryScriptBakeTypes BakeType;                                                // 0x0000 (size: 0x1)

}; // Size: 0x18

struct FGeometryScriptBakeVertexOptions
{
    bool bSplitAtNormalSeams;                                                         // 0x0000 (size: 0x1)
    bool bSplitAtUVSeams;                                                             // 0x0001 (size: 0x1)
    float ProjectionDistance;                                                         // 0x0004 (size: 0x4)
    bool bProjectionInWorldSpace;                                                     // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FGeometryScriptBendWarpOptions
{
    bool bSymmetricExtents;                                                           // 0x0000 (size: 0x1)
    float LowerExtent;                                                                // 0x0004 (size: 0x4)
    bool bBidirectional;                                                              // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FGeometryScriptBlurMeshVertexColorsOptions
{
    bool Red;                                                                         // 0x0000 (size: 0x1)
    bool Green;                                                                       // 0x0001 (size: 0x1)
    bool Blue;                                                                        // 0x0002 (size: 0x1)
    bool Alpha;                                                                       // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FGeometryScriptBoneInfo
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    FName Name;                                                                       // 0x0004 (size: 0x8)
    int32 ParentIndex;                                                                // 0x000C (size: 0x4)
    FTransform LocalTransform;                                                        // 0x0010 (size: 0x60)
    FTransform WorldTransform;                                                        // 0x0070 (size: 0x60)
    FLinearColor Color;                                                               // 0x00D0 (size: 0x10)

}; // Size: 0xE0

struct FGeometryScriptBoneWeight
{
    int32 BoneIndex;                                                                  // 0x0000 (size: 0x4)
    float Weight;                                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGeometryScriptBoneWeightProfile
{
    FName ProfileName;                                                                // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FGeometryScriptCalculateNormalsOptions
{
    bool bAngleWeighted;                                                              // 0x0000 (size: 0x1)
    bool bAreaWeighted;                                                               // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FGeometryScriptCollisionFromMeshOptions
{
    bool bEmitTransaction;                                                            // 0x0000 (size: 0x1)
    EGeometryScriptCollisionGenerationMethod Method;                                  // 0x0001 (size: 0x1)
    bool bAutoDetectSpheres;                                                          // 0x0002 (size: 0x1)
    bool bAutoDetectBoxes;                                                            // 0x0003 (size: 0x1)
    bool bAutoDetectCapsules;                                                         // 0x0004 (size: 0x1)
    float MinThickness;                                                               // 0x0008 (size: 0x4)
    bool bSimplifyHulls;                                                              // 0x000C (size: 0x1)
    int32 ConvexHullTargetFaceCount;                                                  // 0x0010 (size: 0x4)
    int32 MaxConvexHullsPerMesh;                                                      // 0x0014 (size: 0x4)
    float ConvexDecompositionSearchFactor;                                            // 0x0018 (size: 0x4)
    float ConvexDecompositionErrorTolerance;                                          // 0x001C (size: 0x4)
    float ConvexDecompositionMinPartThickness;                                        // 0x0020 (size: 0x4)
    float SweptHullSimplifyTolerance;                                                 // 0x0024 (size: 0x4)
    EGeometryScriptSweptHullAxis SweptHullAxis;                                       // 0x0028 (size: 0x1)
    bool bRemoveFullyContainedShapes;                                                 // 0x0029 (size: 0x1)
    int32 MaxShapeCount;                                                              // 0x002C (size: 0x4)

}; // Size: 0x30

struct FGeometryScriptColorFlags
{
    bool bRed;                                                                        // 0x0000 (size: 0x1)
    bool bGreen;                                                                      // 0x0001 (size: 0x1)
    bool bBlue;                                                                       // 0x0002 (size: 0x1)
    bool bAlpha;                                                                      // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FGeometryScriptColorList
{
}; // Size: 0x10

struct FGeometryScriptConstrainedDelaunayTriangulationOptions
{
    EGeometryScriptPolygonFillMode ConstrainedEdgesFillMode;                          // 0x0000 (size: 0x1)
    bool bValidateEdgesInResult;                                                      // 0x0001 (size: 0x1)
    bool bRemoveDuplicateVertices;                                                    // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FGeometryScriptConvexDecompositionOptions
{
    int32 NumHulls;                                                                   // 0x0000 (size: 0x4)
    double SearchFactor;                                                              // 0x0008 (size: 0x8)
    double ErrorTolerance;                                                            // 0x0010 (size: 0x8)
    double MinPartThickness;                                                          // 0x0018 (size: 0x8)
    int32 SimplifyToFaceCount;                                                        // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FGeometryScriptConvexHullApproximationOptions
{
    bool bFitSpheres;                                                                 // 0x0000 (size: 0x1)
    bool bFitBoxes;                                                                   // 0x0001 (size: 0x1)
    float DistanceThreshold;                                                          // 0x0004 (size: 0x4)
    float VolumeDiffThreshold_Fraction;                                               // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGeometryScriptConvexHullOptions
{
    bool bPrefilterVertices;                                                          // 0x0000 (size: 0x1)
    int32 PrefilterGridResolution;                                                    // 0x0004 (size: 0x4)
    int32 SimplifyToFaceCount;                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGeometryScriptConvexHullSimplificationOptions
{
    EGeometryScriptConvexHullSimplifyMethod SimplificationMethod;                     // 0x0000 (size: 0x1)
    float SimplificationDistanceThreshold;                                            // 0x0004 (size: 0x4)
    float SimplificationAngleThreshold;                                               // 0x0008 (size: 0x4)
    int32 MinTargetFaceCount;                                                         // 0x000C (size: 0x4)

}; // Size: 0x10

struct FGeometryScriptCopyMeshFromAssetOptions
{
    bool bApplyBuildSettings;                                                         // 0x0000 (size: 0x1)
    bool bRequestTangents;                                                            // 0x0001 (size: 0x1)
    bool bIgnoreRemoveDegenerates;                                                    // 0x0002 (size: 0x1)
    bool bUseBuildScale;                                                              // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FGeometryScriptCopyMeshFromComponentOptions
{
    bool bWantNormals;                                                                // 0x0000 (size: 0x1)
    bool bWantTangents;                                                               // 0x0001 (size: 0x1)
    bool bWantInstanceColors;                                                         // 0x0002 (size: 0x1)
    FGeometryScriptMeshReadLOD RequestedLOD;                                          // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FGeometryScriptCopyMeshToAssetOptions
{
    bool bEnableRecomputeNormals;                                                     // 0x0000 (size: 0x1)
    bool bEnableRecomputeTangents;                                                    // 0x0001 (size: 0x1)
    bool bEnableRemoveDegenerates;                                                    // 0x0002 (size: 0x1)
    bool bUseBuildScale;                                                              // 0x0003 (size: 0x1)
    bool bReplaceMaterials;                                                           // 0x0004 (size: 0x1)
    TArray<class UMaterialInterface*> NewMaterials;                                   // 0x0008 (size: 0x10)
    TArray<FName> NewMaterialSlotNames;                                               // 0x0018 (size: 0x10)
    bool bApplyNaniteSettings;                                                        // 0x0028 (size: 0x1)
    FGeometryScriptNaniteOptions NaniteSettings;                                      // 0x002C (size: 0xC)
    FMeshNaniteSettings NewNaniteSettings;                                            // 0x0038 (size: 0x40)
    bool bEmitTransaction;                                                            // 0x0078 (size: 0x1)
    bool bDeferMeshPostEditChange;                                                    // 0x0079 (size: 0x1)

}; // Size: 0x80

struct FGeometryScriptDebugMessage
{
    EGeometryScriptDebugMessageType MessageType;                                      // 0x0000 (size: 0x1)
    EGeometryScriptErrorType ErrorType;                                               // 0x0001 (size: 0x1)
    FText Message;                                                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FGeometryScriptDegenerateTriangleOptions
{
    EGeometryScriptRepairMeshMode Mode;                                               // 0x0000 (size: 0x1)
    double MinTriangleArea;                                                           // 0x0008 (size: 0x8)
    double MinEdgeLength;                                                             // 0x0010 (size: 0x8)
    bool bCompactOnCompletion;                                                        // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FGeometryScriptDetermineMeshOcclusionOptions
{
    double SamplingDensity;                                                           // 0x0000 (size: 0x8)
    bool bDoubleSided;                                                                // 0x0008 (size: 0x1)
    int32 NumSearchDirections;                                                        // 0x000C (size: 0x4)

}; // Size: 0x10

struct FGeometryScriptDisplaceFromTextureOptions
{
    float Magnitude;                                                                  // 0x0000 (size: 0x4)
    FVector2D UVScale;                                                                // 0x0008 (size: 0x10)
    FVector2D UVOffset;                                                               // 0x0018 (size: 0x10)
    float Center;                                                                     // 0x0028 (size: 0x4)
    int32 ImageChannel;                                                               // 0x002C (size: 0x4)
    EGeometryScriptEmptySelectionBehavior EmptyBehavior;                              // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FGeometryScriptDynamicMeshBVH
{
}; // Size: 0x20

struct FGeometryScriptExpMapUVOptions
{
    int32 NormalSmoothingRounds;                                                      // 0x0000 (size: 0x4)
    float NormalSmoothingAlpha;                                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGeometryScriptFillHolesOptions
{
    EGeometryScriptFillHolesMethod FillMethod;                                        // 0x0000 (size: 0x1)
    bool bDeleteIsolatedTriangles;                                                    // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FGeometryScriptFlareWarpOptions
{
    bool bSymmetricExtents;                                                           // 0x0000 (size: 0x1)
    float LowerExtent;                                                                // 0x0004 (size: 0x4)
    EGeometryScriptFlareType FlareType;                                               // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FGeometryScriptGeneralPolygonList
{
}; // Size: 0x10

struct FGeometryScriptGroupLayer
{
    bool bDefaultLayer;                                                               // 0x0000 (size: 0x1)
    int32 ExtendedLayerIndex;                                                         // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGeometryScriptIndexList
{
    EGeometryScriptIndexType IndexType;                                               // 0x0000 (size: 0x1)

}; // Size: 0x18

struct FGeometryScriptIsSameMeshOptions
{
    bool bCheckConnectivity;                                                          // 0x0000 (size: 0x1)
    bool bCheckEdgeIDs;                                                               // 0x0001 (size: 0x1)
    bool bCheckNormals;                                                               // 0x0002 (size: 0x1)
    bool bCheckColors;                                                                // 0x0003 (size: 0x1)
    bool bCheckUVs;                                                                   // 0x0004 (size: 0x1)
    bool bCheckGroups;                                                                // 0x0005 (size: 0x1)
    bool bCheckAttributes;                                                            // 0x0006 (size: 0x1)
    float Epsilon;                                                                    // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGeometryScriptIterativeMeshSmoothingOptions
{
    int32 NumIterations;                                                              // 0x0000 (size: 0x4)
    float Alpha;                                                                      // 0x0004 (size: 0x4)
    EGeometryScriptEmptySelectionBehavior EmptyBehavior;                              // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FGeometryScriptMathWarpOptions
{
    float Magnitude;                                                                  // 0x0000 (size: 0x4)
    float Frequency;                                                                  // 0x0004 (size: 0x4)
    float FrequencyShift;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGeometryScriptMeasureMeshDistanceOptions
{
    bool bSymmetric;                                                                  // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FGeometryScriptMergeSimpleCollisionOptions
{
    int32 MaxShapeCount;                                                              // 0x0000 (size: 0x4)
    double ErrorTolerance;                                                            // 0x0008 (size: 0x8)
    double MinThicknessTolerance;                                                     // 0x0010 (size: 0x8)
    bool bConsiderAllPossibleMerges;                                                  // 0x0018 (size: 0x1)
    FGeometryScriptSphereCovering PrecomputedNegativeSpace;                           // 0x0020 (size: 0x10)
    bool bComputeNegativeSpace;                                                       // 0x0030 (size: 0x1)
    FComputeNegativeSpaceOptions ComputeNegativeSpaceOptions;                         // 0x0038 (size: 0x28)
    FGeometryScriptSimpleCollisionTriangulationOptions ShapeToHullTriangulation;      // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FGeometryScriptMeshBevelOptions
{
    float BevelDistance;                                                              // 0x0000 (size: 0x4)
    bool bInferMaterialID;                                                            // 0x0004 (size: 0x1)
    int32 SetMaterialID;                                                              // 0x0008 (size: 0x4)
    int32 Subdivisions;                                                               // 0x000C (size: 0x4)
    float RoundWeight;                                                                // 0x0010 (size: 0x4)
    bool bApplyFilterBox;                                                             // 0x0014 (size: 0x1)
    FBox FilterBox;                                                                   // 0x0018 (size: 0x38)
    FTransform FilterBoxTransform;                                                    // 0x0050 (size: 0x60)
    bool bFullyContained;                                                             // 0x00B0 (size: 0x1)

}; // Size: 0xC0

struct FGeometryScriptMeshBevelSelectionOptions
{
    float BevelDistance;                                                              // 0x0000 (size: 0x4)
    bool bInferMaterialID;                                                            // 0x0004 (size: 0x1)
    int32 SetMaterialID;                                                              // 0x0008 (size: 0x4)
    int32 Subdivisions;                                                               // 0x000C (size: 0x4)
    float RoundWeight;                                                                // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FGeometryScriptMeshBooleanOptions
{
    bool bFillHoles;                                                                  // 0x0000 (size: 0x1)
    bool bSimplifyOutput;                                                             // 0x0001 (size: 0x1)
    float SimplifyPlanarTolerance;                                                    // 0x0004 (size: 0x4)
    bool bAllowEmptyResult;                                                           // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FGeometryScriptMeshEditPolygroupOptions
{
    EGeometryScriptMeshEditPolygroupMode GroupMode;                                   // 0x0000 (size: 0x1)
    int32 ConstantGroup;                                                              // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGeometryScriptMeshExtrudeOptions
{
    float ExtrudeDistance;                                                            // 0x0000 (size: 0x4)
    FVector ExtrudeDirection;                                                         // 0x0008 (size: 0x18)
    float UVScale;                                                                    // 0x0020 (size: 0x4)
    bool bSolidsToShells;                                                             // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FGeometryScriptMeshInsetOutsetFacesOptions
{
    float Distance;                                                                   // 0x0000 (size: 0x4)
    bool bReproject;                                                                  // 0x0004 (size: 0x1)
    bool bBoundaryOnly;                                                               // 0x0005 (size: 0x1)
    float Softness;                                                                   // 0x0008 (size: 0x4)
    float AreaScale;                                                                  // 0x000C (size: 0x4)
    EGeometryScriptPolyOperationArea AreaMode;                                        // 0x0010 (size: 0x1)
    FGeometryScriptMeshEditPolygroupOptions GroupOptions;                             // 0x0014 (size: 0x8)
    float UVScale;                                                                    // 0x001C (size: 0x4)

}; // Size: 0x20

struct FGeometryScriptMeshLinearExtrudeOptions
{
    float Distance;                                                                   // 0x0000 (size: 0x4)
    EGeometryScriptLinearExtrudeDirection DirectionMode;                              // 0x0004 (size: 0x1)
    FVector Direction;                                                                // 0x0008 (size: 0x18)
    EGeometryScriptPolyOperationArea AreaMode;                                        // 0x0020 (size: 0x1)
    FGeometryScriptMeshEditPolygroupOptions GroupOptions;                             // 0x0024 (size: 0x8)
    float UVScale;                                                                    // 0x002C (size: 0x4)
    bool bSolidsToShells;                                                             // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FGeometryScriptMeshMirrorOptions
{
    bool bApplyPlaneCut;                                                              // 0x0000 (size: 0x1)
    bool bFlipCutSide;                                                                // 0x0001 (size: 0x1)
    bool bWeldAlongPlane;                                                             // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FGeometryScriptMeshOffsetFacesOptions
{
    float Distance;                                                                   // 0x0000 (size: 0x4)
    EGeometryScriptOffsetFacesType OffsetType;                                        // 0x0004 (size: 0x1)
    EGeometryScriptPolyOperationArea AreaMode;                                        // 0x0005 (size: 0x1)
    FGeometryScriptMeshEditPolygroupOptions GroupOptions;                             // 0x0008 (size: 0x8)
    float UVScale;                                                                    // 0x0010 (size: 0x4)
    bool bSolidsToShells;                                                             // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FGeometryScriptMeshOffsetOptions
{
    float OffsetDistance;                                                             // 0x0000 (size: 0x4)
    bool bFixedBoundary;                                                              // 0x0004 (size: 0x1)
    int32 SolveSteps;                                                                 // 0x0008 (size: 0x4)
    float SmoothAlpha;                                                                // 0x000C (size: 0x4)
    bool bReprojectDuringSmoothing;                                                   // 0x0010 (size: 0x1)
    float BoundaryAlpha;                                                              // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FGeometryScriptMeshPlaneCutOptions
{
    bool bFillHoles;                                                                  // 0x0000 (size: 0x1)
    bool bFillSpans;                                                                  // 0x0001 (size: 0x1)
    bool bFlipCutSide;                                                                // 0x0002 (size: 0x1)
    float UVWorldDimension;                                                           // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGeometryScriptMeshPlaneSliceOptions
{
    bool bFillHoles;                                                                  // 0x0000 (size: 0x1)
    bool bFillSpans;                                                                  // 0x0001 (size: 0x1)
    float GapWidth;                                                                   // 0x0004 (size: 0x4)
    float UVWorldDimension;                                                           // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGeometryScriptMeshPointSamplingOptions
{
    float SamplingRadius;                                                             // 0x0000 (size: 0x4)
    int32 MaxNumSamples;                                                              // 0x0004 (size: 0x4)
    int32 RandomSeed;                                                                 // 0x0008 (size: 0x4)
    double SubSampleDensity;                                                          // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FGeometryScriptMeshReadLOD
{
    EGeometryScriptLODType LODType;                                                   // 0x0000 (size: 0x1)
    int32 LODIndex;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGeometryScriptMeshSelection
{
}; // Size: 0x10

struct FGeometryScriptMeshSelfUnionOptions
{
    bool bFillHoles;                                                                  // 0x0000 (size: 0x1)
    bool bTrimFlaps;                                                                  // 0x0001 (size: 0x1)
    bool bSimplifyOutput;                                                             // 0x0002 (size: 0x1)
    float SimplifyPlanarTolerance;                                                    // 0x0004 (size: 0x4)
    float WindingThreshold;                                                           // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGeometryScriptMeshWriteLOD
{
    bool bWriteHiResSource;                                                           // 0x0000 (size: 0x1)
    int32 LODIndex;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGeometryScriptMorphologyOptions
{
    FGeometryScript3DGridParameters SDFGridParameters;                                // 0x0000 (size: 0xC)
    bool bUseSeparateMeshGrid;                                                        // 0x000C (size: 0x1)
    FGeometryScript3DGridParameters MeshGridParameters;                               // 0x0010 (size: 0xC)
    EGeometryScriptMorphologicalOpType Operation;                                     // 0x001C (size: 0x1)
    float Distance;                                                                   // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FGeometryScriptNaniteOptions
{
    bool bEnabled;                                                                    // 0x0000 (size: 0x1)
    float FallbackPercentTriangles;                                                   // 0x0004 (size: 0x4)
    float FallbackRelativeError;                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGeometryScriptNonUniformPointSamplingOptions
{
    float MaxSamplingRadius;                                                          // 0x0000 (size: 0x4)
    EGeometryScriptSamplingDistributionMode SizeDistribution;                         // 0x0004 (size: 0x1)
    double SizeDistributionPower;                                                     // 0x0008 (size: 0x8)
    EGeometryScriptSamplingWeightMode WeightMode;                                     // 0x0010 (size: 0x1)
    bool bInvertWeights;                                                              // 0x0011 (size: 0x1)

}; // Size: 0x18

struct FGeometryScriptOpenPathOffsetOptions
{
    EGeometryScriptPolyOffsetJoinType JoinType;                                       // 0x0000 (size: 0x1)
    double MiterLimit;                                                                // 0x0008 (size: 0x8)
    EGeometryScriptPathOffsetEndType EndType;                                         // 0x0010 (size: 0x1)
    double StepsPerRadianScale;                                                       // 0x0018 (size: 0x8)
    double MaximumStepsPerRadian;                                                     // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FGeometryScriptPNTessellateOptions
{
    bool bRecomputeNormals;                                                           // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FGeometryScriptPatchBuilderOptions
{
    int32 InitialPatchCount;                                                          // 0x0000 (size: 0x4)
    int32 MinPatchSize;                                                               // 0x0004 (size: 0x4)
    float PatchCurvatureAlignmentWeight;                                              // 0x0008 (size: 0x4)
    float PatchMergingMetricThresh;                                                   // 0x000C (size: 0x4)
    float PatchMergingAngleThresh;                                                    // 0x0010 (size: 0x4)
    FGeometryScriptExpMapUVOptions ExpMapOptions;                                     // 0x0014 (size: 0x8)
    bool bRespectInputGroups;                                                         // 0x001C (size: 0x1)
    FGeometryScriptGroupLayer GroupLayer;                                             // 0x0020 (size: 0x8)
    bool bAutoPack;                                                                   // 0x0028 (size: 0x1)
    FGeometryScriptRepackUVsOptions PackingOptions;                                   // 0x002C (size: 0x8)

}; // Size: 0x34

struct FGeometryScriptPerlinNoiseLayerOptions
{
    float Magnitude;                                                                  // 0x0000 (size: 0x4)
    float Frequency;                                                                  // 0x0004 (size: 0x4)
    FVector FrequencyShift;                                                           // 0x0008 (size: 0x18)
    int32 RandomSeed;                                                                 // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FGeometryScriptPerlinNoiseOptions
{
    FGeometryScriptPerlinNoiseLayerOptions BaseLayer;                                 // 0x0000 (size: 0x28)
    bool bApplyAlongNormal;                                                           // 0x0028 (size: 0x1)
    EGeometryScriptEmptySelectionBehavior EmptyBehavior;                              // 0x0029 (size: 0x1)

}; // Size: 0x30

struct FGeometryScriptPlanarSimplifyOptions
{
    float AngleThreshold;                                                             // 0x0000 (size: 0x4)
    bool bAutoCompact;                                                                // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FGeometryScriptPointClusteringOptions
{
    TArray<FVector> InitialClusterCenters;                                            // 0x0000 (size: 0x10)
    int32 TargetNumClusters;                                                          // 0x0010 (size: 0x4)
    EGeometryScriptInitKMeansMethod InitializeMethod;                                 // 0x0014 (size: 0x1)
    int32 RandomSeed;                                                                 // 0x0018 (size: 0x4)
    int32 MaxIterations;                                                              // 0x001C (size: 0x4)

}; // Size: 0x20

struct FGeometryScriptPointFlatteningOptions
{
    FTransform Frame;                                                                 // 0x0000 (size: 0x60)
    EGeometryScriptAxis DropAxis;                                                     // 0x0060 (size: 0x1)

}; // Size: 0x70

struct FGeometryScriptPointPriorityOptions
{
    TArray<float> OptionalPriorityWeights;                                            // 0x0000 (size: 0x10)
    bool bUniformSpacing;                                                             // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FGeometryScriptPolyPath
{
    bool bClosedLoop;                                                                 // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FGeometryScriptPolygonOffsetOptions
{
    EGeometryScriptPolyOffsetJoinType JoinType;                                       // 0x0000 (size: 0x1)
    double MiterLimit;                                                                // 0x0008 (size: 0x8)
    bool bOffsetBothSides;                                                            // 0x0010 (size: 0x1)
    double StepsPerRadianScale;                                                       // 0x0018 (size: 0x8)
    double MaximumStepsPerRadian;                                                     // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FGeometryScriptPolygonsTriangulationOptions
{
    bool bStillAppendOnTriangulationError;                                            // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FGeometryScriptPolygroupSimplifyOptions
{
    float AngleThreshold;                                                             // 0x0000 (size: 0x4)
    bool bAutoCompact;                                                                // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FGeometryScriptPrimitiveOptions
{
    EGeometryScriptPrimitivePolygroupMode PolygroupMode;                              // 0x0000 (size: 0x1)
    bool bFlipOrientation;                                                            // 0x0001 (size: 0x1)
    EGeometryScriptPrimitiveUVMode UVMode;                                            // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FGeometryScriptRayHitResult
{
    bool bHit;                                                                        // 0x0000 (size: 0x1)
    float RayParameter;                                                               // 0x0004 (size: 0x4)
    int32 HitTriangleID;                                                              // 0x0008 (size: 0x4)
    FVector HitPosition;                                                              // 0x0010 (size: 0x18)
    FVector HitBaryCoords;                                                            // 0x0028 (size: 0x18)

}; // Size: 0x40

struct FGeometryScriptRecomputeUVsOptions
{
    EGeometryScriptUVFlattenMethod Method;                                            // 0x0000 (size: 0x1)
    EGeometryScriptUVIslandSource IslandSource;                                       // 0x0001 (size: 0x1)
    FGeometryScriptExpMapUVOptions ExpMapOptions;                                     // 0x0004 (size: 0x8)
    FGeometryScriptSpectralConformalUVOptions SpectralConformalOptions;               // 0x000C (size: 0x1)
    FGeometryScriptGroupLayer GroupLayer;                                             // 0x0010 (size: 0x8)
    bool bAutoAlignIslandsWithAxes;                                                   // 0x0018 (size: 0x1)

}; // Size: 0x1C

struct FGeometryScriptRemeshOptions
{
    bool bDiscardAttributes;                                                          // 0x0000 (size: 0x1)
    bool bReprojectToInputMesh;                                                       // 0x0001 (size: 0x1)
    EGeometryScriptRemeshSmoothingType SmoothingType;                                 // 0x0002 (size: 0x1)
    float SmoothingRate;                                                              // 0x0004 (size: 0x4)
    EGeometryScriptRemeshEdgeConstraintType MeshBoundaryConstraint;                   // 0x0008 (size: 0x1)
    EGeometryScriptRemeshEdgeConstraintType GroupBoundaryConstraint;                  // 0x0009 (size: 0x1)
    EGeometryScriptRemeshEdgeConstraintType MaterialBoundaryConstraint;               // 0x000A (size: 0x1)
    bool bAllowFlips;                                                                 // 0x000B (size: 0x1)
    bool bAllowSplits;                                                                // 0x000C (size: 0x1)
    bool bAllowCollapses;                                                             // 0x000D (size: 0x1)
    bool bPreventNormalFlips;                                                         // 0x000E (size: 0x1)
    bool bPreventTinyTriangles;                                                       // 0x000F (size: 0x1)
    bool bUseFullRemeshPasses;                                                        // 0x0010 (size: 0x1)
    int32 RemeshIterations;                                                           // 0x0014 (size: 0x4)
    bool bAutoCompact;                                                                // 0x0018 (size: 0x1)

}; // Size: 0x1C

struct FGeometryScriptRemoveHiddenTrianglesOptions
{
    EGeometryScriptRemoveHiddenTrianglesMethod Method;                                // 0x0000 (size: 0x1)
    int32 SamplesPerTriangle;                                                         // 0x0004 (size: 0x4)
    int32 ShrinkSelection;                                                            // 0x0008 (size: 0x4)
    float WindingIsoValue;                                                            // 0x000C (size: 0x4)
    int32 RaysPerSample;                                                              // 0x0010 (size: 0x4)
    float NormalOffset;                                                               // 0x0014 (size: 0x4)
    bool bCompactResult;                                                              // 0x0018 (size: 0x1)

}; // Size: 0x1C

struct FGeometryScriptRemoveSmallComponentOptions
{
    float MinVolume;                                                                  // 0x0000 (size: 0x4)
    float MinArea;                                                                    // 0x0004 (size: 0x4)
    int32 MinTriangleCount;                                                           // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGeometryScriptRenderCaptureCamera
{
    int32 Resolution;                                                                 // 0x0000 (size: 0x4)
    double FieldOfViewDegrees;                                                        // 0x0008 (size: 0x8)
    FVector ViewPosition;                                                             // 0x0010 (size: 0x18)
    FVector ViewDirection;                                                            // 0x0028 (size: 0x18)
    double NearPlaneDist;                                                             // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FGeometryScriptRenderCaptureCamerasForBoxOptions
{
    int32 Resolution;                                                                 // 0x0000 (size: 0x4)
    double FieldOfViewDegrees;                                                        // 0x0008 (size: 0x8)
    bool bViewFromBoxFaces;                                                           // 0x0010 (size: 0x1)
    bool bViewFromUpperCorners;                                                       // 0x0011 (size: 0x1)
    bool bViewFromLowerCorners;                                                       // 0x0012 (size: 0x1)
    bool bViewFromUpperEdges;                                                         // 0x0013 (size: 0x1)
    bool bViewFromLowerEdges;                                                         // 0x0014 (size: 0x1)
    bool bViewFromSideEdges;                                                          // 0x0015 (size: 0x1)
    TArray<FVector> ExtraViewFromPositions;                                           // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FGeometryScriptRenderCaptureTextures
{
    class UTexture2D* BaseColorMap;                                                   // 0x0000 (size: 0x8)
    bool bHasBaseColorMap;                                                            // 0x0008 (size: 0x1)
    class UTexture2D* NormalMap;                                                      // 0x0010 (size: 0x8)
    bool bHasNormalMap;                                                               // 0x0018 (size: 0x1)
    class UTexture2D* PackedMRSMap;                                                   // 0x0020 (size: 0x8)
    bool bHasPackedMRSMap;                                                            // 0x0028 (size: 0x1)
    class UTexture2D* MetallicMap;                                                    // 0x0030 (size: 0x8)
    bool bHasMetallicMap;                                                             // 0x0038 (size: 0x1)
    class UTexture2D* RoughnessMap;                                                   // 0x0040 (size: 0x8)
    bool bHasRoughnessMap;                                                            // 0x0048 (size: 0x1)
    class UTexture2D* SpecularMap;                                                    // 0x0050 (size: 0x8)
    bool bHasSpecularMap;                                                             // 0x0058 (size: 0x1)
    class UTexture2D* EmissiveMap;                                                    // 0x0060 (size: 0x8)
    bool bHasEmissiveMap;                                                             // 0x0068 (size: 0x1)
    class UTexture2D* OpacityMap;                                                     // 0x0070 (size: 0x8)
    bool bHasOpacityMap;                                                              // 0x0078 (size: 0x1)
    class UTexture2D* SubsurfaceColorMap;                                             // 0x0080 (size: 0x8)
    bool bHasSubsurfaceColorMap;                                                      // 0x0088 (size: 0x1)

}; // Size: 0x90

struct FGeometryScriptRepackUVsOptions
{
    int32 TargetImageWidth;                                                           // 0x0000 (size: 0x4)
    bool bOptimizeIslandRotation;                                                     // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FGeometryScriptResolveTJunctionOptions
{
    float Tolerance;                                                                  // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FGeometryScriptRevolveOptions
{
    float RevolveDegrees;                                                             // 0x0000 (size: 0x4)
    float DegreeOffset;                                                               // 0x0004 (size: 0x4)
    bool bReverseDirection;                                                           // 0x0008 (size: 0x1)
    bool bHardNormals;                                                                // 0x0009 (size: 0x1)
    float HardNormalAngle;                                                            // 0x000C (size: 0x4)
    bool bProfileAtMidpoint;                                                          // 0x0010 (size: 0x1)
    bool bFillPartialRevolveEndcaps;                                                  // 0x0011 (size: 0x1)

}; // Size: 0x14

struct FGeometryScriptSampleTextureOptions
{
    EGeometryScriptPixelSamplingMethod SamplingMethod;                                // 0x0000 (size: 0x1)
    bool bWrap;                                                                       // 0x0001 (size: 0x1)
    FVector2D UVScale;                                                                // 0x0008 (size: 0x10)
    FVector2D UVOffset;                                                               // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FGeometryScriptScalarList
{
}; // Size: 0x10

struct FGeometryScriptSelectiveTessellateOptions
{
    bool bEnableMultithreading;                                                       // 0x0000 (size: 0x1)
    EGeometryScriptEmptySelectionBehavior EmptyBehavior;                              // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FGeometryScriptSetSimpleCollisionOptions
{
    bool bEmitTransaction;                                                            // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FGeometryScriptSetStaticMeshCollisionOptions
{
    bool bMarkAsCustomized;                                                           // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FGeometryScriptSimpleCollision
{
    FKAggregateGeom AggGeom;                                                          // 0x0000 (size: 0x80)

}; // Size: 0x80

struct FGeometryScriptSimpleCollisionTriangulationOptions
{
    int32 SphereStepsPerSide;                                                         // 0x0000 (size: 0x4)
    int32 CapsuleHemisphereSteps;                                                     // 0x0004 (size: 0x4)
    int32 CapsuleCircleSteps;                                                         // 0x0008 (size: 0x4)
    bool bApproximateLevelSetsWithCubes;                                              // 0x000C (size: 0x1)

}; // Size: 0x10

struct FGeometryScriptSimpleMeshBuffers
{
    TArray<FVector> Vertices;                                                         // 0x0000 (size: 0x10)
    TArray<FVector> Normals;                                                          // 0x0010 (size: 0x10)
    TArray<FVector2D> UV0;                                                            // 0x0020 (size: 0x10)
    TArray<FVector2D> UV1;                                                            // 0x0030 (size: 0x10)
    TArray<FVector2D> UV2;                                                            // 0x0040 (size: 0x10)
    TArray<FVector2D> UV3;                                                            // 0x0050 (size: 0x10)
    TArray<FVector2D> UV4;                                                            // 0x0060 (size: 0x10)
    TArray<FVector2D> UV5;                                                            // 0x0070 (size: 0x10)
    TArray<FVector2D> UV6;                                                            // 0x0080 (size: 0x10)
    TArray<FVector2D> UV7;                                                            // 0x0090 (size: 0x10)
    TArray<FLinearColor> VertexColors;                                                // 0x00A0 (size: 0x10)
    TArray<FIntVector> Triangles;                                                     // 0x00B0 (size: 0x10)
    TArray<int32> TriGroupIDs;                                                        // 0x00C0 (size: 0x10)

}; // Size: 0xD0

struct FGeometryScriptSimplePolygon
{
}; // Size: 0x10

struct FGeometryScriptSimplifyMeshOptions
{
    EGeometryScriptRemoveMeshSimplificationType Method;                               // 0x0000 (size: 0x1)
    bool bAllowSeamCollapse;                                                          // 0x0001 (size: 0x1)
    bool bAllowSeamSmoothing;                                                         // 0x0002 (size: 0x1)
    bool bAllowSeamSplits;                                                            // 0x0003 (size: 0x1)
    bool bPreserveVertexPositions;                                                    // 0x0004 (size: 0x1)
    bool bRetainQuadricMemory;                                                        // 0x0005 (size: 0x1)
    bool bAutoCompact;                                                                // 0x0006 (size: 0x1)

}; // Size: 0x7

struct FGeometryScriptSmoothBoneWeightsOptions
{
    EGeometryScriptSmoothBoneWeightsType DistanceWeighingType;                        // 0x0000 (size: 0x1)
    float Stiffness;                                                                  // 0x0004 (size: 0x4)
    int32 MaxInfluences;                                                              // 0x0008 (size: 0x4)
    int32 VoxelResolution;                                                            // 0x000C (size: 0x4)

}; // Size: 0x10

struct FGeometryScriptSolidifyOptions
{
    FGeometryScript3DGridParameters GridParameters;                                   // 0x0000 (size: 0xC)
    float WindingThreshold;                                                           // 0x000C (size: 0x4)
    bool bSolidAtBoundaries;                                                          // 0x0010 (size: 0x1)
    float ExtendBounds;                                                               // 0x0014 (size: 0x4)
    int32 SurfaceSearchSteps;                                                         // 0x0018 (size: 0x4)
    bool bThickenShells;                                                              // 0x001C (size: 0x1)
    double ShellThickness;                                                            // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FGeometryScriptSpatialQueryOptions
{
    float MaxDistance;                                                                // 0x0000 (size: 0x4)
    bool bAllowUnsafeModifiedQueries;                                                 // 0x0004 (size: 0x1)
    float WindingIsoThreshold;                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGeometryScriptSpectralConformalUVOptions
{
    bool bPreserveIrregularity;                                                       // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FGeometryScriptSphereCovering
{
}; // Size: 0x10

struct FGeometryScriptSplineSamplingOptions
{
    int32 NumSamples;                                                                 // 0x0000 (size: 0x4)
    float ErrorTolerance;                                                             // 0x0004 (size: 0x4)
    EGeometryScriptSampleSpacing SampleSpacing;                                       // 0x0008 (size: 0x1)
    TEnumAsByte<ESplineCoordinateSpace::Type> CoordinateSpace;                        // 0x0009 (size: 0x1)
    EGeometryScriptEvaluateSplineRange RangeMethod;                                   // 0x000A (size: 0x1)
    float RangeStart;                                                                 // 0x000C (size: 0x4)
    float RangeEnd;                                                                   // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FGeometryScriptSplitNormalsOptions
{
    bool bSplitByOpeningAngle;                                                        // 0x0000 (size: 0x1)
    float OpeningAngleDeg;                                                            // 0x0004 (size: 0x4)
    bool bSplitByFaceGroup;                                                           // 0x0008 (size: 0x1)
    FGeometryScriptGroupLayer GroupLayer;                                             // 0x000C (size: 0x8)

}; // Size: 0x14

struct FGeometryScriptSweptHullOptions
{
    bool bPrefilterVertices;                                                          // 0x0000 (size: 0x1)
    int32 PrefilterGridResolution;                                                    // 0x0004 (size: 0x4)
    float MinThickness;                                                               // 0x0008 (size: 0x4)
    bool bSimplify;                                                                   // 0x000C (size: 0x1)
    float MinEdgeLength;                                                              // 0x0010 (size: 0x4)
    float SimplifyTolerance;                                                          // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FGeometryScriptTangentsOptions
{
    EGeometryScriptTangentTypes Type;                                                 // 0x0000 (size: 0x1)
    int32 UVLayer;                                                                    // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGeometryScriptTransferBoneWeightsOptions
{
    ETransferBoneWeightsMethod TransferMethod;                                        // 0x0000 (size: 0x1)
    EOutputTargetMeshBones OutputTargetMeshBones;                                     // 0x0001 (size: 0x1)
    FGeometryScriptBoneWeightProfile SourceProfile;                                   // 0x0004 (size: 0x8)
    FGeometryScriptBoneWeightProfile TargetProfile;                                   // 0x000C (size: 0x8)
    double RadiusPercentage;                                                          // 0x0018 (size: 0x8)
    double NormalThreshold;                                                           // 0x0020 (size: 0x8)
    bool LayeredMeshSupport;                                                          // 0x0028 (size: 0x1)
    int32 NumSmoothingIterations;                                                     // 0x002C (size: 0x4)
    float SmoothingStrength;                                                          // 0x0030 (size: 0x4)
    FName InpaintMask;                                                                // 0x0034 (size: 0x8)

}; // Size: 0x40

struct FGeometryScriptTransformCollisionOptions
{
    bool bWarnOnInvalidTransforms;                                                    // 0x0000 (size: 0x1)
    bool bCenterTransformPivotPerShape;                                               // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FGeometryScriptTriangle
{
    FVector Vector0;                                                                  // 0x0000 (size: 0x18)
    FVector Vector1;                                                                  // 0x0018 (size: 0x18)
    FVector Vector2;                                                                  // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FGeometryScriptTriangleList
{
}; // Size: 0x10

struct FGeometryScriptTrianglePoint
{
    bool bValid;                                                                      // 0x0000 (size: 0x1)
    int32 TriangleID;                                                                 // 0x0004 (size: 0x4)
    FVector position;                                                                 // 0x0008 (size: 0x18)
    FVector BaryCoords;                                                               // 0x0020 (size: 0x18)

}; // Size: 0x38

struct FGeometryScriptTwistWarpOptions
{
    bool bSymmetricExtents;                                                           // 0x0000 (size: 0x1)
    float LowerExtent;                                                                // 0x0004 (size: 0x4)
    bool bBidirectional;                                                              // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FGeometryScriptUVList
{
}; // Size: 0x10

struct FGeometryScriptUVTriangle
{
    FVector2D UV0;                                                                    // 0x0000 (size: 0x10)
    FVector2D UV1;                                                                    // 0x0010 (size: 0x10)
    FVector2D UV2;                                                                    // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FGeometryScriptUniformRemeshOptions
{
    EGeometryScriptUniformRemeshTargetType TargetType;                                // 0x0000 (size: 0x1)
    int32 TargetTriangleCount;                                                        // 0x0004 (size: 0x4)
    float TargetEdgeLength;                                                           // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGeometryScriptVectorList
{
}; // Size: 0x10

struct FGeometryScriptVoronoiOptions
{
    float BoundsExpand;                                                               // 0x0000 (size: 0x4)
    FBox Bounds;                                                                      // 0x0008 (size: 0x38)
    TArray<int32> CreateCells;                                                        // 0x0040 (size: 0x10)
    bool bIncludeBoundary;                                                            // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FGeometryScriptWeldEdgesOptions
{
    float Tolerance;                                                                  // 0x0000 (size: 0x4)
    bool bOnlyUniquePairs;                                                            // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FGeometryScriptXAtlasOptions
{
    int32 MaxIterations;                                                              // 0x0000 (size: 0x4)

}; // Size: 0x4

class UGeometryScriptDebug : public UObject
{
    TArray<FGeometryScriptDebugMessage> Messages;                                     // 0x0028 (size: 0x10)

}; // Size: 0x38

class UGeometryScriptLibrary_BoxFunctions : public UBlueprintFunctionLibrary
{

    bool TestPointInsideBox(FBox Box, FVector Point, bool bConsiderOnBoxAsInside);
    bool TestBoxSphereIntersection(FBox Box, FVector SphereCenter, double SphereRadius);
    bool TestBoxBoxIntersection(FBox Box1, FBox Box2);
    FBox MakeBoxFromCenterSize(FVector Center, FVector Dimensions);
    FBox MakeBoxFromCenterExtents(FVector Center, FVector Extents);
    FBox GetTransformedBox(FBox Box, FTransform Transform);
    FBox GetExpandedBox(FBox Box, FVector ExpandBy);
    void GetBoxVolumeArea(FBox Box, double& Volume, double& SurfaceArea);
    double GetBoxPointDistance(FBox Box, FVector Point);
    FVector GetBoxFaceCenter(FBox Box, int32 FaceIndex, FVector& FaceNormal);
    FVector GetBoxCorner(FBox Box, int32 CornerIndex);
