#ifndef UE4SS_SDK_IBP_GrindingOven_Belows_HPP
#define UE4SS_SDK_IBP_GrindingOven_Belows_HPP

class AIBP_GrindingOven_Belows_C : public AInteractiveObjectActor
{
    class UStaticMeshComponent* Base_06;                                              // 0x0928 (size: 0x8)
    class UStaticMeshComponent* Base_05;                                              // 0x0930 (size: 0x8)
    class UStaticMeshComponent* Base_04;                                              // 0x0938 (size: 0x8)
    class UStaticMeshComponent* handlevel;                                            // 0x0940 (size: 0x8)
    class UStaticMeshComponent* Base_03;                                              // 0x0948 (size: 0x8)
    class UStaticMeshComponent* Base_02;                                              // 0x0950 (size: 0x8)
    class UStaticMeshComponent* Base_01;                                              // 0x0958 (size: 0x8)
    class UStaticMeshComponent* Base_08;                                              // 0x0960 (size: 0x8)
    class UStaticMeshComponent* Bellow_01;                                            // 0x0968 (size: 0x8)
    class UStaticMeshComponent* Bellow_02;                                            // 0x0970 (size: 0x8)
    class UStaticMeshComponent* Base_07;                                              // 0x0978 (size: 0x8)
    class UStaticMeshComponent* Bellow_03;                                            // 0x0980 (size: 0x8)
    class UStaticMeshComponent* Level;                                                // 0x0988 (size: 0x8)
    class UBoxNavObstacleComponent* BoxNavObstacle;                                   // 0x0990 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0998 (size: 0x8)

}; // Size: 0x9A0

#endif
