#ifndef UE4SS_SDK_Interactive_MiningSpotVariableWall_HPP
#define UE4SS_SDK_Interactive_MiningSpotVariableWall_HPP

class AInteractive_MiningSpotVariableWall_C : public AInteractiveObjectActor
{
    class UInteractiveObjectAnchorComponent* InteractiveHUDAnchor;                    // 0x0928 (size: 0x8)
    class UBoxNavObstacleComponent* BoxNavObstacle;                                   // 0x0930 (size: 0x8)
    class UMiningSpotVisualComponent* MiningSpotVisual;                               // 0x0938 (size: 0x8)
    class UStaticMeshComponent* Ore7;                                                 // 0x0940 (size: 0x8)
    class UStaticMeshComponent* Ore6;                                                 // 0x0948 (size: 0x8)
    class UStaticMeshComponent* Ore5;                                                 // 0x0950 (size: 0x8)
    class UStaticMeshComponent* Ore4;                                                 // 0x0958 (size: 0x8)
    class UStaticMeshComponent* Ore3;                                                 // 0x0960 (size: 0x8)
    class UStaticMeshComponent* Ore2;                                                 // 0x0968 (size: 0x8)
    class UStaticMeshComponent* Ore1;                                                 // 0x0970 (size: 0x8)

}; // Size: 0x978

#endif
