#ifndef UE4SS_SDK_Interactive_Chest_Orc_HPP
#define UE4SS_SDK_Interactive_Chest_Orc_HPP

class AInteractive_Chest_Orc_C : public AInteractiveObjectActor
{
    class UStaticMeshComponent* SM_OrcWall_A_014;                                     // 0x0928 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_A_015;                                     // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_A_016;                                     // 0x0938 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_02;                               // 0x0940 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_03;                               // 0x0948 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_010;                              // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_04;                               // 0x0958 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_05;                               // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_06;                               // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_07;                               // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_08;                               // 0x0978 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_09;                               // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_A_013;                                     // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_A_012;                                     // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_011;                              // 0x0998 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_A_09;                                      // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_A_010;                                     // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_A_011;                                     // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_013;                              // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* SM_OrcBridge_Column_v2;                               // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* SM_OrcBridge_Column_v3;                               // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* SM_OrcBridge_Column_v4;                               // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* SM_OrcBridge_Column_v5;                               // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* SM_SleeperTotem;                                      // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* SM_OrcWall_Column_C_012;                              // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0A98 (size: 0x8)
    class UBoxComponent*  Box Collision;                                              // 0x0AA0 (size: 0x8)
    class UInteractiveObjectAnchorComponent* InteractiveHUDAnchor;                    // 0x0AA8 (size: 0x8)

}; // Size: 0xAB0

#endif
