#ifndef UE4SS_SDK_Interactive_Rostisserie_HPP
#define UE4SS_SDK_Interactive_Rostisserie_HPP

class AInteractive_Rostisserie_C : public AScavengerRotisserie
{
    class UStaticMeshComponent* Sphere;                                               // 0x0950 (size: 0x8)
    class UStaticMeshComponent* Cube3;                                                // 0x0958 (size: 0x8)
    class UStaticMeshComponent* Cube2;                                                // 0x0960 (size: 0x8)
    class UStaticMeshComponent* Cube1;                                                // 0x0968 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SK_Fire_Scavenger_Collision;                          // 0x0978 (size: 0x8)
    class UInteractiveObjectAnchorComponent* InteractiveHUDAnchor;                    // 0x0980 (size: 0x8)
    class UCapsuleNavObstacleComponent* CapsuleNavObstacle;                           // 0x0988 (size: 0x8)
    class UBoxComponent* Box3;                                                        // 0x0990 (size: 0x8)
    class UBoxComponent* Box2;                                                        // 0x0998 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x09A0 (size: 0x8)
    class UGothicNavModifierComponent* GothicNavModifier;                             // 0x09A8 (size: 0x8)

}; // Size: 0x9B0

#endif
