#ifndef UE4SS_SDK_Interactive_Winch_Cryptex_HPP
#define UE4SS_SDK_Interactive_Winch_Cryptex_HPP

class AInteractive_Winch_Cryptex_C : public AInteractiveObjectActor
{
    class UStaticMeshComponent* Cube4;                                                // 0x0928 (size: 0x8)
    class UStaticMeshComponent* Cube21;                                               // 0x0930 (size: 0x8)
    class UStaticMeshComponent* Cube20;                                               // 0x0938 (size: 0x8)
    class UStaticMeshComponent* Cube19;                                               // 0x0940 (size: 0x8)
    class UStaticMeshComponent* Cube18;                                               // 0x0948 (size: 0x8)
    class UStaticMeshComponent* Cube17;                                               // 0x0950 (size: 0x8)
    class UStaticMeshComponent* Cube16;                                               // 0x0958 (size: 0x8)
    class UStaticMeshComponent* Cube14;                                               // 0x0960 (size: 0x8)
    class UStaticMeshComponent* Cube15;                                               // 0x0968 (size: 0x8)
    class UStaticMeshComponent* Cube13;                                               // 0x0970 (size: 0x8)
    class UStaticMeshComponent* Cube12;                                               // 0x0978 (size: 0x8)
    class UStaticMeshComponent* Cube11;                                               // 0x0980 (size: 0x8)
    class UStaticMeshComponent* Cube10;                                               // 0x0988 (size: 0x8)
    class UStaticMeshComponent* Cube9;                                                // 0x0990 (size: 0x8)
    class UStaticMeshComponent* Cube8;                                                // 0x0998 (size: 0x8)
    class UStaticMeshComponent* Cube3;                                                // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* Cylinder1;                                            // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* Cylinder;                                             // 0x09B8 (size: 0x8)
    class UBoxNavObstacleComponent* BoxNavObstacle;                                   // 0x09C0 (size: 0x8)
    class UInteractiveObjectAnchorComponent* InteractiveHUDAnchor;                    // 0x09C8 (size: 0x8)

}; // Size: 0x9D0

#endif
