#ifndef UE4SS_SDK_LavaExtractor_animbp_HPP
#define UE4SS_SDK_LavaExtractor_animbp_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_584;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_585;                                                         // 0x000C (size: 0x8)
    int32 __IntProperty_586;                                                          // 0x0014 (size: 0x4)
    FName __NameProperty_587;                                                         // 0x0018 (size: 0x8)
    int32 __IntProperty_588;                                                          // 0x0020 (size: 0x4)
    FName __NameProperty_589;                                                         // 0x0024 (size: 0x8)
    int32 __IntProperty_590;                                                          // 0x002C (size: 0x4)
    FName __NameProperty_591;                                                         // 0x0030 (size: 0x8)
    int32 __IntProperty_592;                                                          // 0x0038 (size: 0x4)
    FName __NameProperty_593;                                                         // 0x003C (size: 0x8)
    int32 __IntProperty_594;                                                          // 0x0044 (size: 0x4)
    FName __NameProperty_595;                                                         // 0x0048 (size: 0x8)
    int32 __IntProperty_596;                                                          // 0x0050 (size: 0x4)
    FName __NameProperty_597;                                                         // 0x0054 (size: 0x8)
    int32 __IntProperty_598;                                                          // 0x005C (size: 0x4)
    FName __NameProperty_599;                                                         // 0x0060 (size: 0x8)
    int32 __IntProperty_600;                                                          // 0x0068 (size: 0x4)
    FName __NameProperty_601;                                                         // 0x006C (size: 0x8)
    int32 __IntProperty_602;                                                          // 0x0074 (size: 0x4)
    FName __NameProperty_603;                                                         // 0x0078 (size: 0x8)
    int32 __IntProperty_604;                                                          // 0x0080 (size: 0x4)
    FName __NameProperty_605;                                                         // 0x0084 (size: 0x8)
    int32 __IntProperty_606;                                                          // 0x008C (size: 0x4)
    FName __NameProperty_607;                                                         // 0x0090 (size: 0x8)
    int32 __IntProperty_608;                                                          // 0x0098 (size: 0x4)
    FName __NameProperty_609;                                                         // 0x009C (size: 0x8)
    int32 __IntProperty_610;                                                          // 0x00A4 (size: 0x4)
    FName __NameProperty_611;                                                         // 0x00A8 (size: 0x8)
    int32 __IntProperty_612;                                                          // 0x00B0 (size: 0x4)
    FName __NameProperty_613;                                                         // 0x00B4 (size: 0x8)
    int32 __IntProperty_614;                                                          // 0x00BC (size: 0x4)
    FName __NameProperty_615;                                                         // 0x00C0 (size: 0x8)
    int32 __IntProperty_616;                                                          // 0x00C8 (size: 0x4)
    FName __NameProperty_617;                                                         // 0x00CC (size: 0x8)
    int32 __IntProperty_618;                                                          // 0x00D4 (size: 0x4)
    FName __NameProperty_619;                                                         // 0x00D8 (size: 0x8)
    int32 __IntProperty_620;                                                          // 0x00E0 (size: 0x4)
    FName __NameProperty_621;                                                         // 0x00E4 (size: 0x8)
    int32 __IntProperty_622;                                                          // 0x00EC (size: 0x4)
    FName __NameProperty_623;                                                         // 0x00F0 (size: 0x8)
    int32 __IntProperty_624;                                                          // 0x00F8 (size: 0x4)
    float __FloatProperty_625;                                                        // 0x00FC (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_626;                               // 0x0100 (size: 0x2C)
    float __FloatProperty_627;                                                        // 0x012C (size: 0x4)
    bool __BoolProperty_628;                                                          // 0x0130 (size: 0x1)
    EAnimSyncMethod __EnumProperty_629;                                               // 0x0131 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_630;                             // 0x0132 (size: 0x1)
    FName __NameProperty_631;                                                         // 0x0134 (size: 0x8)
    FName __NameProperty_632;                                                         // 0x013C (size: 0x8)
    int32 __IntProperty_633;                                                          // 0x0144 (size: 0x4)
    FName __NameProperty_634;                                                         // 0x0148 (size: 0x8)
    FName __NameProperty_635;                                                         // 0x0150 (size: 0x8)
    int32 __IntProperty_636;                                                          // 0x0158 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_637;                                        // 0x0160 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0180 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0200 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0218 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_44;    // 0x0248 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_43;    // 0x0278 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_42;    // 0x02A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_41;    // 0x02D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_40;    // 0x0308 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_39;    // 0x0338 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_38;    // 0x0368 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_37;    // 0x0398 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_36;    // 0x03C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_35;    // 0x03F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_34;    // 0x0428 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_33;    // 0x0458 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_32;    // 0x0488 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_31;    // 0x04B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_30;    // 0x04E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_29;    // 0x0518 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_28;    // 0x0548 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_27;    // 0x0578 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_26;    // 0x05A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_25;    // 0x05D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_24;    // 0x0608 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_23;    // 0x0638 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_22;    // 0x0668 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_21;    // 0x0698 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_20;    // 0x06C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_19;    // 0x06F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_18;    // 0x0728 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_17;    // 0x0758 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;    // 0x0788 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;    // 0x07B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;    // 0x07E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;    // 0x0818 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;    // 0x0848 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x0878 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x08A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x08D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x0908 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x0938 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x0968 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x0998 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x09C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x09F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x0A28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x0A58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x0A88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_20;      // 0x0AB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_21;         // 0x0AE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_19;      // 0x0B18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_20;         // 0x0B48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_18;      // 0x0B78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_19;         // 0x0BA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;      // 0x0BD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_18;         // 0x0C08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;      // 0x0C38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_17;         // 0x0C68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;      // 0x0C98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_16;         // 0x0CC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;      // 0x0CF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_15;         // 0x0D28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;      // 0x0D58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_14;         // 0x0D88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;      // 0x0DB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_13;         // 0x0DE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;      // 0x0E18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_12;         // 0x0E48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;      // 0x0E78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_11;         // 0x0EA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;       // 0x0ED8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_10;         // 0x0F08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;       // 0x0F38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;          // 0x0F68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;       // 0x0F98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;          // 0x0FC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;       // 0x0FF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;          // 0x1028 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x1058 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;          // 0x1088 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x10B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;          // 0x10E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x1118 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x1148 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x1178 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x11A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x11D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x1208 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x1238 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x1268 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x1298 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x12C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x12F8 (size: 0x30)

}; // Size: 0x1328

class ULavaExtractor_animbp_C : public UDoorAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03C0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x03C8 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03D0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03D8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x03F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x0420 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x0448 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x0470 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x0498 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x04C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x04E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x0510 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x0538 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x0560 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x0588 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x05B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x05D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x0600 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x0628 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x0650 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x0678 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x06A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x06C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x06F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x0718 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x0740 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x0768 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x0790 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x07B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x07E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x0808 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0830 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0858 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0880 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x08A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x08D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x08F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0920 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0948 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0970 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0998 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x09C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x09E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0A10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x0A38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0A60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0A88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0AB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0AD8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x0B00 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x0B48 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x0B68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x0BB0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x0BD0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x0C18 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x0C38 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x0C80 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x0CA0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x0CE8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x0D08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x0D50 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x0D70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x0DB8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x0DD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x0E20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x0E40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x0E88 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x0EA8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x0EF0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x0F10 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x0F58 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x0F78 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x0FC0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x0FE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x1028 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x1048 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x1090 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x10B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x10F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1118 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x1160 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1180 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x11C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x11E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x1230 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1250 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x1298 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x12B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x1300 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x1320 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1368 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x1388 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x13A8 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1470 (size: 0x48)

    void AnimGraph(FPoseLink& AnimGraph);
    void OnNotifyEnd_062B5E464FF13CDC27963AB5F8295335(FName NotifyName);
    void OnNotifyBegin_062B5E464FF13CDC27963AB5F8295335(FName NotifyName);
    void OnInterrupted_062B5E464FF13CDC27963AB5F8295335(FName NotifyName);
    void OnBlendOut_062B5E464FF13CDC27963AB5F8295335(FName NotifyName);
    void OnCompleted_062B5E464FF13CDC27963AB5F8295335(FName NotifyName);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_LavaExtractor_animbp_AnimGraphNode_TransitionResult_D6C63BD1481A47035CF3B0B0FA040A86();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_LavaExtractor_animbp_AnimGraphNode_TransitionResult_A0F22C874312AAC9F51136A1C1138F2F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_LavaExtractor_animbp_AnimGraphNode_TransitionResult_A4CF508E466B8322C07593AE04048597();
