#ifndef UE4SS_SDK_LavaExtractor_HPP
#define UE4SS_SDK_LavaExtractor_HPP

class ALavaExtractor_C : public AInteractiveObjectActor
{
    class UGothicFXComponent* GothicFX;                                               // 0x0928 (size: 0x8)
    class UBoxNavObstacleComponent* BoxNavObstacle;                                   // 0x0930 (size: 0x8)
    class UCapsuleNavObstacleComponent* CapsuleNavObstacle;                           // 0x0938 (size: 0x8)
    class UStaticMeshComponent* Pole_03;                                              // 0x0940 (size: 0x8)
    class UStaticMeshComponent* Pole_02;                                              // 0x0948 (size: 0x8)
    class UStaticMeshComponent* Pole_01;                                              // 0x0950 (size: 0x8)
    class UStaticMeshComponent* SK_ST_LavaExtractorPole;                              // 0x0958 (size: 0x8)
    class UStaticMeshComponent* Cube;                                                 // 0x0960 (size: 0x8)
    class UDoorInteractiveComponent* DoorInteractive;                                 // 0x0968 (size: 0x8)
    class UInteractiveObjectAnchorComponent* Arrow1;                                  // 0x0970 (size: 0x8)
    class UInteractiveObjectAnchorComponent* InteractiveHUDAnchor1;                   // 0x0978 (size: 0x8)
    class UInteractiveObjectAnchorComponent* InteractiveHUDAnchor;                    // 0x0980 (size: 0x8)

}; // Size: 0x988

#endif
