#ifndef UE4SS_SDK_Lockpicking_AnimBP_HPP
#define UE4SS_SDK_Lockpicking_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_151;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_152;                                                         // 0x000C (size: 0x8)
    int32 __IntProperty_153;                                                          // 0x0014 (size: 0x4)
    FName __NameProperty_154;                                                         // 0x0018 (size: 0x8)
    int32 __IntProperty_155;                                                          // 0x0020 (size: 0x4)
    FName __NameProperty_156;                                                         // 0x0024 (size: 0x8)
    int32 __IntProperty_157;                                                          // 0x002C (size: 0x4)
    FName __NameProperty_158;                                                         // 0x0030 (size: 0x8)
    int32 __IntProperty_159;                                                          // 0x0038 (size: 0x4)
    FName __NameProperty_160;                                                         // 0x003C (size: 0x8)
    int32 __IntProperty_161;                                                          // 0x0044 (size: 0x4)
    float __FloatProperty_162;                                                        // 0x0048 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_163;                               // 0x004C (size: 0x2C)
    float __FloatProperty_164;                                                        // 0x0078 (size: 0x4)
    EAnimSyncMethod __EnumProperty_165;                                               // 0x007C (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_166;                             // 0x007D (size: 0x1)
    FName __NameProperty_167;                                                         // 0x0080 (size: 0x8)
    FName __NameProperty_168;                                                         // 0x0088 (size: 0x8)
    FName __NameProperty_169;                                                         // 0x0090 (size: 0x8)
    int32 __IntProperty_170;                                                          // 0x0098 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_171;                                        // 0x00A0 (size: 0x20)
    class UBlendProfile* __BlendProfile_172;                                          // 0x00C0 (size: 0x8)
    class UCurveFloat* __CurveFloat_173;                                              // 0x00C8 (size: 0x8)
    bool __BoolProperty_174;                                                          // 0x00D0 (size: 0x1)
    EAlphaBlendOption __EnumProperty_175;                                             // 0x00D1 (size: 0x1)
    EBlendListTransitionType __EnumProperty_176;                                      // 0x00D2 (size: 0x1)
    TArray<float> __ArrayProperty_177;                                                // 0x00D8 (size: 0x10)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00E8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0168 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0180 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x01B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x01E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x0210 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x0240 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x0270 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x02A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x02D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x0300 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x0330 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x0360 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x0390 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x03C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;          // 0x03F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0420 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x0450 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0480 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x04B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RandomPlayer;           // 0x04E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x0510 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0540 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0570 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x05A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x05D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0600 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x0630 (size: 0x30)

}; // Size: 0x660

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)

}; // Size: 0x2

class ULockpicking_AnimBP_C : public ULockPickAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0398 (size: 0x2)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x03A0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03A8 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03B0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x03D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x03F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0420 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0448 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0470 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0498 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x04C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x04E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0510 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0538 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0560 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0588 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x05D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x05F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x0638 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0658 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x06A0 (size: 0x20)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;                                // 0x06C0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x0738 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0758 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x07A0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x07C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x0808 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x0828 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x08F0 (size: 0x48)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_TransitionResult_7777CC954311EBCC16E157B334FB00B4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_TransitionResult_1683CCFE436876ED423B3A9060E6DD9E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_TransitionResult_5FDBA41D44487369409D24AAE3F64872();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_BlendListByBool_AFB739774EC15119CB57AAAB70F6E18C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_TransitionResult_A687823C4CB3301EE309A4ADC3383E2D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_TransitionResult_51C4261F4EC24AB39F7EA3B03A9FC646();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_TransitionResult_DF80DD7D4232538DF825459D81176103();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_TransitionResult_407E20204BA6EB4CB4BD45B373661BC1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_TransitionResult_8A61C93F46EC9F56A1FF7B9F0AE674FA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_TransitionResult_EBE8A209462A4835FD0C2ABE210D1AB2();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_TransitionResult_675F5E9B40873C150D986E91FF7607B6();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Lockpicking_AnimBP_AnimGraphNode_TransitionResult_57E6D0E74760AC0414DEE9AF74510310();
    void BlueprintBeginPlay();
    void ExecuteUbergraph_Lockpicking_AnimBP(int32 EntryPoint);
}; // Size: 0x938

#endif
