#ifndef UE4SS_SDK_OrcM_AnimBP_Base_HPP
#define UE4SS_SDK_OrcM_AnimBP_Base_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_2162;                                                        // 0x0004 (size: 0x8)
    FName __NameProperty_2163;                                                        // 0x000C (size: 0x8)
    FName __NameProperty_2164;                                                        // 0x0014 (size: 0x8)
    FName __NameProperty_2165;                                                        // 0x001C (size: 0x8)
    FName __NameProperty_2166;                                                        // 0x0024 (size: 0x8)
    FName __NameProperty_2167;                                                        // 0x002C (size: 0x8)
    TArray<float> __ArrayProperty_2168;                                               // 0x0038 (size: 0x10)
    TArray<int32> __ArrayProperty_2169;                                               // 0x0048 (size: 0x10)
    FName __NameProperty_2170;                                                        // 0x0058 (size: 0x8)
    FName __NameProperty_2171;                                                        // 0x0060 (size: 0x8)
    int32 __IntProperty_2172;                                                         // 0x0068 (size: 0x4)
    FName __NameProperty_2173;                                                        // 0x006C (size: 0x8)
    int32 __IntProperty_2174;                                                         // 0x0074 (size: 0x4)
    FName __NameProperty_2175;                                                        // 0x0078 (size: 0x8)
    int32 __IntProperty_2176;                                                         // 0x0080 (size: 0x4)
    FName __NameProperty_2177;                                                        // 0x0084 (size: 0x8)
    int32 __IntProperty_2178;                                                         // 0x008C (size: 0x4)
    FName __NameProperty_2179;                                                        // 0x0090 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_2180;                                 // 0x0098 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_2181;                                 // 0x00A0 (size: 0x8)
    float __FloatProperty_2182;                                                       // 0x00A8 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_2183;                                 // 0x00B0 (size: 0x8)
    FName __NameProperty_2184;                                                        // 0x00B8 (size: 0x8)
    FName __NameProperty_2185;                                                        // 0x00C0 (size: 0x8)
    float __FloatProperty_2186;                                                       // 0x00C8 (size: 0x4)
    float __FloatProperty_2187;                                                       // 0x00CC (size: 0x4)
    float __FloatProperty_2188;                                                       // 0x00D0 (size: 0x4)
    float __FloatProperty_2189;                                                       // 0x00D4 (size: 0x4)
    TArray<float> __ArrayProperty_2190;                                               // 0x00D8 (size: 0x10)
    FName __NameProperty_2191;                                                        // 0x00E8 (size: 0x8)
    FName __NameProperty_2192;                                                        // 0x00F0 (size: 0x8)
    FName __NameProperty_2193;                                                        // 0x00F8 (size: 0x8)
    FName __NameProperty_2194;                                                        // 0x0100 (size: 0x8)
    FName __NameProperty_2195;                                                        // 0x0108 (size: 0x8)
    FName __NameProperty_2196;                                                        // 0x0110 (size: 0x8)
    FName __NameProperty_2197;                                                        // 0x0118 (size: 0x8)
    FAnimNodeFunctionRef __StructProperty_2198;                                       // 0x0120 (size: 0x20)
    FName __NameProperty_2199;                                                        // 0x0140 (size: 0x8)
    FName __NameProperty_2200;                                                        // 0x0148 (size: 0x8)
    FName __NameProperty_2201;                                                        // 0x0150 (size: 0x8)
    FName __NameProperty_2202;                                                        // 0x0158 (size: 0x8)
    FName __NameProperty_2203;                                                        // 0x0160 (size: 0x8)
    FName __NameProperty_2204;                                                        // 0x0168 (size: 0x8)
    FName __NameProperty_2205;                                                        // 0x0170 (size: 0x8)
    int32 __IntProperty_2206;                                                         // 0x0178 (size: 0x4)
    int32 __IntProperty_2207;                                                         // 0x017C (size: 0x4)
    int32 __IntProperty_2208;                                                         // 0x0180 (size: 0x4)
    FName __NameProperty_2209;                                                        // 0x0184 (size: 0x8)
    TArray<float> __ArrayProperty_2210;                                               // 0x0190 (size: 0x10)
    TArray<float> __ArrayProperty_2211;                                               // 0x01A0 (size: 0x10)
    TArray<int32> __ArrayProperty_2212;                                               // 0x01B0 (size: 0x10)
    EAnimSyncMethod __EnumProperty_2213;                                              // 0x01C0 (size: 0x1)
    FName __NameProperty_2214;                                                        // 0x01C4 (size: 0x8)
    FName __NameProperty_2215;                                                        // 0x01CC (size: 0x8)
    FName __NameProperty_2216;                                                        // 0x01D4 (size: 0x8)
    FName __NameProperty_2217;                                                        // 0x01DC (size: 0x8)
    FName __NameProperty_2218;                                                        // 0x01E4 (size: 0x8)
    int32 __IntProperty_2219;                                                         // 0x01EC (size: 0x4)
    FName __NameProperty_2220;                                                        // 0x01F0 (size: 0x8)
    FName __NameProperty_2221;                                                        // 0x01F8 (size: 0x8)
    FName __NameProperty_2222;                                                        // 0x0200 (size: 0x8)
    int32 __IntProperty_2223;                                                         // 0x0208 (size: 0x4)
    FName __NameProperty_2224;                                                        // 0x020C (size: 0x8)
    FName __NameProperty_2225;                                                        // 0x0214 (size: 0x8)
    TArray<float> __ArrayProperty_2226;                                               // 0x0220 (size: 0x10)
    TArray<int32> __ArrayProperty_2227;                                               // 0x0230 (size: 0x10)
    TArray<float> __ArrayProperty_2228;                                               // 0x0240 (size: 0x10)
    FName __NameProperty_2229;                                                        // 0x0250 (size: 0x8)
    TArray<float> __ArrayProperty_2230;                                               // 0x0258 (size: 0x10)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_2231;                       // 0x0268 (size: 0x1)
    class UAnimSequenceBase* __AnimSequenceBase_2232;                                 // 0x0270 (size: 0x8)
    TArray<float> __ArrayProperty_2233;                                               // 0x0278 (size: 0x10)
    FName __NameProperty_2234;                                                        // 0x0288 (size: 0x8)
    FName __NameProperty_2235;                                                        // 0x0290 (size: 0x8)
    FName __NameProperty_2236;                                                        // 0x0298 (size: 0x8)
    FName __NameProperty_2237;                                                        // 0x02A0 (size: 0x8)
    FName __NameProperty_2238;                                                        // 0x02A8 (size: 0x8)
    int32 __IntProperty_2239;                                                         // 0x02B0 (size: 0x4)
    FName __NameProperty_2240;                                                        // 0x02B4 (size: 0x8)
    FName __NameProperty_2241;                                                        // 0x02BC (size: 0x8)
    FName __NameProperty_2242;                                                        // 0x02C4 (size: 0x8)
    FName __NameProperty_2243;                                                        // 0x02CC (size: 0x8)
    FName __NameProperty_2244;                                                        // 0x02D4 (size: 0x8)
    FName __NameProperty_2245;                                                        // 0x02DC (size: 0x8)
    FName __NameProperty_2246;                                                        // 0x02E4 (size: 0x8)
    class UBlendProfile* __BlendProfile_2247;                                         // 0x02F0 (size: 0x8)
    class UCurveFloat* __CurveFloat_2248;                                             // 0x02F8 (size: 0x8)
    EAlphaBlendOption __EnumProperty_2249;                                            // 0x0300 (size: 0x1)
    EBlendListTransitionType __EnumProperty_2250;                                     // 0x0301 (size: 0x1)
    TArray<float> __ArrayProperty_2251;                                               // 0x0308 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_2252;                                       // 0x0318 (size: 0x20)
    bool __BoolProperty_2253;                                                         // 0x0338 (size: 0x1)
    float __FloatProperty_2254;                                                       // 0x033C (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_2255;                              // 0x0340 (size: 0x2C)
    float __FloatProperty_2256;                                                       // 0x036C (size: 0x4)
    bool __BoolProperty_2257;                                                         // 0x0370 (size: 0x1)
    EAnimSyncMethod __EnumProperty_2258;                                              // 0x0371 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2259;                            // 0x0372 (size: 0x1)
    FName __NameProperty_2260;                                                        // 0x0374 (size: 0x8)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0380 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0400 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_6;          // 0x0418 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_56;       // 0x0448 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_55;       // 0x0478 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_54;       // 0x04A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_78;    // 0x04D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_77;    // 0x0508 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_76;    // 0x0538 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_75;    // 0x0568 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_74;    // 0x0598 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_73;    // 0x05C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_72;    // 0x05F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_33;         // 0x0628 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_53;       // 0x0658 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_52;       // 0x0688 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_51;       // 0x06B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_50;       // 0x06E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_MultiWayBlend_5;        // 0x0718 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_45;         // 0x0748 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_32;         // 0x0778 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_49;       // 0x07A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_48;       // 0x07D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_MultiWayBlend_4;        // 0x0808 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_47;       // 0x0838 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_46;       // 0x0868 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_44;         // 0x0898 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_31;         // 0x08C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_45;       // 0x08F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_44;       // 0x0928 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_MultiWayBlend_3;        // 0x0958 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_43;       // 0x0988 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_42;       // 0x09B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_43;         // 0x09E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_30;         // 0x0A18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_41;       // 0x0A48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_40;       // 0x0A78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_39;       // 0x0AA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_38;       // 0x0AD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_MultiWayBlend_2;        // 0x0B08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_42;         // 0x0B38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_37;       // 0x0B68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_36;       // 0x0B98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_35;       // 0x0BC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_34;       // 0x0BF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_29;         // 0x0C28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_MultiWayBlend_1;        // 0x0C58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_41;         // 0x0C88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_33;       // 0x0CB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_32;       // 0x0CE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_31;       // 0x0D18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_30;       // 0x0D48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_28;         // 0x0D78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_MultiWayBlend;          // 0x0DA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_40;         // 0x0DD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_13;        // 0x0E08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_21;     // 0x0E38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_3;      // 0x0E68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_20;     // 0x0E98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_19;     // 0x0EC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_18;     // 0x0EF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_17;     // 0x0F28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_16;     // 0x0F58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_15;     // 0x0F88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_11;                // 0x0FB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_71;    // 0x0FE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_70;    // 0x1018 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_69;    // 0x1048 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_68;    // 0x1078 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_67;    // 0x10A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_66;    // 0x10D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_65;    // 0x1108 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_64;    // 0x1138 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_63;    // 0x1168 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_62;    // 0x1198 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_61;    // 0x11C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_60;    // 0x11F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_59;    // 0x1228 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_58;    // 0x1258 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_57;    // 0x1288 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_56;    // 0x12B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_55;    // 0x12E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_54;    // 0x1318 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_53;    // 0x1348 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_52;    // 0x1378 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_51;    // 0x13A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_50;    // 0x13D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_49;    // 0x1408 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_48;    // 0x1438 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_47;    // 0x1468 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_46;    // 0x1498 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_27;      // 0x14C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_27;         // 0x14F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_39;         // 0x1528 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_26;      // 0x1558 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_9;        // 0x1588 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_29;       // 0x15B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_26;         // 0x15E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_38;         // 0x1618 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_28;       // 0x1648 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_25;         // 0x1678 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_37;         // 0x16A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_45;    // 0x16D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_25;      // 0x1708 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_24;         // 0x1738 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_36;         // 0x1768 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_44;    // 0x1798 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_43;    // 0x17C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_24;      // 0x17F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_23;         // 0x1828 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_35;         // 0x1858 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_7;    // 0x1888 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_9;      // 0x18B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_6;    // 0x18E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_22;         // 0x1918 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_5;          // 0x1948 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_5;    // 0x1978 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_4;          // 0x19A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_42;    // 0x19D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_41;    // 0x1A08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_3;          // 0x1A38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_23;      // 0x1A68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_22;      // 0x1A98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_34;         // 0x1AC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_21;      // 0x1AF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_20;      // 0x1B28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_19;      // 0x1B58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_18;      // 0x1B88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_2;          // 0x1BB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_2;      // 0x1BE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_33;         // 0x1C18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_32;         // 0x1C48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_12;        // 0x1C78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_31;         // 0x1CA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;      // 0x1CD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_21;         // 0x1D08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_30;         // 0x1D38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_27;       // 0x1D68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_20;         // 0x1D98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_29;         // 0x1DC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_11;        // 0x1DF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_40;    // 0x1E28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_39;    // 0x1E58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_38;    // 0x1E88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_37;    // 0x1EB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_36;    // 0x1EE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_35;    // 0x1F18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_34;    // 0x1F48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_8;        // 0x1F78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_6;     // 0x1FA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_26;       // 0x1FD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_25;       // 0x2008 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_6;      // 0x2038 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_24;       // 0x2068 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_19;         // 0x2098 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_28;         // 0x20C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot_1;         // 0x20F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_27;         // 0x2128 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;      // 0x2158 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_26;         // 0x2188 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;      // 0x21B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_25;         // 0x21E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_24;         // 0x2218 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_10;        // 0x2248 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_15;                // 0x2278 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_21;      // 0x22A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_20;      // 0x22D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization;        // 0x2308 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_33;    // 0x2338 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_32;    // 0x2368 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_31;    // 0x2398 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_30;    // 0x23C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_29;    // 0x23F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_28;    // 0x2428 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_27;    // 0x2458 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_26;    // 0x2488 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_25;    // 0x24B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_24;    // 0x24E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_23;    // 0x2518 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_18;         // 0x2548 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;      // 0x2578 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_17;         // 0x25A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_23;         // 0x25D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_16;         // 0x2608 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;      // 0x2638 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_15;         // 0x2668 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_22;         // 0x2698 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_23;       // 0x26C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_21;         // 0x26F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_22;       // 0x2728 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_20;         // 0x2758 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_21;       // 0x2788 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_14;                // 0x27B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_14;         // 0x27E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_19;         // 0x2818 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_13;                // 0x2848 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_13;         // 0x2878 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;      // 0x28A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_18;         // 0x28D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_9;         // 0x2908 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_7;        // 0x2938 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_22;    // 0x2968 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_21;    // 0x2998 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_4;    // 0x29C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;      // 0x29F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_12;         // 0x2A28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_6;        // 0x2A58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_17;         // 0x2A88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_11;         // 0x2AB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_3;    // 0x2AE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_16;         // 0x2B18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_8;         // 0x2B48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_10;         // 0x2B78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_12;                // 0x2BA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_15;         // 0x2BD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_7;         // 0x2C08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_19;      // 0x2C38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_18;      // 0x2C68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_20;    // 0x2C98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_19;    // 0x2CC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_18;    // 0x2CF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_17;    // 0x2D28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;    // 0x2D58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;    // 0x2D88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;    // 0x2DB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;    // 0x2DE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;    // 0x2E18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x2E48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_20;       // 0x2E78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_14;         // 0x2EA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;      // 0x2ED8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_19;       // 0x2F08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_5;        // 0x2F38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_13;         // 0x2F68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x2F98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_18;       // 0x2FC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_12;         // 0x2FF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_17;       // 0x3028 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_11;         // 0x3058 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;       // 0x3088 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_16;       // 0x30B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_4;        // 0x30E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_10;         // 0x3118 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_6;         // 0x3148 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_3;        // 0x3178 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_2;        // 0x31A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;       // 0x31D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;       // 0x3208 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_5;     // 0x3238 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_8;      // 0x3268 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_7;      // 0x3298 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_4;     // 0x32C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_1;      // 0x32F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_3;     // 0x3328 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;     // 0x3358 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_3; // 0x3388 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_3; // 0x33B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_12;          // 0x33E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;     // 0x3418 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;        // 0x3448 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;       // 0x3478 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x34A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_1;          // 0x34D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;          // 0x3508 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_5;         // 0x3538 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x3568 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_15;       // 0x3598 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_9;          // 0x35C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;          // 0x35F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;          // 0x3628 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_4;         // 0x3658 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_17;      // 0x3688 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_11;                // 0x36B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_16;      // 0x36E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x3718 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;          // 0x3748 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_3;         // 0x3778 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_15;      // 0x37A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x37D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x3808 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x3838 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x3868 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x3898 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x38C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x38F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_14;       // 0x3928 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;          // 0x3958 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;          // 0x3988 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x39B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_13;       // 0x39E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x3A18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_12;       // 0x3A48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x3A78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_2;         // 0x3AA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x3AD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x3B08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_11;       // 0x3B38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x3B68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x3B98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_8;          // 0x3BC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_10;                // 0x3BF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_7;          // 0x3C28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x3C58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;         // 0x3C88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_14;      // 0x3CB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_10;                // 0x3CE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_5;      // 0x3D18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_13;      // 0x3D48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_12;      // 0x3D78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_11;      // 0x3DA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;        // 0x3DD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_4;      // 0x3E08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_9;                 // 0x3E38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_8;                 // 0x3E68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_7;                 // 0x3E98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_10;      // 0x3EC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_10;       // 0x3EF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_3;      // 0x3F28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_6;                 // 0x3F58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_2;      // 0x3F88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_5;                 // 0x3FB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_2;    // 0x3FE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;    // 0x4018 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_9;       // 0x4048 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_6;      // 0x4078 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_11;          // 0x40A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_10;          // 0x40D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_9;           // 0x4108 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_8;           // 0x4138 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_2; // 0x4168 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend;            // 0x4198 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_2; // 0x41C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_8;       // 0x41F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_9;        // 0x4228 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_8;        // 0x4258 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_1;      // 0x4288 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_1;     // 0x42B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_4;                 // 0x42E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_3;                 // 0x4318 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_7;       // 0x4348 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_6;       // 0x4378 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_6;          // 0x43A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_5;      // 0x43D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_5;       // 0x4408 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_7;        // 0x4438 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_6;        // 0x4468 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_4;       // 0x4498 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;        // 0x44C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;        // 0x44F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x4528 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;       // 0x4558 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;       // 0x4588 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_5;          // 0x45B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_9;                 // 0x45E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x4618 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;        // 0x4648 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_4;          // 0x4678 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x46A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_4;      // 0x46D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;      // 0x4708 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer;        // 0x4738 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_3;      // 0x4768 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;        // 0x4798 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x47C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1; // 0x47F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x4828 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_3;          // 0x4858 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_52;        // 0x4888 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_2;          // 0x48B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x48E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x4918 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_51;        // 0x4948 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_50;        // 0x4978 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_1;          // 0x49A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_49;        // 0x49D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_48;        // 0x4A08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_47;        // 0x4A38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_46;        // 0x4A68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_45;        // 0x4A98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x4AC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_44;        // 0x4AF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_43;        // 0x4B28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_42;        // 0x4B58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_41;        // 0x4B88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_40;        // 0x4BB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_39;        // 0x4BE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess GateShadowGraphNode_Base;             // 0x4C18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_38;        // 0x4C48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_7;           // 0x4C78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_37;        // 0x4CA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_6;           // 0x4CD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_5;           // 0x4D08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_36;        // 0x4D38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_35;        // 0x4D68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_34;        // 0x4D98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_33;        // 0x4DC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_32;        // 0x4DF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_31;        // 0x4E28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_30;        // 0x4E58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_4;           // 0x4E88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_29;        // 0x4EB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_28;        // 0x4EE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_3;           // 0x4F18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_2;           // 0x4F48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_27;        // 0x4F78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;           // 0x4FA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x4FD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_26;        // 0x5008 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_25;        // 0x5038 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_24;        // 0x5068 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_23;        // 0x5098 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1; // 0x50C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_22;        // 0x50F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x5128 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RandomPlayer;           // 0x5158 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_21;        // 0x5188 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_20;        // 0x51B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_19;        // 0x51E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_18;        // 0x5218 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_17;        // 0x5248 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x5278 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_16;        // 0x52A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_15;        // 0x52D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_14;        // 0x5308 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_13;        // 0x5338 (size: 0x30)
    FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose_14;                    // 0x5368 (size: 0x8)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_8;                 // 0x5370 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_12;        // 0x53A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x53D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_13;     // 0x5400 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_7;                 // 0x5430 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_11;        // 0x5460 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_10;        // 0x5490 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_9;         // 0x54C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_8;         // 0x54F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_7;         // 0x5520 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_12;     // 0x5550 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_6;         // 0x5580 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_11;     // 0x55B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_10;     // 0x55E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_6;                 // 0x5610 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_5;         // 0x5640 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot;           // 0x5670 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x56A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x56D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x5700 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve;            // 0x5730 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_4;         // 0x5760 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_3;         // 0x5790 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_2;         // 0x57C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_9;      // 0x57F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_5;                 // 0x5820 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_8;      // 0x5850 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                 // 0x5880 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_1;         // 0x58B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_7;      // 0x58E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_6;      // 0x5910 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics;           // 0x5940 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_5;      // 0x5970 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                 // 0x59A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_4;      // 0x59D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                 // 0x5A00 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x5A30 (size: 0x30)
    FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose_3;                     // 0x5A60 (size: 0x8)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                 // 0x5A68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_2;      // 0x5A98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;      // 0x5AC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;        // 0x5AF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x5B28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x5B58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x5B88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x5BB8 (size: 0x30)

}; // Size: 0x5BE8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    float __FloatProperty_1;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_4;                                                          // 0x0010 (size: 0x4)
    uint8 __ByteProperty_5;                                                           // 0x0014 (size: 0x1)
    float __FloatProperty_6;                                                          // 0x0018 (size: 0x4)
    float __FloatProperty_7;                                                          // 0x001C (size: 0x4)
    float __FloatProperty_8;                                                          // 0x0020 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x0024 (size: 0x4)
    float __FloatProperty_10;                                                         // 0x0028 (size: 0x4)
    float __FloatProperty_11;                                                         // 0x002C (size: 0x4)
    float __FloatProperty_12;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_14;                                                         // 0x0038 (size: 0x4)
    bool __BoolProperty_15;                                                           // 0x003C (size: 0x1)
    bool __BoolProperty_16;                                                           // 0x003D (size: 0x1)
    float __FloatProperty_17;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_18;                                                         // 0x0044 (size: 0x4)
    float __FloatProperty_19;                                                         // 0x0048 (size: 0x4)
    uint8 __ByteProperty_20;                                                          // 0x004C (size: 0x1)
    float __FloatProperty_21;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_22;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_23;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_24;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_25;                                                         // 0x0060 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x0064 (size: 0x4)
    float __FloatProperty_27;                                                         // 0x0068 (size: 0x4)
    float __FloatProperty_28;                                                         // 0x006C (size: 0x4)
    float __FloatProperty_29;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_30;                                                         // 0x0074 (size: 0x4)
    float __FloatProperty_31;                                                         // 0x0078 (size: 0x4)
    float __FloatProperty_32;                                                         // 0x007C (size: 0x4)
    float __FloatProperty_33;                                                         // 0x0080 (size: 0x4)
    uint8 __ByteProperty_34;                                                          // 0x0084 (size: 0x1)
    bool __BoolProperty_35;                                                           // 0x0085 (size: 0x1)
    bool __BoolProperty_36;                                                           // 0x0086 (size: 0x1)
    bool __BoolProperty_37;                                                           // 0x0087 (size: 0x1)
    bool __BoolProperty_38;                                                           // 0x0088 (size: 0x1)
    bool __BoolProperty_39;                                                           // 0x0089 (size: 0x1)
    bool __BoolProperty_40;                                                           // 0x008A (size: 0x1)
    bool __BoolProperty_41;                                                           // 0x008B (size: 0x1)

}; // Size: 0x8C

class UOrcM_AnimBP_Base_C : public UBipedLocomotionAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x09E0 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x09E8 (size: 0x8C)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0A78 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0A80 (size: 0x8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6;                                // 0x0A88 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56;                           // 0x0B50 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55;                           // 0x0B78 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54;                           // 0x0BA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x0BC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x0BF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x0C18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x0C40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x0C68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x0C90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x0CB8 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_33;                               // 0x0CE0 (size: 0x120)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53;                           // 0x0E00 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52;                           // 0x0E28 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51;                           // 0x0E50 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50;                           // 0x0E78 (size: 0x28)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_5;                            // 0x0EA0 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x0EF0 (size: 0x20)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_32;                               // 0x0F10 (size: 0x120)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49;                           // 0x1030 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48;                           // 0x1058 (size: 0x28)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_4;                            // 0x1080 (size: 0x50)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47;                           // 0x10D0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46;                           // 0x10F8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x1120 (size: 0x20)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_31;                               // 0x1140 (size: 0x120)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45;                           // 0x1260 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44;                           // 0x1288 (size: 0x28)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_3;                            // 0x12B0 (size: 0x50)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43;                           // 0x1300 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42;                           // 0x1328 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x1350 (size: 0x20)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_30;                               // 0x1370 (size: 0x120)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41;                           // 0x1490 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40;                           // 0x14B8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39;                           // 0x14E0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38;                           // 0x1508 (size: 0x28)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_2;                            // 0x1530 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x1580 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37;                           // 0x15A0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36;                           // 0x15C8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35;                           // 0x15F0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34;                           // 0x1618 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_29;                               // 0x1640 (size: 0x120)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_1;                            // 0x1760 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x17B0 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33;                           // 0x17D0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32;                           // 0x17F8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31;                           // 0x1820 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30;                           // 0x1848 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_28;                               // 0x1870 (size: 0x120)
    FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend;                              // 0x1990 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x19E0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x1A00 (size: 0xC8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_21;                       // 0x1AC8 (size: 0xB8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x1B80 (size: 0x48)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_20;                       // 0x1BC8 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_19;                       // 0x1C80 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_18;                       // 0x1D38 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_17;                       // 0x1DF0 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_16;                       // 0x1EA8 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_15;                       // 0x1F60 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_11;                                             // 0x2018 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x2038 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x2060 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x2088 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x20B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x20D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x2100 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x2128 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x2150 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x2178 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x21A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x21C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x21F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x2218 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x2240 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x2268 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x2290 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x22B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x22E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x2308 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x2330 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x2358 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x2380 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x23A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x23D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x23F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x2420 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x2448 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_27;                               // 0x2490 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x25B0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x25D0 (size: 0x48)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9;                            // 0x2618 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29;                           // 0x26E0 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_26;                               // 0x2708 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x2828 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28;                           // 0x2848 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_25;                               // 0x2870 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x2990 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x29B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x29D8 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_24;                               // 0x2A20 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x2B40 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x2B60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x2B88 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x2BB0 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_23;                               // 0x2BF8 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x2D18 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7;                    // 0x2D38 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x2D78 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6;                    // 0x2DC0 (size: 0x40)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_22;                               // 0x2E00 (size: 0x120)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5;                                // 0x2F20 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5;                    // 0x2FE8 (size: 0x40)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4;                                // 0x3028 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x30F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x3118 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3;                                // 0x3140 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x3208 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x3250 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x3298 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x32B8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x3300 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x3348 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x3390 (size: 0x48)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2;                                // 0x33D8 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x34A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x34E8 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x3508 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x3528 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x35F0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x3610 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_21;                               // 0x3658 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x3778 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27;                           // 0x3798 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_20;                               // 0x37C0 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x38E0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x3900 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x39C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x39F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x3A18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x3A40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x3A68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x3A90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x3AB8 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8;                            // 0x3AE0 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x3BA8 (size: 0x70)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;                           // 0x3C18 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x3C40 (size: 0x28)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_6;                        // 0x3C68 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x3D30 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_19;                               // 0x3D58 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x3E78 (size: 0x20)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot_1;                              // 0x3E98 (size: 0x90)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x3F28 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x3F48 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x3F90 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x3FB0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x3FF8 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x4018 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x4038 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_15;                                             // 0x4100 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21;                         // 0x4148 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20;                         // 0x41C8 (size: 0x80)
    FAnimNode_Inertialization AnimGraphNode_Inertialization;                          // 0x4250 (size: 0x440)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x4690 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x46B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x46E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x4708 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x4730 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x4758 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x4780 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x47A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x47D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x47F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x4820 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_18;                               // 0x4848 (size: 0x120)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x4968 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_17;                               // 0x49B0 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x4AD0 (size: 0x20)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_16;                               // 0x4AF0 (size: 0x120)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x4C10 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_15;                               // 0x4C58 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x4D78 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x4D98 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x4DC0 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x4DE0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x4E08 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x4E28 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_14;                                             // 0x4E50 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_14;                               // 0x4E98 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x4FB8 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_13;                                             // 0x4FD8 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_13;                               // 0x5020 (size: 0x120)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x5140 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x5188 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x51A8 (size: 0xC8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7;                            // 0x5270 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x5338 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x5360 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x5388 (size: 0x40)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x53C8 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_12;                               // 0x5410 (size: 0x120)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6;                            // 0x5530 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x55F8 (size: 0x20)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_11;                               // 0x5618 (size: 0x120)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x5738 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x5778 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x5798 (size: 0xC8)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_10;                               // 0x5860 (size: 0x120)
    FAnimNode_Slot AnimGraphNode_Slot_12;                                             // 0x5980 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x59C8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x59E8 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19;                         // 0x5AB0 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18;                         // 0x5B30 (size: 0x80)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x5BB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x5BD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x5C00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x5C28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x5C50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x5C78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x5CA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x5CC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x5CF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x5D18 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x5D40 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x5D68 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x5D88 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x5DD0 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5;                            // 0x5DF8 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x5EC0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x5EE0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x5F08 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x5F30 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x5F50 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x5F78 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x5F98 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x5FE0 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;                            // 0x6008 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x60D0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x60F0 (size: 0xC8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;                            // 0x61B8 (size: 0xC8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;                            // 0x6280 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x6348 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x6390 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x63D8 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x6448 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x6490 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x64D8 (size: 0x70)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x6548 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x6590 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x6600 (size: 0x70)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x6670 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x6690 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12;                                 // 0x66B0 (size: 0x128)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x67D8 (size: 0x70)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x6848 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x6910 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x6958 (size: 0x48)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0x69A0 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x6A68 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x6A88 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x6B50 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x6B78 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_9;                                // 0x6BA0 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x6CC0 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x6CE0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x6D00 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17;                         // 0x6DC8 (size: 0x80)
    FAnimNode_Slot AnimGraphNode_Slot_11;                                             // 0x6E48 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16;                         // 0x6E90 (size: 0x80)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x6F10 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x6F80 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x6FA0 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15;                         // 0x7068 (size: 0x80)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x70E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x7110 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x7138 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x7160 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x7188 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x71B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x71D8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x7220 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x7248 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x7310 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x7330 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x7358 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x7380 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x73A0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x73C8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x73E8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x74B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x74D8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x7500 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x7528 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x7548 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_8;                                // 0x7590 (size: 0x120)
    FAnimNode_Slot AnimGraphNode_Slot_10;                                             // 0x76B0 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_7;                                // 0x76F8 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x7818 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x7838 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14;                         // 0x7900 (size: 0x80)
    FAnimNode_Root AnimGraphNode_Root_10;                                             // 0x7980 (size: 0x20)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5;                        // 0x79A0 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13;                         // 0x7A68 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12;                         // 0x7AE8 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11;                         // 0x7B68 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x7BE8 (size: 0x48)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4;                        // 0x7C30 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_9;                                              // 0x7CF8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_8;                                              // 0x7D40 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_7;                                              // 0x7D88 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;                         // 0x7DD0 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x7E50 (size: 0x28)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3;                        // 0x7E78 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_6;                                              // 0x7F40 (size: 0x48)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2;                        // 0x7F88 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x8050 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x8098 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x80D8 (size: 0x40)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x8118 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x8198 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11;                                 // 0x81E0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10;                                 // 0x8308 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9;                                  // 0x8430 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8;                                  // 0x8558 (size: 0x128)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x8680 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x86A0 (size: 0xC8)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x8768 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x8788 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x8808 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x8830 (size: 0x28)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_1;                        // 0x8858 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x8920 (size: 0xF0)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x8A10 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x8A58 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x8AA0 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x8B20 (size: 0x80)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_6;                                // 0x8BA0 (size: 0x120)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x8CC0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x8D08 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x8D88 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x8DB0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x8DD8 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x8E58 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x8E80 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x8EA8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x8EF0 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x8F70 (size: 0x80)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_5;                                // 0x8FF0 (size: 0x120)
    FAnimNode_Root AnimGraphNode_Root_9;                                              // 0x9110 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x9130 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x9178 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_4;                                // 0x91A0 (size: 0x120)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x92C0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x9308 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x9350 (size: 0x40)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0x9390 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x9458 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x94A0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x94C8 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x94F0 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x9510 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_3;                                // 0x9538 (size: 0x120)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_52;                             // 0x9660 (size: 0x520)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_2;                                // 0x9B80 (size: 0x120)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x9CA0 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x9D20 (size: 0x48)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_51;                             // 0x9D70 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_50;                             // 0xA290 (size: 0x520)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_1;                                // 0xA7B0 (size: 0x120)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_49;                             // 0xA8D0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_48;                             // 0xADF0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_47;                             // 0xB310 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_46;                             // 0xB830 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_45;                             // 0xBD50 (size: 0x520)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0xC270 (size: 0xF0)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_44;                             // 0xC360 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_43;                             // 0xC880 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_42;                             // 0xCDA0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_41;                             // 0xD2C0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_40;                             // 0xD7E0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_39;                             // 0xDD00 (size: 0x520)
    FGateShadowAnimNode GateShadowGraphNode_Base;                                     // 0xE220 (size: 0x198)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_38;                             // 0xE3C0 (size: 0x520)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7;                                  // 0xE8E0 (size: 0x128)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_37;                             // 0xEA10 (size: 0x520)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6;                                  // 0xEF30 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0xF058 (size: 0x128)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_36;                             // 0xF180 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_35;                             // 0xF6A0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_34;                             // 0xFBC0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_33;                             // 0x100E0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_32;                             // 0x10600 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_31;                             // 0x10B20 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_30;                             // 0x11040 (size: 0x520)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x11560 (size: 0x128)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_29;                             // 0x11690 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_28;                             // 0x11BB0 (size: 0x520)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x120D0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x121F8 (size: 0x128)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_27;                             // 0x12320 (size: 0x520)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x12840 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x12968 (size: 0x128)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_26;                             // 0x12A90 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_25;                             // 0x12FB0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_24;                             // 0x134D0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_23;                             // 0x139F0 (size: 0x520)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x13F10 (size: 0x20)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_22;                             // 0x13F30 (size: 0x520)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x14450 (size: 0x20)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;                                // 0x14470 (size: 0x78)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_21;                             // 0x144F0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_20;                             // 0x14A10 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_19;                             // 0x14F30 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_18;                             // 0x15450 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_17;                             // 0x15970 (size: 0x520)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x15E90 (size: 0x48)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_16;                             // 0x15EE0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_15;                             // 0x16400 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_14;                             // 0x16920 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_13;                             // 0x16E40 (size: 0x520)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_14;                       // 0x17360 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_8;                                              // 0x17418 (size: 0x20)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12;                             // 0x17440 (size: 0x520)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x17960 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_13;                       // 0x17980 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_7;                                              // 0x17A38 (size: 0x20)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11;                             // 0x17A60 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10;                             // 0x17F80 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9;                              // 0x184A0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8;                              // 0x189C0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7;                              // 0x18EE0 (size: 0x520)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_12;                       // 0x19400 (size: 0xB8)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6;                              // 0x194C0 (size: 0x520)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_11;                       // 0x199E0 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_10;                       // 0x19A98 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_6;                                              // 0x19B50 (size: 0x20)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5;                              // 0x19B70 (size: 0x520)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot;                                // 0x1A090 (size: 0x90)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x1A120 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1A140 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1A208 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve;                                  // 0x1A250 (size: 0x120)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4;                              // 0x1A370 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3;                              // 0x1A890 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2;                              // 0x1ADB0 (size: 0x520)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_9;                        // 0x1B2D0 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_5;                                              // 0x1B388 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_8;                        // 0x1B3A8 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_4;                                              // 0x1B460 (size: 0x20)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_1;                              // 0x1B480 (size: 0x520)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7;                        // 0x1B9A0 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6;                        // 0x1BA58 (size: 0xB8)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics;                                // 0x1BB10 (size: 0x520)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5;                        // 0x1C030 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_3;                                              // 0x1C0E8 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4;                        // 0x1C108 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_2;                                              // 0x1C1C0 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x1C1E0 (size: 0x80)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3;                        // 0x1C260 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x1C318 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x1C338 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x1C3F0 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x1C4A8 (size: 0xB8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x1C560 (size: 0x48)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x1C5A8 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x1C5C8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x1C610 (size: 0x48)
    bool K2Node_PropertyAccess_97;                                                    // 0x1C658 (size: 0x1)
    FVector K2Node_PropertyAccess_95;                                                 // 0x1C660 (size: 0x18)
    FRotator K2Node_PropertyAccess_94;                                                // 0x1C678 (size: 0x18)
    bool __CustomProperty_IsDrawingWeapon_EA29154841BA88A7DC167D938F86B56F;           // 0x1C690 (size: 0x1)
    bool __CustomProperty_IsAttacking_EA29154841BA88A7DC167D938F86B56F;               // 0x1C691 (size: 0x1)
    bool __CustomProperty_IsStopping_EA29154841BA88A7DC167D938F86B56F;                // 0x1C692 (size: 0x1)
    bool __CustomProperty_HasWeapon_EA29154841BA88A7DC167D938F86B56F;                 // 0x1C693 (size: 0x1)
    bool __CustomProperty_IsTurning_EA29154841BA88A7DC167D938F86B56F;                 // 0x1C694 (size: 0x1)
    bool __CustomProperty_isInDialog_EA29154841BA88A7DC167D938F86B56F;                // 0x1C695 (size: 0x1)
    double __CustomProperty_ArmL_Corr_EA29154841BA88A7DC167D938F86B56F;               // 0x1C698 (size: 0x8)
    double __CustomProperty_ArmR_Corr_EA29154841BA88A7DC167D938F86B56F;               // 0x1C6A0 (size: 0x8)
    double __CustomProperty_AlphaArmL_EA29154841BA88A7DC167D938F86B56F;               // 0x1C6A8 (size: 0x8)
    double __CustomProperty_AlphaArmR_EA29154841BA88A7DC167D938F86B56F;               // 0x1C6B0 (size: 0x8)
    EMovementState __CustomProperty_MovementState_EA29154841BA88A7DC167D938F86B56F;   // 0x1C6B8 (size: 0x1)
    double __CustomProperty_SpineCorrAlpha_EA29154841BA88A7DC167D938F86B56F;          // 0x1C6C0 (size: 0x8)
    double __CustomProperty_CharacterSpeed_EA29154841BA88A7DC167D938F86B56F;          // 0x1C6C8 (size: 0x8)
    double __CustomProperty_AngleBwVectors_EA29154841BA88A7DC167D938F86B56F;          // 0x1C6D0 (size: 0x8)
    FGameplayTag __CustomProperty_WeaponTag_EA29154841BA88A7DC167D938F86B56F;         // 0x1C6D8 (size: 0x8)
    bool __CustomProperty_ShouldMove_EA29154841BA88A7DC167D938F86B56F;                // 0x1C6E0 (size: 0x1)
    bool __CustomProperty_IsTargeting_EA29154841BA88A7DC167D938F86B56F;               // 0x1C6E1 (size: 0x1)
    EMovementState previousMovementState;                                             // 0x1C6E2 (size: 0x1)
    EMovementState actualMovementState;                                               // 0x1C6E3 (size: 0x1)
    class UAnimationAsset* EmptyAsset;                                                // 0x1C6E8 (size: 0x8)
    bool Finish Breaker;                                                              // 0x1C6F0 (size: 0x1)
    bool IsAttacking;                                                                 // 0x1C6F1 (size: 0x1)
    double AlphaValue;                                                                // 0x1C6F8 (size: 0x8)
    double AngleBetweenVectors;                                                       // 0x1C700 (size: 0x8)
    bool CalculateAttackArmCorr;                                                      // 0x1C708 (size: 0x1)
    bool UseOnlyArmCorr;                                                              // 0x1C709 (size: 0x1)
    double AttackArmCorrection_Generic;                                               // 0x1C710 (size: 0x8)
    double AttackArmCorrectionR;                                                      // 0x1C718 (size: 0x8)
    double AttackArmCorrectionL;                                                      // 0x1C720 (size: 0x8)
    double Alpha Value Arm R;                                                         // 0x1C728 (size: 0x8)
    double Alpha Value Arm L;                                                         // 0x1C730 (size: 0x8)
    EAttackHandle Attack Handle;                                                      // 0x1C738 (size: 0x1)
    FVector PlayerLocation;                                                           // 0x1C740 (size: 0x18)
    FVector MagnetTargetLocation;                                                     // 0x1C758 (size: 0x18)
    class UAnimSequenceBase* FacialMoodSequence;                                      // 0x1C770 (size: 0x8)
    bool SkipFacials;                                                                 // 0x1C778 (size: 0x1)
    TMap<int32, int32> Bones Remapping;                                               // 0x1C780 (size: 0x50)
    TMap<int32, int32> OrcF Bones Remapping;                                          // 0x1C7D0 (size: 0x50)
    bool IsDrawingWeapon;                                                             // 0x1C820 (size: 0x1)

    void LayerBlending(FPoseLink Base Layer, FPoseLink Overlay Layer, FPoseLink Additive Base Pose, FPoseLink& LayerBlending);
    void Landing Combat(FPoseLink Default Land, FPoseLink& Landing Combat);
    void Flying Cycle Combat(FPoseLink InPose_0, FPoseLink& Flying Cycle Combat);
    void BaseBody Combat(FPoseLink BaseBody, FPoseLink N Pose, FPoseLink STR Pose, FPoseLink& BaseBody Combat);
    void UpperBody Combat(FPoseLink UpperBody, FPoseLink& UpperBody Combat);
    void PostLayering Combat(FPoseLink PostLayering In, FPoseLink& PostLayering Combat);
    void STL BaseBody Combat(FPoseLink InPose, FPoseLink STL Loco Pose, FPoseLink STL STR Pose, FPoseLink& STL BaseBody Combat);
