#ifndef UE4SS_SDK_OrcMLayerBlending_AnimBP_HPP
#define UE4SS_SDK_OrcMLayerBlending_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_242;                                                         // 0x0004 (size: 0x8)
    FAnimNodeFunctionRef __StructProperty_243;                                        // 0x0010 (size: 0x20)
    FName __NameProperty_244;                                                         // 0x0030 (size: 0x8)
    FName __NameProperty_245;                                                         // 0x0038 (size: 0x8)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0040 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x00C0 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                 // 0x00D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_2;      // 0x0108 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;      // 0x0138 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;        // 0x0168 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_10;      // 0x0198 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_9;       // 0x01C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_8;       // 0x01F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_MakeDynamicAdditive_1;  // 0x0228 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_MakeDynamicAdditive;    // 0x0258 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_7;       // 0x0288 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_6;       // 0x02B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_33;       // 0x02E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_32;       // 0x0318 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_31;       // 0x0348 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_30;       // 0x0378 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0x03A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_5;          // 0x03D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_6;                 // 0x0408 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_5;       // 0x0438 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_29;       // 0x0468 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_28;       // 0x0498 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_27;       // 0x04C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x04F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_4;          // 0x0528 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_5;                 // 0x0558 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_26;       // 0x0588 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_25;       // 0x05B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_24;       // 0x05E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive_1; // 0x0618 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_3;          // 0x0648 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_4;                 // 0x0678 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_23;       // 0x06A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_22;       // 0x06D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_21;       // 0x0708 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive; // 0x0738 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_2;          // 0x0768 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_3;                 // 0x0798 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_20;       // 0x07C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_19;       // 0x07F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_18;       // 0x0828 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_1;          // 0x0858 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x0888 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_17;       // 0x08B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_16;       // 0x08E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend;            // 0x0918 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x0948 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_15;       // 0x0978 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_14;       // 0x09A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_4;       // 0x09D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;       // 0x0A08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;       // 0x0A38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x0A68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0A98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_9;     // 0x0AC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_8;     // 0x0AF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_7;     // 0x0B28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_6;     // 0x0B58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_5;     // 0x0B88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_4;     // 0x0BB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_3;     // 0x0BE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_2;     // 0x0C18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend_1;     // 0x0C48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_13;       // 0x0C78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_12;       // 0x0CA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_11;       // 0x0CD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_10;       // 0x0D08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_9;        // 0x0D38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_8;        // 0x0D68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_7;        // 0x0D98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_6;        // 0x0DC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x0DF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0E28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;        // 0x0E58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;        // 0x0E88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;        // 0x0EB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;        // 0x0EE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;          // 0x0F18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;        // 0x0F48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x0F78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0FA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0FD8 (size: 0x30)

}; // Size: 0x1008

class UOrcMLayerBlending_AnimBP_C : public UAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0378 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0380 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x0388 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x03A8 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x0460 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x0518 (size: 0xB8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;                         // 0x05D0 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x0650 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x06D0 (size: 0x80)
    FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_1;                // 0x0750 (size: 0x38)
    FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive;                  // 0x0788 (size: 0x38)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x07C0 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x0840 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33;                           // 0x08C0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32;                           // 0x08E8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31;                           // 0x0910 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30;                           // 0x0938 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3;          // 0x0960 (size: 0xD0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5;                                // 0x0A30 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_6;                                              // 0x0AF8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x0B40 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29;                           // 0x0BC0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28;                           // 0x0BE8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27;                           // 0x0C10 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2;          // 0x0C38 (size: 0xD0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4;                                // 0x0D08 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x0DD0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;                           // 0x0E18 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x0E40 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x0E68 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_1;          // 0x0E90 (size: 0xD0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3;                                // 0x0F60 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x1028 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x1070 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x1098 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x10C0 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x10E8 (size: 0xD0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2;                                // 0x11B8 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x1280 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x12C8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x12F0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x1318 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0x1340 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x1408 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x1450 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x1478 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x14A0 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x1568 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x15B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x15D8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x1600 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x1680 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x1700 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x1780 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x1800 (size: 0x80)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9;                      // 0x1880 (size: 0xF0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x1970 (size: 0xF0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x1A60 (size: 0xF0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x1B50 (size: 0xF0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x1C40 (size: 0xF0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x1D30 (size: 0xF0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x1E20 (size: 0xF0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x1F10 (size: 0xF0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x2000 (size: 0xF0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x20F0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x2118 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x2140 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x2168 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2190 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x21B8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x21E0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x2208 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x2230 (size: 0xF0)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x2320 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x2368 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x2390 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x23B8 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x23E0 (size: 0xC8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x24A8 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x2570 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x2598 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x25C0 (size: 0x28)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x25E8 (size: 0x20)
    double Arm_L_Add;                                                                 // 0x2608 (size: 0x8)
    double Arm_L_LS;                                                                  // 0x2610 (size: 0x8)
    double Arm_L_MS;                                                                  // 0x2618 (size: 0x8)
    double Arm_R_Add;                                                                 // 0x2620 (size: 0x8)
    double Arm_R_LS;                                                                  // 0x2628 (size: 0x8)
    double Arm_R_MS;                                                                  // 0x2630 (size: 0x8)
    double hand_l;                                                                    // 0x2638 (size: 0x8)
    double hand_r;                                                                    // 0x2640 (size: 0x8)
    double Spine_Add;                                                                 // 0x2648 (size: 0x8)
    double Head_Add;                                                                  // 0x2650 (size: 0x8)

    void LayerBlending(FPoseLink Base Layer, FPoseLink Overlay Layer, FPoseLink Additive Base Pose, FPoseLink& LayerBlending);
    void AnimGraph(FPoseLink& AnimGraph);
    void UpdateLayerValues();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void ExecuteUbergraph_OrcMLayerBlending_AnimBP(int32 EntryPoint);
}; // Size: 0x2658

#endif
