#ifndef UE4SS_SDK_S_SimpleWindStruct_HPP
#define UE4SS_SDK_S_SimpleWindStruct_HPP

struct FS_SimpleWindStruct
{
    double PhaseIntensity_2_B9C1CA5B4913C89EA65B8A881CCE84C9;                         // 0x0000 (size: 0x8)
    double PhaseWeight_10_E6BD260442961FC5D3599DA587689C99;                           // 0x0008 (size: 0x8)
    double Weight_11_AC60B2E1440F840D8421949F45383709;                                // 0x0010 (size: 0x8)
    double StrengthIntensity_12_373A715E454AB1C436971CBC2704FCBB;                     // 0x0018 (size: 0x8)
    double StormIntensity_28_34959F3D4615DF994FE44591BFECCAD4;                        // 0x0020 (size: 0x8)
    double WindSpeed_13_21F376304726576269EB508793E8A787;                             // 0x0028 (size: 0x8)
    double WindTimeDelay_14_1291E4484FACB9F2C7A48AB837EBF9B8;                         // 0x0030 (size: 0x8)
    double RotationStrength_15_5F6AF7474AB5152FB987D1ACBB41CEE8;                      // 0x0038 (size: 0x8)
    double WindSpeedOnRain_33_459F14534A83D23040E80FB4ED519A5F;                       // 0x0040 (size: 0x8)
    double WindStormIntensityMultiplier_34_53BAFC034184DC0606B741BC39B3AF6C;          // 0x0048 (size: 0x8)
    FLinearColor CustomObjectPosition_23_E9DC501C4A87943ED1398F90C787C5D9;            // 0x0050 (size: 0x10)
    FLinearColor WorldPositionPivotOffset_24_4C47E6FF419B2197D5F619800D217878;        // 0x0060 (size: 0x10)

}; // Size: 0x70

#endif
