#ifndef UE4SS_SDK_Skeleton_AnimBP_HPP
#define UE4SS_SDK_Skeleton_AnimBP_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_1562;                                                        // 0x0004 (size: 0x8)
    FName __NameProperty_1563;                                                        // 0x000C (size: 0x8)
    FName __NameProperty_1564;                                                        // 0x0014 (size: 0x8)
    FName __NameProperty_1565;                                                        // 0x001C (size: 0x8)
    FName __NameProperty_1566;                                                        // 0x0024 (size: 0x8)
    FName __NameProperty_1567;                                                        // 0x002C (size: 0x8)
    FName __NameProperty_1568;                                                        // 0x0034 (size: 0x8)
    FName __NameProperty_1569;                                                        // 0x003C (size: 0x8)
    FName __NameProperty_1570;                                                        // 0x0044 (size: 0x8)
    FName __NameProperty_1571;                                                        // 0x004C (size: 0x8)
    FName __NameProperty_1572;                                                        // 0x0054 (size: 0x8)
    FName __NameProperty_1573;                                                        // 0x005C (size: 0x8)
    int32 __IntProperty_1574;                                                         // 0x0064 (size: 0x4)
    FName __NameProperty_1575;                                                        // 0x0068 (size: 0x8)
    int32 __IntProperty_1576;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_1577;                                                       // 0x0074 (size: 0x4)
    FName __NameProperty_1578;                                                        // 0x0078 (size: 0x8)
    int32 __IntProperty_1579;                                                         // 0x0080 (size: 0x4)
    FName __NameProperty_1580;                                                        // 0x0084 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1581;                                 // 0x0090 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1582;                                 // 0x0098 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1583;                                 // 0x00A0 (size: 0x8)
    FName __NameProperty_1584;                                                        // 0x00A8 (size: 0x8)
    FName __NameProperty_1585;                                                        // 0x00B0 (size: 0x8)
    float __FloatProperty_1586;                                                       // 0x00B8 (size: 0x4)
    float __FloatProperty_1587;                                                       // 0x00BC (size: 0x4)
    float __FloatProperty_1588;                                                       // 0x00C0 (size: 0x4)
    float __FloatProperty_1589;                                                       // 0x00C4 (size: 0x4)
    TArray<float> __ArrayProperty_1590;                                               // 0x00C8 (size: 0x10)
    TArray<int32> __ArrayProperty_1591;                                               // 0x00D8 (size: 0x10)
    FName __NameProperty_1592;                                                        // 0x00E8 (size: 0x8)
    TArray<float> __ArrayProperty_1593;                                               // 0x00F0 (size: 0x10)
    class UAnimSequenceBase* __AnimSequenceBase_1594;                                 // 0x0100 (size: 0x8)
    float __FloatProperty_1595;                                                       // 0x0108 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_1596;                                 // 0x0110 (size: 0x8)
    FName __NameProperty_1597;                                                        // 0x0118 (size: 0x8)
    FName __NameProperty_1598;                                                        // 0x0120 (size: 0x8)
    FName __NameProperty_1599;                                                        // 0x0128 (size: 0x8)
    FName __NameProperty_1600;                                                        // 0x0130 (size: 0x8)
    FName __NameProperty_1601;                                                        // 0x0138 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1602;                                 // 0x0140 (size: 0x8)
    FName __NameProperty_1603;                                                        // 0x0148 (size: 0x8)
    FName __NameProperty_1604;                                                        // 0x0150 (size: 0x8)
    FName __NameProperty_1605;                                                        // 0x0158 (size: 0x8)
    FName __NameProperty_1606;                                                        // 0x0160 (size: 0x8)
    FName __NameProperty_1607;                                                        // 0x0168 (size: 0x8)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_1608;                       // 0x0170 (size: 0x1)
    class UAnimSequenceBase* __AnimSequenceBase_1609;                                 // 0x0178 (size: 0x8)
    FName __NameProperty_1610;                                                        // 0x0180 (size: 0x8)
    FName __NameProperty_1611;                                                        // 0x0188 (size: 0x8)
    int32 __IntProperty_1612;                                                         // 0x0190 (size: 0x4)
    int32 __IntProperty_1613;                                                         // 0x0194 (size: 0x4)
    FName __NameProperty_1614;                                                        // 0x0198 (size: 0x8)
    EAnimSyncMethod __EnumProperty_1615;                                              // 0x01A0 (size: 0x1)
    FName __NameProperty_1616;                                                        // 0x01A4 (size: 0x8)
    FName __NameProperty_1617;                                                        // 0x01AC (size: 0x8)
    FName __NameProperty_1618;                                                        // 0x01B4 (size: 0x8)
    int32 __IntProperty_1619;                                                         // 0x01BC (size: 0x4)
    FName __NameProperty_1620;                                                        // 0x01C0 (size: 0x8)
    FName __NameProperty_1621;                                                        // 0x01C8 (size: 0x8)
    FName __NameProperty_1622;                                                        // 0x01D0 (size: 0x8)
    FName __NameProperty_1623;                                                        // 0x01D8 (size: 0x8)
    FName __NameProperty_1624;                                                        // 0x01E0 (size: 0x8)
    FName __NameProperty_1625;                                                        // 0x01E8 (size: 0x8)
    FName __NameProperty_1626;                                                        // 0x01F0 (size: 0x8)
    int32 __IntProperty_1627;                                                         // 0x01F8 (size: 0x4)
    FName __NameProperty_1628;                                                        // 0x01FC (size: 0x8)
    FName __NameProperty_1629;                                                        // 0x0204 (size: 0x8)
    FName __NameProperty_1630;                                                        // 0x020C (size: 0x8)
    int32 __IntProperty_1631;                                                         // 0x0214 (size: 0x4)
    bool __BoolProperty_1632;                                                         // 0x0218 (size: 0x1)
    FName __NameProperty_1633;                                                        // 0x021C (size: 0x8)
    FName __NameProperty_1634;                                                        // 0x0224 (size: 0x8)
    FName __NameProperty_1635;                                                        // 0x022C (size: 0x8)
    TArray<float> __ArrayProperty_1636;                                               // 0x0238 (size: 0x10)
    TArray<int32> __ArrayProperty_1637;                                               // 0x0248 (size: 0x10)
    class UBlendProfile* __BlendProfile_1638;                                         // 0x0258 (size: 0x8)
    class UCurveFloat* __CurveFloat_1639;                                             // 0x0260 (size: 0x8)
    EAlphaBlendOption __EnumProperty_1640;                                            // 0x0268 (size: 0x1)
    EBlendListTransitionType __EnumProperty_1641;                                     // 0x0269 (size: 0x1)
    TArray<float> __ArrayProperty_1642;                                               // 0x0270 (size: 0x10)
    float __FloatProperty_1643;                                                       // 0x0280 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_1644;                              // 0x0284 (size: 0x2C)
    float __FloatProperty_1645;                                                       // 0x02B0 (size: 0x4)
    bool __BoolProperty_1646;                                                         // 0x02B4 (size: 0x1)
    EAnimSyncMethod __EnumProperty_1647;                                              // 0x02B5 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1648;                            // 0x02B6 (size: 0x1)
    FName __NameProperty_1649;                                                        // 0x02B8 (size: 0x8)
    FName __NameProperty_1650;                                                        // 0x02C0 (size: 0x8)
    FName __NameProperty_1651;                                                        // 0x02C8 (size: 0x8)
    int32 __IntProperty_1652;                                                         // 0x02D0 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_1653;                                       // 0x02D8 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x02F8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0378 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_8;                 // 0x0390 (size: 0x30)
    FAnimNodeExposedValueHandler AnimGraphNode_LinkedInputPose_10;                    // 0x03C0 (size: 0x8)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_7;                 // 0x03C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_9;      // 0x03F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_6;                 // 0x0428 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_8;      // 0x0458 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_7;      // 0x0488 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_6;      // 0x04B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_5;                 // 0x04E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_5;      // 0x0518 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_12;      // 0x0548 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_69;    // 0x0578 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_68;    // 0x05A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_67;    // 0x05D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_66;    // 0x0608 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_22;      // 0x0638 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_23;       // 0x0668 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_6;        // 0x0698 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_45;         // 0x06C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_21;      // 0x06F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_22;       // 0x0728 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_5;        // 0x0758 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_44;         // 0x0788 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_21;       // 0x07B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_43;         // 0x07E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_17;        // 0x0818 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                 // 0x0848 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_4;      // 0x0878 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                 // 0x08A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_3;      // 0x08D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_2;      // 0x0908 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose_1;      // 0x0938 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                 // 0x0968 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;        // 0x0998 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                 // 0x09C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_65;    // 0x09F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_64;    // 0x0A28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_63;    // 0x0A58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_62;    // 0x0A88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_61;    // 0x0AB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_60;    // 0x0AE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_59;    // 0x0B18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_58;    // 0x0B48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_57;    // 0x0B78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_56;    // 0x0BA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_55;    // 0x0BD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_54;    // 0x0C08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_53;    // 0x0C38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_52;    // 0x0C68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_51;    // 0x0C98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_50;    // 0x0CC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_49;    // 0x0CF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_48;    // 0x0D28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_47;    // 0x0D58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_46;    // 0x0D88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_45;    // 0x0DB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_44;    // 0x0DE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_20;      // 0x0E18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_4;        // 0x0E48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_20;       // 0x0E78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_18;         // 0x0EA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_42;         // 0x0ED8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_19;       // 0x0F08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_17;         // 0x0F38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_41;         // 0x0F68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_43;    // 0x0F98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_19;      // 0x0FC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_18;      // 0x0FF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_18;       // 0x1028 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_16;         // 0x1058 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyMeshSpaceAdditive; // 0x1088 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_8;          // 0x10B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_40;         // 0x10E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_42;    // 0x1118 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_41;    // 0x1148 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;      // 0x1178 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;      // 0x11A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_7;          // 0x11D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_15;         // 0x1208 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_39;         // 0x1238 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_9;    // 0x1268 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_2;      // 0x1298 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_8;    // 0x12C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_14;         // 0x12F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_6;          // 0x1328 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_7;    // 0x1358 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_5;          // 0x1388 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_40;    // 0x13B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_39;    // 0x13E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_4;          // 0x1418 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;      // 0x1448 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;      // 0x1478 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_38;         // 0x14A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;      // 0x14D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;      // 0x1508 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;      // 0x1538 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;      // 0x1568 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_3;          // 0x1598 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum_1;      // 0x15C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_37;         // 0x15F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_36;         // 0x1628 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_16;        // 0x1658 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_35;         // 0x1688 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;       // 0x16B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_2;          // 0x16E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;       // 0x1718 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_6;    // 0x1748 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;      // 0x1778 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_5;    // 0x17A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend_1;          // 0x17D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_4;    // 0x1808 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TwoWayBlend;            // 0x1838 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_13;         // 0x1868 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_34;         // 0x1898 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_17;       // 0x18C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_12;         // 0x18F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_33;         // 0x1928 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_15;        // 0x1958 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_38;    // 0x1988 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_37;    // 0x19B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_36;    // 0x19E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_35;    // 0x1A18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_34;    // 0x1A48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_33;    // 0x1A78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_32;    // 0x1AA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_16;       // 0x1AD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_11;         // 0x1B08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_32;         // 0x1B38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot_1;         // 0x1B68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_31;         // 0x1B98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;       // 0x1BC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_30;         // 0x1BF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;       // 0x1C28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_29;         // 0x1C58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_28;         // 0x1C88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_14;        // 0x1CB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_11;                // 0x1CE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_11;      // 0x1D18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_10;      // 0x1D48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_31;    // 0x1D78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_30;    // 0x1DA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_29;    // 0x1DD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_28;    // 0x1E08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_3;    // 0x1E38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_27;         // 0x1E68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_2;    // 0x1E98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_26;         // 0x1EC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_10;                // 0x1EF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_15;       // 0x1F28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_25;         // 0x1F58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_13;        // 0x1F88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_10;         // 0x1FB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_24;         // 0x1FE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_9;                 // 0x2018 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_9;          // 0x2048 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x2078 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_23;         // 0x20A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_12;        // 0x20D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_3;        // 0x2108 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_27;    // 0x2138 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_26;    // 0x2168 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x2198 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator_1;    // 0x21C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_2;        // 0x21F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_22;         // 0x2228 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequenceEvaluator;      // 0x2258 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_8;          // 0x2288 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_21;         // 0x22B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_11;        // 0x22E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_7;          // 0x2318 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_8;                 // 0x2348 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_20;         // 0x2378 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_10;        // 0x23A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_9;       // 0x23D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_8;       // 0x2408 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_3;      // 0x2438 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_25;    // 0x2468 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_24;    // 0x2498 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_23;    // 0x24C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_22;    // 0x24F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_21;    // 0x2528 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_20;    // 0x2558 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_19;    // 0x2588 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_18;    // 0x25B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_17;    // 0x25E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;    // 0x2618 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_14;       // 0x2648 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_19;         // 0x2678 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_13;       // 0x26A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_18;         // 0x26D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;    // 0x2708 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_12;       // 0x2738 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_17;         // 0x2768 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_11;       // 0x2798 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_16;         // 0x27C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_10;       // 0x27F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_15;         // 0x2828 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_9;         // 0x2858 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_3;     // 0x2888 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_6;          // 0x28B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_14;         // 0x28E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_8;         // 0x2918 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;    // 0x2948 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;    // 0x2978 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;    // 0x29A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x29D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_9;        // 0x2A08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_5;          // 0x2A38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_13;         // 0x2A68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_8;        // 0x2A98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_4;          // 0x2AC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_12;         // 0x2AF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_11;         // 0x2B28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_7;         // 0x2B58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_7;       // 0x2B88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_6;       // 0x2BB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x2BE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x2C18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_7;        // 0x2C48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_10;         // 0x2C78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x2CA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_3;          // 0x2CD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_7;                 // 0x2D08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_2;          // 0x2D38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;          // 0x2D68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_6;         // 0x2D98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive_1;        // 0x2DC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_2;     // 0x2DF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;     // 0x2E28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;          // 0x2E58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_5;         // 0x2E88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_5;       // 0x2EB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_6;                 // 0x2EE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_4;       // 0x2F18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x2F48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;          // 0x2F78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_4;         // 0x2FA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;       // 0x2FD8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x3008 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x3038 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x3068 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x3098 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x30C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x30F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x3128 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_6;        // 0x3158 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;          // 0x3188 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;          // 0x31B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x31E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;        // 0x3218 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;          // 0x3248 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;        // 0x3278 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x32A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_3;         // 0x32D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x3308 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x3338 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;        // 0x3368 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x3398 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x33C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve_1;          // 0x33F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_5;                 // 0x3428 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyCurve;            // 0x3458 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x3488 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_2;         // 0x34B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;       // 0x34E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x3518 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_2;      // 0x3548 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1; // 0x3578 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1; // 0x35A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Mutilate;               // 0x35D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Inertialization;        // 0x3608 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_4;                 // 0x3638 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_PoseSnapshot;           // 0x3668 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x3698 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;         // 0x36C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByEnum;        // 0x36F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x3728 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_7;         // 0x3758 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_1;      // 0x3788 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_3;                 // 0x37B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x37E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x3818 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;        // 0x3848 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x3878 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer;        // 0x38A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x38D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x3908 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x3938 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x3968 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x3998 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;        // 0x39C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x39F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x3A28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x3A58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_6;         // 0x3A88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_5;         // 0x3AB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x3AE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_4;         // 0x3B18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_3;         // 0x3B48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_2;         // 0x3B78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics_1;         // 0x3BA8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_AnimDynamics;           // 0x3BD8 (size: 0x30)

}; // Size: 0x3C08

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    float __FloatProperty_0;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_2;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_3;                                                          // 0x0010 (size: 0x4)
    uint8 __ByteProperty_4;                                                           // 0x0014 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0015 (size: 0x1)
    float __FloatProperty_6;                                                          // 0x0018 (size: 0x4)
    float __FloatProperty_7;                                                          // 0x001C (size: 0x4)
    float __FloatProperty_8;                                                          // 0x0020 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x0024 (size: 0x4)
    float __FloatProperty_10;                                                         // 0x0028 (size: 0x4)
    float __FloatProperty_11;                                                         // 0x002C (size: 0x4)
    float __FloatProperty_12;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_14;                                                         // 0x0038 (size: 0x4)
    uint8 __ByteProperty_15;                                                          // 0x003C (size: 0x1)
    bool __BoolProperty_16;                                                           // 0x003D (size: 0x1)

}; // Size: 0x3E

class USkeleton_AnimBP_C : public UBipedLocomotionAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x09E0 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x09E8 (size: 0x40)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0A28 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0A30 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_8;                                              // 0x0A38 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_10;                       // 0x0A58 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_7;                                              // 0x0B10 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_9;                        // 0x0B30 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_6;                                              // 0x0BE8 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_8;                        // 0x0C08 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7;                        // 0x0CC0 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6;                        // 0x0D78 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_5;                                              // 0x0E30 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5;                        // 0x0E50 (size: 0xB8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12;                         // 0x0F08 (size: 0x80)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x0F88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x0FB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x0FD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x1000 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x1028 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x1070 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6;                            // 0x1098 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x1160 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x1180 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x11C8 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5;                            // 0x11F0 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x12B8 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x12D8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x1300 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_17;                             // 0x1320 (size: 0xC8)
    FAnimNode_Root AnimGraphNode_Root_4;                                              // 0x13E8 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4;                        // 0x1408 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_3;                                              // 0x14C0 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3;                        // 0x14E0 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x1598 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x1650 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_2;                                              // 0x1708 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x1728 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x17E0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x1800 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x1828 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x1850 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x1878 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x18A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x18C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x18F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x1918 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x1940 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x1968 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x1990 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x19B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x19E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x1A08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x1A30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x1A58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x1A80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x1AA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x1AD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x1AF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x1B20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x1B48 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x1B70 (size: 0x48)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;                            // 0x1BB8 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x1C80 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_18;                               // 0x1CA8 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x1DC8 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x1DE8 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_17;                               // 0x1E10 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x1F30 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x1F50 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x1F78 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x1FC0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x2008 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_16;                               // 0x2030 (size: 0x120)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x2150 (size: 0xD0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8;                                // 0x2220 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x22E8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x2308 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x2330 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x2358 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x23A0 (size: 0x48)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7;                                // 0x23E8 (size: 0xC8)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_15;                               // 0x24B0 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x25D0 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9;                    // 0x25F0 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x2630 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8;                    // 0x2678 (size: 0x40)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_14;                               // 0x26B8 (size: 0x120)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6;                                // 0x27D8 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7;                    // 0x28A0 (size: 0x40)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5;                                // 0x28E0 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x29A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x29D0 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4;                                // 0x29F8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x2AC0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x2B08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x2B50 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x2B70 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x2BB8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x2C00 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x2C48 (size: 0x48)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3;                                // 0x2C90 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x2D58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x2DA0 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x2DC0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_16;                             // 0x2DE0 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x2EA8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x2EC8 (size: 0x48)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2;                                // 0x2F10 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x2FD8 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6;                    // 0x3020 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x3060 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5;                    // 0x30A8 (size: 0x40)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0x30E8 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x31B0 (size: 0x40)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x31F0 (size: 0xC8)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_13;                               // 0x32B8 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x33D8 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x33F8 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_12;                               // 0x3420 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x3540 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15;                             // 0x3560 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x3628 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x3650 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x3678 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x36A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x36C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x36F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x3718 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x3740 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_11;                               // 0x3768 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x3888 (size: 0x20)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot_1;                              // 0x38A8 (size: 0x90)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x3938 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x3958 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x39A0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x39C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x3A08 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x3A28 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14;                             // 0x3A48 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_11;                                             // 0x3B10 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11;                         // 0x3B58 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;                         // 0x3BD8 (size: 0x80)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x3C58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x3C80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x3CA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x3CD0 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x3CF8 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x3D38 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x3D58 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x3D98 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_10;                                             // 0x3DB8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x3E00 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x3E28 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_13;                             // 0x3E48 (size: 0xC8)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_10;                               // 0x3F10 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x4030 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_9;                                              // 0x4050 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_9;                                // 0x4098 (size: 0x120)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x41B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x4200 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x4220 (size: 0xC8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;                            // 0x42E8 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x43B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x43D8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x4400 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x4448 (size: 0x40)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;                            // 0x4488 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x4550 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x4570 (size: 0x40)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_8;                                // 0x45B0 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x46D0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x46F0 (size: 0xC8)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_7;                                // 0x47B8 (size: 0x120)
    FAnimNode_Slot AnimGraphNode_Slot_8;                                              // 0x48D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x4920 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x4940 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x4A08 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x4A88 (size: 0x80)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3;                        // 0x4B08 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x4BD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x4BF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x4C20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x4C48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x4C70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x4C98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x4CC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x4CE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x4D10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x4D38 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x4D60 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x4D88 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x4DA8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x4DD0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x4DF0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x4E18 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x4E40 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x4E60 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x4E88 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x4EA8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x4ED0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x4EF0 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x4FB8 (size: 0x70)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_6;                                // 0x5028 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x5148 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x5168 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x5230 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x5258 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x5280 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x52A8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x52D0 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_5;                                // 0x52F8 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x5418 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x5438 (size: 0x28)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_4;                                // 0x5460 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x5580 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x55A0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x55C0 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x5688 (size: 0x80)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x5708 (size: 0x80)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x5788 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x57B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x57D8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x5800 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x5820 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_3;                                // 0x5868 (size: 0x120)
    FAnimNode_Slot AnimGraphNode_Slot_7;                                              // 0x5988 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_2;                                // 0x59D0 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x5AF0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x5B10 (size: 0xC8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x5BD8 (size: 0xC8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x5CA0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x5D10 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x5D80 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x5DA0 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x5E68 (size: 0x80)
    FAnimNode_Slot AnimGraphNode_Slot_6;                                              // 0x5EE8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x5F30 (size: 0x80)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x5FB0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x6020 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x6040 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x6108 (size: 0x80)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x6188 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x61B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x61D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x6200 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x6228 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x6250 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x6278 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x62C0 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x62E8 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x63B0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x63D0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x63F8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x6420 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x6440 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x6468 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x6488 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x6550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x6578 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x65A0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x65C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x65E8 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_1;                                // 0x6630 (size: 0x120)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x6750 (size: 0x48)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve;                                  // 0x6798 (size: 0x120)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x68B8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x68D8 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x69A0 (size: 0x80)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x6A20 (size: 0x20)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2;                        // 0x6A40 (size: 0xC8)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x6B08 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x6B28 (size: 0x20)
    FAnimNode_Mutilate AnimGraphNode_Mutilate;                                        // 0x6B48 (size: 0xE0)
    FAnimNode_Inertialization AnimGraphNode_Inertialization;                          // 0x6C30 (size: 0x440)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x7070 (size: 0x48)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot;                                // 0x70B8 (size: 0x90)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x7148 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x7168 (size: 0xC8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x7230 (size: 0x48)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x7278 (size: 0x20)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7;                              // 0x72A0 (size: 0x520)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_1;                        // 0x77C0 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x7888 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x78D0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x7918 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x7998 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x79C0 (size: 0x28)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0x79E8 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x7AB0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x7AF8 (size: 0xF0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x7BE8 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x7C68 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x7C90 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x7CD8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x7D20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x7D68 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x7D88 (size: 0xC8)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6;                              // 0x7E50 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5;                              // 0x8370 (size: 0x520)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x8890 (size: 0x20)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4;                              // 0x88B0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3;                              // 0x8DD0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2;                              // 0x92F0 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_1;                              // 0x9810 (size: 0x520)
    FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics;                                // 0x9D30 (size: 0x520)
    bool __CustomProperty_HasWeapon_89505D0C45905E640CCEF38A87BBBCA7;                 // 0xA250 (size: 0x1)
    double __CustomProperty_ArmL_Corr_89505D0C45905E640CCEF38A87BBBCA7;               // 0xA258 (size: 0x8)
    double __CustomProperty_ArmR_Corr_89505D0C45905E640CCEF38A87BBBCA7;               // 0xA260 (size: 0x8)
    double __CustomProperty_AlphaArmL_89505D0C45905E640CCEF38A87BBBCA7;               // 0xA268 (size: 0x8)
    double __CustomProperty_AlphaArmR_89505D0C45905E640CCEF38A87BBBCA7;               // 0xA270 (size: 0x8)
    EMovementState __CustomProperty_MovementState_89505D0C45905E640CCEF38A87BBBCA7;   // 0xA278 (size: 0x1)
    double __CustomProperty_SpineCorrAlpha_89505D0C45905E640CCEF38A87BBBCA7;          // 0xA280 (size: 0x8)
    double __CustomProperty_CharacterSpeed_89505D0C45905E640CCEF38A87BBBCA7;          // 0xA288 (size: 0x8)
    double __CustomProperty_AngleBwVectors_89505D0C45905E640CCEF38A87BBBCA7;          // 0xA290 (size: 0x8)
    bool __CustomProperty_ShouldMove_89505D0C45905E640CCEF38A87BBBCA7;                // 0xA298 (size: 0x1)
    bool __CustomProperty_IsTargeting_89505D0C45905E640CCEF38A87BBBCA7;               // 0xA299 (size: 0x1)
    EMovementState previousMovementState;                                             // 0xA29A (size: 0x1)
    EMovementState actualMovementState;                                               // 0xA29B (size: 0x1)
    bool FinishBreaker;                                                               // 0xA29C (size: 0x1)
    FVector Player Location;                                                          // 0xA2A0 (size: 0x18)
    EAttackHandle Attack Handle;                                                      // 0xA2B8 (size: 0x1)
    FVector Magnet Target Location;                                                   // 0xA2C0 (size: 0x18)
    double Alpha Value;                                                               // 0xA2D8 (size: 0x8)
    double Alpha Value Arm R;                                                         // 0xA2E0 (size: 0x8)
    double Alpha Value Arm L;                                                         // 0xA2E8 (size: 0x8)
    bool Calculate Attack Arm Corr;                                                   // 0xA2F0 (size: 0x1)
    bool Use Only Arm Corr;                                                           // 0xA2F1 (size: 0x1)
    double Angle Between Vectors;                                                     // 0xA2F8 (size: 0x8)
    double Attack Arm Correction R;                                                   // 0xA300 (size: 0x8)
    double Attack Arm Correction L;                                                   // 0xA308 (size: 0x8)
    double Attack Arm Correction Generic;                                             // 0xA310 (size: 0x8)
    bool IsChained;                                                                   // 0xA318 (size: 0x1)
    int32 SkeletonID;                                                                 // 0xA31C (size: 0x4)
    TArray<class UAnimSequence*> ChainedSeqArray;                                     // 0xA320 (size: 0x10)

    void Landing Combat(FPoseLink Default Land, FPoseLink& Landing Combat);
    void Flying Cycle Combat(FPoseLink InPose_0, FPoseLink& Flying Cycle Combat);
    void BaseBody Combat(FPoseLink BaseBody, FPoseLink N Pose, FPoseLink STR Pose, FPoseLink& BaseBody Combat);
    void UpperBody Combat(FPoseLink UpperBody, FPoseLink& UpperBody Combat);
    void PostLayering Combat(FPoseLink PostLayering In, FPoseLink& PostLayering Combat);
    void STL BaseBody Combat(FPoseLink InPose, FPoseLink STL Loco Pose, FPoseLink STL STR Pose, FPoseLink& STL BaseBody Combat);
