#ifndef UE4SS_SDK_StatuePuzzle_animbp_HPP
#define UE4SS_SDK_StatuePuzzle_animbp_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_494;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_495;                                                         // 0x000C (size: 0x8)
    int32 __IntProperty_496;                                                          // 0x0014 (size: 0x4)
    FName __NameProperty_497;                                                         // 0x0018 (size: 0x8)
    int32 __IntProperty_498;                                                          // 0x0020 (size: 0x4)
    FName __NameProperty_499;                                                         // 0x0024 (size: 0x8)
    int32 __IntProperty_500;                                                          // 0x002C (size: 0x4)
    FName __NameProperty_501;                                                         // 0x0030 (size: 0x8)
    int32 __IntProperty_502;                                                          // 0x0038 (size: 0x4)
    FName __NameProperty_503;                                                         // 0x003C (size: 0x8)
    int32 __IntProperty_504;                                                          // 0x0044 (size: 0x4)
    FName __NameProperty_505;                                                         // 0x0048 (size: 0x8)
    int32 __IntProperty_506;                                                          // 0x0050 (size: 0x4)
    FName __NameProperty_507;                                                         // 0x0054 (size: 0x8)
    int32 __IntProperty_508;                                                          // 0x005C (size: 0x4)
    FName __NameProperty_509;                                                         // 0x0060 (size: 0x8)
    int32 __IntProperty_510;                                                          // 0x0068 (size: 0x4)
    FName __NameProperty_511;                                                         // 0x006C (size: 0x8)
    int32 __IntProperty_512;                                                          // 0x0074 (size: 0x4)
    FName __NameProperty_513;                                                         // 0x0078 (size: 0x8)
    int32 __IntProperty_514;                                                          // 0x0080 (size: 0x4)
    FName __NameProperty_515;                                                         // 0x0084 (size: 0x8)
    int32 __IntProperty_516;                                                          // 0x008C (size: 0x4)
    FName __NameProperty_517;                                                         // 0x0090 (size: 0x8)
    int32 __IntProperty_518;                                                          // 0x0098 (size: 0x4)
    FName __NameProperty_519;                                                         // 0x009C (size: 0x8)
    int32 __IntProperty_520;                                                          // 0x00A4 (size: 0x4)
    FName __NameProperty_521;                                                         // 0x00A8 (size: 0x8)
    int32 __IntProperty_522;                                                          // 0x00B0 (size: 0x4)
    FName __NameProperty_523;                                                         // 0x00B4 (size: 0x8)
    int32 __IntProperty_524;                                                          // 0x00BC (size: 0x4)
    FName __NameProperty_525;                                                         // 0x00C0 (size: 0x8)
    int32 __IntProperty_526;                                                          // 0x00C8 (size: 0x4)
    FName __NameProperty_527;                                                         // 0x00CC (size: 0x8)
    int32 __IntProperty_528;                                                          // 0x00D4 (size: 0x4)
    float __FloatProperty_529;                                                        // 0x00D8 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_530;                               // 0x00DC (size: 0x2C)
    float __FloatProperty_531;                                                        // 0x0108 (size: 0x4)
    bool __BoolProperty_532;                                                          // 0x010C (size: 0x1)
    EAnimSyncMethod __EnumProperty_533;                                               // 0x010D (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_534;                             // 0x010E (size: 0x1)
    FName __NameProperty_535;                                                         // 0x0110 (size: 0x8)
    FName __NameProperty_536;                                                         // 0x0118 (size: 0x8)
    int32 __IntProperty_537;                                                          // 0x0120 (size: 0x4)
    FName __NameProperty_538;                                                         // 0x0124 (size: 0x8)
    FName __NameProperty_539;                                                         // 0x012C (size: 0x8)
    int32 __IntProperty_540;                                                          // 0x0134 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_541;                                        // 0x0138 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0158 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x01D8 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x01F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_35;    // 0x0220 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_34;    // 0x0250 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_33;    // 0x0280 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_32;    // 0x02B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_31;    // 0x02E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_30;    // 0x0310 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_29;    // 0x0340 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_28;    // 0x0370 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_27;    // 0x03A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_26;    // 0x03D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_25;    // 0x0400 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_24;    // 0x0430 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_23;    // 0x0460 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_22;    // 0x0490 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_21;    // 0x04C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_20;    // 0x04F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_19;    // 0x0520 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_18;    // 0x0550 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_17;    // 0x0580 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;    // 0x05B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;    // 0x05E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;    // 0x0610 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;    // 0x0640 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;    // 0x0670 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x06A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x06D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x0700 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x0730 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x0760 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x0790 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x07C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x07F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x0820 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x0850 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x0880 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x08B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_17;      // 0x08E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_18;         // 0x0910 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_16;      // 0x0940 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_17;         // 0x0970 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_15;      // 0x09A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_16;         // 0x09D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_14;      // 0x0A00 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_15;         // 0x0A30 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_13;      // 0x0A60 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_14;         // 0x0A90 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_12;      // 0x0AC0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_13;         // 0x0AF0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_11;      // 0x0B20 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_12;         // 0x0B50 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_10;      // 0x0B80 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_11;         // 0x0BB0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_9;       // 0x0BE0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_10;         // 0x0C10 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;       // 0x0C40 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;          // 0x0C70 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;       // 0x0CA0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;          // 0x0CD0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;       // 0x0D00 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;          // 0x0D30 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x0D60 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;          // 0x0D90 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x0DC0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;          // 0x0DF0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0E20 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x0E50 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0E80 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x0EB0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0EE0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x0F10 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0F40 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0F70 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0FA0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0FD0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x1000 (size: 0x30)

}; // Size: 0x1030

class UStatuePuzzle_animbp_C : public UDoorAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03C0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x03C8 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03D0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03D8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x03F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x0420 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x0448 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x0470 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x0498 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x04C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x04E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x0510 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x0538 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x0560 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x0588 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x05B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x05D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x0600 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x0628 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x0650 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x0678 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x06A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x06C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x06F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0718 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0740 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0768 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0790 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x07B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x07E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0808 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0830 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0858 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0880 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x08A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x08D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x08F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0920 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0948 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0970 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x0998 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x09E0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x0A00 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x0A48 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x0A68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x0AB0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x0AD0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x0B18 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x0B38 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x0B80 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x0BA0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x0BE8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x0C08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x0C50 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x0C70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x0CB8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x0CD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x0D20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x0D40 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x0D88 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x0DA8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x0DF0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x0E10 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x0E58 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x0E78 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x0EC0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0EE0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x0F28 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x0F48 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x0F90 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0FB0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x0FF8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x1018 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x1060 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x1080 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x10C8 (size: 0x20)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x10E8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1108 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x11D0 (size: 0x48)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_FF9657504C690280716BA2B6103290BC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_C5D9A4E94385236A4748568CF8DB8288();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_C04E106E42F80C665F50C891673AB8A8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_A1E9EE834D0E964706E041BDF5E1D072();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_8DAF71504129A66BE7B6BFA07A1E7157();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_B4348381409A0D095252A19F939B1CA3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_C2EE170E4BA599EA17DEBBA71C1DB01D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_358922AE46061F8956DA00AE5CB0F9B1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_35B6BBE14C573F9F2AAEE78E140BF4C9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_B2B9247F4A9E88E3AF2EFD98D00997AE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_B588D98B402A046459B07BB5A7786D2E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_B04026E54A141414098322809387F2DF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_D686E5C54D4DCBCD80398B957BFD8AD6();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_B39DE9A949E488D1F6489E99C28C8B75();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_02A3868A4FE73CB9CE130DBDB32EA4F7();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_AD227F9B45ECD17882B71C934C35BE90();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_8609B84545FD59EF11B2248361343EEA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_F1B591BE440ABE436BB37D9A499E075F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_069391884BE221A29DB6568B44BE220B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_D1DB2B544B27308BA84D18AC2D4DAB79();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_ECD943D34E3E4C039C1DA4AE17D24062();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_0C7A490A448F3377EC713396B2BE1462();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_BE226DBD4EC71AE2D727908913134EA9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_9245361A4BBF582BCD0FBF9D41B682D9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_F2E3F315409EE77F5AD8BB9539816E99();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_653832994EB2953E3F655C8495B6DCDD();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_1232919A4BE196541D68B29A318F4253();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_B671CF7846BA46738D5FF9873DCE89B0();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_50AD504D4EC87538F7834D8AEF2EBA20();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_54E9702847BE9F4215EF82AAE5319517();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_0B35508C42F3409A11A89284997FA5C1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_7FBFB968413FFC53B179D3832EB86556();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_DE46275F40D950A781700489BE23D9D7();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_BA1FE11544A7F9FCE97A98A06AFC4DB1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_StatuePuzzle_animbp_AnimGraphNode_TransitionResult_C477E18E4BFEDCDEA5A9FF819DE4E123();
    void AnimNotify_EndIdleEvent();
    void AnimNotify_EndIdleEventFinal();
    void ExecuteUbergraph_StatuePuzzle_animbp(int32 EntryPoint);
}; // Size: 0x1218

#endif
