#ifndef UE4SS_SDK_StatuesPuzzle_Beliar_HPP
#define UE4SS_SDK_StatuesPuzzle_Beliar_HPP

class AStatuesPuzzle_Beliar_C : public AInteractiveObjectActor
{
    class UStaticMeshComponent* Root_01;                                              // 0x0928 (size: 0x8)
    class UStaticMeshComponent* Root;                                                 // 0x0930 (size: 0x8)
    class UStaticMeshComponent* SM_ST_Statue_Innos_Puzzle_Collider_02;                // 0x0938 (size: 0x8)
    class UStaticMeshComponent* Body1;                                                // 0x0940 (size: 0x8)
    class UStaticMeshComponent* Body5;                                                // 0x0948 (size: 0x8)
    class UStaticMeshComponent* Body3;                                                // 0x0950 (size: 0x8)
    class UStaticMeshComponent* Body4;                                                // 0x0958 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0960 (size: 0x8)
    class UStaticMeshComponent* Body6;                                                // 0x0968 (size: 0x8)
    class UStaticMeshComponent* Body;                                                 // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SM_ST_Statue_Innos_Puzzle_Collider_01;                // 0x0978 (size: 0x8)
    class UGothicSmartLinkDoor* GothicSmartLinkDoor;                                  // 0x0980 (size: 0x8)
    class UInteractiveObjectAnchorComponent* InteractiveHUDAnchor;                    // 0x0988 (size: 0x8)
    class UDoorInteractiveComponent* DoorInteractive;                                 // 0x0990 (size: 0x8)

}; // Size: 0x998

#endif
