#ifndef UE4SS_SDK_Transient_HPP
#define UE4SS_SDK_Transient_HPP

struct FChaosDestructionEvent_SWC
{
    FVector3f position;                                                               // 0x0000 (size: 0xC)
    FVector3f Normal;                                                                 // 0x000C (size: 0xC)
    FVector3f Velocity;                                                               // 0x0018 (size: 0xC)
    FVector3f AngularVelocity;                                                        // 0x0024 (size: 0xC)
    float ExtentMin;                                                                  // 0x0030 (size: 0x4)
    float ExtentMax;                                                                  // 0x0034 (size: 0x4)
    int32 ParticleID;                                                                 // 0x0038 (size: 0x4)
    float Time;                                                                       // 0x003C (size: 0x4)
    int32 Type;                                                                       // 0x0040 (size: 0x4)

}; // Size: 0x44

struct FPropertyBag_1e76fab01e6cf3c1
{
    FString RigVMModel___DISPATCH_RigVMDispatch_Print_2_Prefix__Const;                // 0x0000 (size: 0x10)
    FName RigVMModel___GetCurveValue_Curve__Const;                                    // 0x0010 (size: 0x8)
    double RigVMModel___IsNearlyEqual_B__Const;                                       // 0x0018 (size: 0x8)
    double RigVMModel___IsNearlyEqual_Tolerance__Const;                               // 0x0020 (size: 0x8)
    float RigVMModel___Greater_5_B__Const;                                            // 0x0028 (size: 0x4)
    FName RigVMModel___GetCurveValue_1_Curve__Const;                                  // 0x002C (size: 0x8)
    bool RigVMModel___DISPATCH_RigVMDispatch_Print_2_Enabled__Const;                  // 0x0034 (size: 0x1)
    float RigVMModel___DISPATCH_RigVMDispatch_Print_2_ScreenDuration__Const;          // 0x0038 (size: 0x4)
    FLinearColor RigVMModel___DISPATCH_RigVMDispatch_Print_2_ScreenColor__Const;      // 0x003C (size: 0x10)
    FRigElementKey RigVMModel___GetTransform_2_2_2_Item__Const;                       // 0x004C (size: 0xC)
    ERigVMTransformSpace RigVMModel___GetTransform_2_2_2_Space__Const;                // 0x0058 (size: 0x1)
    FRigElementKey RigVMModel___GetTransform_4_Item__Const;                           // 0x005C (size: 0xC)
    FRigElementKey RigVMModel___Set_Transform_Item__Const;                            // 0x0068 (size: 0xC)
    FRigElementKey RigVMModel___Set_Transform_1_Item__Const;                          // 0x0074 (size: 0xC)
    FRigElementKey RigVMModel___GetTransform_1_Item__Const;                           // 0x0080 (size: 0xC)
    FRigElementKey RigVMModel___Set_Transform_1_1_Item__Const;                        // 0x008C (size: 0xC)
    FRigElementKey RigVMModel___GetTransform_1_1_Item__Const;                         // 0x0098 (size: 0xC)
    FRigElementKey RigVMModel___Set_Transform_1_1_1_Item__Const;                      // 0x00A4 (size: 0xC)
    FRigElementKey RigVMModel___GetTransform_1_1_1_Item__Const;                       // 0x00B0 (size: 0xC)
    FRigElementKey RigVMModel___Set_Transform_1_1_2_Item__Const;                      // 0x00BC (size: 0xC)
    FRigElementKey RigVMModel___GetTransform_1_1_2_Item__Const;                       // 0x00C8 (size: 0xC)
    bool RigVMModel___Set_Transform_1_1_2_bPropagateToChildren__Const;                // 0x00D4 (size: 0x1)
    FRigElementKey RigVMModel___Set_Transform_1_1_1_1_Item__Const;                    // 0x00D8 (size: 0xC)
    FRigElementKey RigVMModel___Set_Transform_1_1_2_1_Item__Const;                    // 0x00E4 (size: 0xC)
    double RigVMModel___LFoot_SearchForFloor_FootInFloorSearchDistance__Const;        // 0x00F0 (size: 0x8)
    FRotator RigVMModel___LFoot_SearchForFloor_Foot_NormalAngle__Const;               // 0x00F8 (size: 0x18)
    FVector RigVMModel___LFoot_SearchForFloor_PreviousFloorNormal__Const;             // 0x0110 (size: 0x18)
    ERigVMTransformSpace LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_Space__Const; // 0x0128 (size: 0x1)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_bInitial__Const;    // 0x0129 (size: 0x1)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_B__Const;                 // 0x0130 (size: 0x18)
    FLinearColor LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0x0148 (size: 0x10)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_Thickness__Const; // 0x0158 (size: 0x4)
    FTransform LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_WorldOffset__Const; // 0x0160 (size: 0x60)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_bEnabled__Const; // 0x01C0 (size: 0x1)
    ETraceTypeQuery LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_TraceChannel__Const; // 0x01C1 (size: 0x1)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_Radius__Const; // 0x01C4 (size: 0x4)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_LessEqual_B__Const;            // 0x01C8 (size: 0x8)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_True__Const; // 0x01D0 (size: 0x4)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_False__Const; // 0x01D8 (size: 0x18)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_Strength__Const;   // 0x01F0 (size: 0x4)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_CriticalDamping__Const; // 0x01F4 (size: 0x4)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_Force__Const;    // 0x01F8 (size: 0x18)
    ERigVMTransformSpace RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_Space__Const; // 0x0210 (size: 0x1)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_bInitial__Const;    // 0x0211 (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_B__Const;                 // 0x0218 (size: 0x18)
    ETraceTypeQuery RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0230 (size: 0x1)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_UseComplex__Const; // 0x0231 (size: 0x1)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_Radius__Const; // 0x0234 (size: 0x4)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_False__Const; // 0x0238 (size: 0x18)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_Strength__Const;   // 0x0250 (size: 0x4)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_CriticalDamping__Const; // 0x0254 (size: 0x4)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_Force__Const;    // 0x0258 (size: 0x18)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_TargetVelocityAmount__Const; // 0x0270 (size: 0x4)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_LessEqual_B__Const;            // 0x0278 (size: 0x8)
    float RigVMModel___SpringInterp_Strength__Const;                                  // 0x0280 (size: 0x4)
    float RigVMModel___SpringInterp_CriticalDamping__Const;                           // 0x0284 (size: 0x4)
    float RigVMModel___SpringInterp_Force__Const;                                     // 0x0288 (size: 0x4)
    FRigElementKey RigVMModel___Set_Transform_2_Item__Const;                          // 0x028C (size: 0xC)
    ERigVMTransformSpace RigVMModel___Set_Transform_2_Space__Const;                   // 0x0298 (size: 0x1)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_OffsetTransform__Const; // 0x02A0 (size: 0x60)
    ERigVMTransformSpace Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_Space__Const; // 0x0300 (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_bInitial__Const;        // 0x0301 (size: 0x1)
    FVector Adjust_LFootHeight___Adjust_LFootHeight_Rotate_Vector_Vector__Const;      // 0x0308 (size: 0x18)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Strength__Const;       // 0x0320 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_CriticalDamping__Const; // 0x0324 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Force__Const;          // 0x0328 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_Weight__Const; // 0x032C (size: 0x4)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_OffsetTransform__Const; // 0x0330 (size: 0x60)
    ERigVMTransformSpace Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_Space__Const; // 0x0390 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_bInitial__Const;        // 0x0391 (size: 0x1)
    FVector Adjust_RFootHeight___Adjust_RFootHeight_Rotate_Vector_Vector__Const;      // 0x0398 (size: 0x18)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Strength__Const;       // 0x03B0 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_CriticalDamping__Const; // 0x03B4 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Force__Const;          // 0x03B8 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_Weight__Const; // 0x03BC (size: 0x4)
    FRigElementKey Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_1_Item__Const; // 0x03C0 (size: 0xC)
    ERigVMTransformSpace Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_1_Space__Const; // 0x03CC (size: 0x1)
    bool Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_1_bInitial__Const; // 0x03CD (size: 0x1)
    FRigUnit_AimItem_Target Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_AimBoneMath_Primary__Const; // 0x03D0 (size: 0x48)
    FRigUnit_AimItem_Target Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_AimBoneMath_Secondary__Const; // 0x0418 (size: 0x48)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_AimBoneMath_Weight__Const;    // 0x0460 (size: 0x4)
    FRigUnit_AimBone_DebugSettings Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_AimBoneMath_DebugSettings__Const; // 0x0470 (size: 0x70)
    bool Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_VisualDebug_bEnabled__Const;   // 0x04E0 (size: 0x1)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_VisualDebug_Thickness__Const; // 0x04E4 (size: 0x4)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_VisualDebug_Scale__Const;     // 0x04E8 (size: 0x4)
    FRotator Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_VariableNode_4_Value__Const; // 0x04F0 (size: 0x18)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_Minimum__Const;        // 0x0508 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_Maximum__Const;        // 0x0510 (size: 0x8)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_Strength__Const; // 0x0518 (size: 0x4)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_CriticalDamping__Const; // 0x051C (size: 0x4)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_Torque__Const; // 0x0520 (size: 0x18)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_VisualDebug_1_Scale__Const;   // 0x0538 (size: 0x4)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_TargetVelocityAmount__Const; // 0x053C (size: 0x4)
    FString RigVMModel___DISPATCH_RigVMDispatch_Print_1_Prefix__Const;                // 0x0540 (size: 0x10)
    FLinearColor RigVMModel___DISPATCH_RigVMDispatch_Print_1_ScreenColor__Const;      // 0x0550 (size: 0x10)
    FRigElementKey Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_1_Item__Const; // 0x0560 (size: 0xC)
    ERigVMTransformSpace Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_1_Space__Const; // 0x056C (size: 0x1)
    bool Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_1_bInitial__Const; // 0x056D (size: 0x1)
    FRigUnit_AimItem_Target Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_AimBoneMath_Primary__Const; // 0x0570 (size: 0x48)
    FRigUnit_AimItem_Target Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_AimBoneMath_Secondary__Const; // 0x05B8 (size: 0x48)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_AimBoneMath_Weight__Const;    // 0x0600 (size: 0x4)
    FRigUnit_AimBone_DebugSettings Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_AimBoneMath_DebugSettings__Const; // 0x0610 (size: 0x70)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_VisualDebug_Thickness__Const; // 0x0680 (size: 0x4)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_VisualDebug_Scale__Const;     // 0x0684 (size: 0x4)
    FRotator Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_VariableNode_7_Value__Const; // 0x0688 (size: 0x18)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_Minimum__Const;        // 0x06A0 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_Maximum__Const;        // 0x06A8 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_Minimum__Const;      // 0x06B0 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_Maximum__Const;      // 0x06B8 (size: 0x8)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_Strength__Const; // 0x06C0 (size: 0x4)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_CriticalDamping__Const; // 0x06C4 (size: 0x4)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_Torque__Const; // 0x06C8 (size: 0x18)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_TargetVelocityAmount__Const; // 0x06E0 (size: 0x4)
    FString RigVMModel___DISPATCH_RigVMDispatch_Print_1_1_Prefix__Const;              // 0x06E8 (size: 0x10)
    FLinearColor RigVMModel___DISPATCH_RigVMDispatch_Print_1_1_ScreenColor__Const;    // 0x06F8 (size: 0x10)
    FName RigVMModel___PBIK_1_1_Root__Const;                                          // 0x0708 (size: 0x8)
    TArray<FPBIKEffector> RigVMModel___PBIK_1_1_Effectors__Const;                     // 0x0710 (size: 0x10)
    TArray<FPBIKBoneSetting> RigVMModel___PBIK_1_1_BoneSettings__Const;               // 0x0720 (size: 0x10)
    TArray<FName> RigVMModel___PBIK_1_1_ExcludedBones__Const;                         // 0x0730 (size: 0x10)
    FPBIKSolverSettings RigVMModel___PBIK_1_1_Settings__Const;                        // 0x0740 (size: 0x40)
    FPBIKDebug RigVMModel___PBIK_1_1_Debug__Const;                                    // 0x0780 (size: 0x8)

}; // Size: 0x788

struct FPropertyBag_237ecadeddfa50e0
{
    FVector RigVMModel___From_World_2_Global;                                         // 0x0000 (size: 0x18)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolOr_2_1_Result; // 0x0018 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_LessEqual_1_1_4_Result;          // 0x0019 (size: 0x1)
    double TresholdOfActivation___TresholdOfActivation_LessEqual_1_1_4_A;             // 0x0020 (size: 0x8)
    bool TresholdOfActivation___TresholdOfActivation_GreaterEqual_1_1_4_Result;       // 0x0028 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_3_Result; // 0x0029 (size: 0x1)
    FRigVMInstructionSetExecuteState TresholdOfActivationte_140036621;                // 0x0030 (size: 0x50)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolOr_1_RigVMFunction_MathBoolOr_1_2_Result; // 0x0080 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolOr_1_RigVMFunction_MathBoolOr_1_1_Result; // 0x0081 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolOr_1_RigVMFunction_MathBoolOr_1_Result; // 0x0082 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_LessEqual_1_1_1_Result;          // 0x0083 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_GreaterEqual_1_1_1_Result;       // 0x0084 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_LessEqual_Result;                // 0x0085 (size: 0x1)
    double TresholdOfActivation___TresholdOfActivation_LessEqual_A;                   // 0x0088 (size: 0x8)
    bool TresholdOfActivation___TresholdOfActivation_GreaterEqual_Result;             // 0x0090 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_3_Condition; // 0x0091 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolOr_2_Result; // 0x0092 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolAnd_1_Result; // 0x0093 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolNot_2_Result; // 0x0094 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolNot_1_Result; // 0x0095 (size: 0x1)
    FRigVMInstructionSetExecuteState TresholdOfActivationte_2826487988;               // 0x0098 (size: 0x50)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolAnd_2_Result; // 0x00E8 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_LessEqual_1_1_Result;            // 0x00E9 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_GreaterEqual_1_1_Result;         // 0x00EA (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolAnd_1_1_Result; // 0x00EB (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolNot_2_1_Result; // 0x00EC (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolNot_1_1_Result; // 0x00ED (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolAnd_3_Result; // 0x00EE (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_LessEqual_1_1_3_Result;          // 0x00EF (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_GreaterEqual_1_1_3_Result;       // 0x00F0 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_5_Result; // 0x00F1 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_LessEqual_1_Result;              // 0x00F2 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_5_Condition; // 0x00F3 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_4_Result; // 0x00F4 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolOr_3_Result; // 0x00F5 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_4_Condition; // 0x00F6 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_Result; // 0x00F7 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_Condition; // 0x00F8 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_1_Result; // 0x00F9 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_1_Condition; // 0x00FA (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_2_Result; // 0x00FB (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolOr_4_Result; // 0x00FC (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_2_Condition; // 0x00FD (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolOr_6_Result; // 0x00FE (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolAnd_Result; // 0x00FF (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolOr_Result; // 0x0100 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_LessEqual_1_1_2_Result;          // 0x0101 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_GreaterEqual_1_1_2_Result;       // 0x0102 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolNot_Result; // 0x0103 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolAnd_4_Result; // 0x0104 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolOr_5_Result; // 0x0105 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_LessEqual_1_1_2_1_Result;        // 0x0106 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_GreaterEqual_1_1_2_1_Result;     // 0x0107 (size: 0x1)
    bool TresholdOfActivation___TresholdOfActivation_RigVMFunction_MathBoolNot_3_Result; // 0x0108 (size: 0x1)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Add_Result;      // 0x0110 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Subtract_Result; // 0x0118 (size: 0x8)
    float CalculateEyesRotationAmount___CalculateEyesRotationAmount_RigVMFunction_MathFloatMake_Value__IO; // 0x0120 (size: 0x4)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Subtract_A;      // 0x0128 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Degrees_Result;  // 0x0130 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Acos_Result;     // 0x0138 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Clamp_Result;    // 0x0140 (size: 0x8)
    float CalculateEyesRotationAmount___CalculateEyesRotationAmount_Dot___Result;     // 0x0148 (size: 0x4)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_RigVMFunction_MathVectorCross_Result; // 0x0150 (size: 0x18)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_Unit_1_Result;  // 0x0168 (size: 0x18)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_Subtract_1_Result; // 0x0180 (size: 0x18)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_From_World_2_Global; // 0x0198 (size: 0x18)
    FTransform CalculateEyesRotationAmount___CalculateEyesRotationAmount_GetTransform_3_Transform; // 0x01B0 (size: 0x60)
    TArray<FCachedRigElement> CalculateEyesRotationAmount___CalculateEyesRotationAmount_GetTransform_3_CachedIndex; // 0x0210 (size: 0x10)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_Subtract_1_B;   // 0x0220 (size: 0x18)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_Rotate_Vector_Result; // 0x0238 (size: 0x18)
    FTransform CalculateEyesRotationAmount___CalculateEyesRotationAmount_GetTransform_3_1_Transform; // 0x0250 (size: 0x60)
    TArray<FCachedRigElement> CalculateEyesRotationAmount___CalculateEyesRotationAmount_GetTransform_3_1_CachedIndex; // 0x02B0 (size: 0x10)
    FQuat CalculateEyesRotationAmount___CalculateEyesRotationAmount_Rotate_Vector_Transform; // 0x02C0 (size: 0x20)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_Rotate_Vector_2_Result; // 0x02E0 (size: 0x18)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Clamp_Value;     // 0x02F8 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Add_B;           // 0x0300 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Add_1_Result;    // 0x0308 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Subtract_2_Result; // 0x0310 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Degrees_1_Result; // 0x0318 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Acos_1_Result;   // 0x0320 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Clamp_1_Result;  // 0x0328 (size: 0x8)
    float CalculateEyesRotationAmount___CalculateEyesRotationAmount_Dot___1_Result;   // 0x0330 (size: 0x4)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_Unit_2_Result;  // 0x0338 (size: 0x18)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_Rotate_Vector_1_Result; // 0x0350 (size: 0x18)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Clamp_1_Value;   // 0x0368 (size: 0x8)
    float CalculateEyesRotationAmount___CalculateEyesRotationAmount_RigVMFunction_MathFloatMake_1_Value__IO; // 0x0370 (size: 0x4)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Subtract_2_B;    // 0x0378 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Negate_Result;   // 0x0380 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Negate_Value;    // 0x0388 (size: 0x8)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_2_Result; // 0x0390 (size: 0x4)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_Result; // 0x0398 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_2_Result; // 0x03A0 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_2_A; // 0x03A8 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_1_1_Result; // 0x03B0 (size: 0x8)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_1_1_Condition; // 0x03B8 (size: 0x1)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_1_1_1_Result; // 0x03C0 (size: 0x8)
    FRigVMInstructionSetExecuteState ApplyingOffsetRotationToBones_1te_1626735482;    // 0x03C8 (size: 0x50)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_3_Valid; // 0x0418 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_3_Value; // 0x041C (size: 0x4)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_3_CachedCurveIndex; // 0x0420 (size: 0x10)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_1_1_1_Condition; // 0x0430 (size: 0x1)
    FRigVMInstructionSetExecuteState ApplyingOffsetRotationToBones_1te_174304987;     // 0x0438 (size: 0x50)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_1_Result; // 0x0488 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_1_A; // 0x0490 (size: 0x8)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_ReduceInfluenceBecauseGimbal_1_ResultZ; // 0x0498 (size: 0x4)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_ReduceInfluenceBecauseGimbal_1_RotationY; // 0x04A0 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_ReduceInfluenceBecauseGimbal_1_ResultY; // 0x04A8 (size: 0x8)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_ReduceInfluenceBecauseGimbal_1_ConditionZ; // 0x04B0 (size: 0x1)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_ReduceInfluenceBecauseGimbal_1_ConditionY; // 0x04B1 (size: 0x1)
    bool ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_RigVMFunction_MathBoolAnd_2_Result; // 0x04B2 (size: 0x1)
    bool ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_LessEqual_Result; // 0x04B3 (size: 0x1)
    bool ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_LessEqual_2_Result; // 0x04B4 (size: 0x1)
    bool ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_RigVMFunction_MathBoolAnd_3_Result; // 0x04B5 (size: 0x1)
    bool ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_GreaterEqual_Result; // 0x04B6 (size: 0x1)
    float ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_DISPATCH_RigVMDispatch_If_Result; // 0x04B8 (size: 0x4)
    bool ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_GreaterEqual_2_Result; // 0x04BC (size: 0x1)
    bool ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_GreaterEqual_1_Result; // 0x04BD (size: 0x1)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_B; // 0x04C0 (size: 0x8)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_2_Target; // 0x04C8 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_12_Result; // 0x04CC (size: 0x4)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_12_Condition; // 0x04D0 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_3_Result; // 0x04D4 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_2_Current; // 0x04D8 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_2_Velocity; // 0x04DC (size: 0x4)
    TArray<float> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_2_SimulatedResult; // 0x04E0 (size: 0x10)
    TArray<FFloatSpringState> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_2_SpringState; // 0x04F0 (size: 0x10)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_1_Result; // 0x0500 (size: 0x4)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_1_1_Result; // 0x0508 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_2_2_Result; // 0x0510 (size: 0x8)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_2_2_Condition; // 0x0518 (size: 0x1)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_2_Result; // 0x0520 (size: 0x8)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_2_Condition; // 0x0528 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_1_Target; // 0x052C (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_1_Current; // 0x0530 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_1_Velocity; // 0x0534 (size: 0x4)
    TArray<float> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_1_SimulatedResult; // 0x0538 (size: 0x10)
    TArray<FFloatSpringState> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_1_SpringState; // 0x0548 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_Result; // 0x0560 (size: 0x20)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_Euler__IO; // 0x0580 (size: 0x18)
    FTransform ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_2_OffsetTransform__IO; // 0x05A0 (size: 0x60)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_2_CachedIndex; // 0x0600 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_2_Result; // 0x0610 (size: 0x20)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_4_Result; // 0x0630 (size: 0x8)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionToEuler_1_2_2_Result; // 0x0638 (size: 0x18)
    FTransform ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetTransform_3_Transform; // 0x0650 (size: 0x60)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetTransform_3_CachedIndex; // 0x06B0 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionToEuler_1_2_2_Value; // 0x06C0 (size: 0x20)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_4_Value; // 0x06E0 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_5_Result; // 0x06E8 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_5_Value; // 0x06F0 (size: 0x8)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_2_Euler__IO; // 0x06F8 (size: 0x18)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Set_Transform_2_CachedIndex; // 0x0710 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_Result; // 0x0720 (size: 0x20)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_Euler__IO; // 0x0740 (size: 0x18)
    FTransform ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_1_OffsetTransform__IO; // 0x0760 (size: 0x60)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_1_CachedIndex; // 0x07C0 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_1_Result; // 0x07D0 (size: 0x20)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_2_Result; // 0x07F0 (size: 0x8)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionToEuler_1_1_Result; // 0x07F8 (size: 0x18)
    FTransform ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetTransform_1_2_Transform; // 0x0810 (size: 0x60)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetTransform_1_2_CachedIndex; // 0x0870 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionToEuler_1_1_Value; // 0x0880 (size: 0x20)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_2_Value; // 0x08A0 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_3_Result; // 0x08A8 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_3_Value; // 0x08B0 (size: 0x8)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_1_Euler__IO; // 0x08B8 (size: 0x18)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Set_Transform_1_1_CachedIndex; // 0x08D0 (size: 0x10)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_Result; // 0x08E0 (size: 0x4)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_2_1_Result; // 0x08E8 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_CalculateSurplusYawRotation_1_Result; // 0x08F0 (size: 0x8)
    double CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_Subtract_Result; // 0x08F8 (size: 0x8)
    FRotator CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_DISPATCH_RigVMDispatch_BreakStruct_2_Elements; // 0x0900 (size: 0x18)
    FRotator CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_Cast_3_Result; // 0x0918 (size: 0x18)
    FTransform CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_GetTransform_1_1_Transform; // 0x0930 (size: 0x60)
    TArray<FCachedRigElement> CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_GetTransform_1_1_CachedIndex; // 0x0990 (size: 0x10)
    FQuat CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_Cast_3_Value;   // 0x09A0 (size: 0x20)
    double CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_Subtract_A;    // 0x09C0 (size: 0x8)
    FRotator CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_DISPATCH_RigVMDispatch_BreakStruct_3_Elements; // 0x09C8 (size: 0x18)
    FRotator CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_Cast_Result; // 0x09E0 (size: 0x18)
    double CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_Subtract_B;    // 0x09F8 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_1_Result; // 0x0A00 (size: 0x8)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_1_Condition; // 0x0A08 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_9_1_Result; // 0x0A0C (size: 0x4)
    FRigVMInstructionSetExecuteState ApplyingOffsetRotationToBones_1te_647058326;     // 0x0A10 (size: 0x50)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GreaterEqual_Result; // 0x0A60 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_Value; // 0x0A64 (size: 0x4)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_Valid; // 0x0A68 (size: 0x1)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_CachedCurveIndex; // 0x0A70 (size: 0x10)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GreaterEqual_A; // 0x0A80 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_1_True; // 0x0A88 (size: 0x8)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_Target; // 0x0A90 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_3_1_Result; // 0x0A94 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_Current; // 0x0A98 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_Velocity; // 0x0A9C (size: 0x4)
    TArray<float> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_SimulatedResult; // 0x0AA0 (size: 0x10)
    TArray<FFloatSpringState> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_SpringState; // 0x0AB0 (size: 0x10)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_Result; // 0x0AC0 (size: 0x4)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_1_1_1_Result; // 0x0AC8 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_CalculateSurplusPitchRotation_Result; // 0x0AD0 (size: 0x8)
    double CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_Subtract_Result; // 0x0AD8 (size: 0x8)
    FRotator CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_DISPATCH_RigVMDispatch_BreakStruct_2_Elements; // 0x0AE0 (size: 0x18)
    FRotator CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_Cast_3_Result; // 0x0AF8 (size: 0x18)
    FTransform CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_GetTransform_1_1_Transform; // 0x0B10 (size: 0x60)
    TArray<FCachedRigElement> CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_GetTransform_1_1_CachedIndex; // 0x0B70 (size: 0x10)
    FQuat CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_Cast_3_Value; // 0x0B80 (size: 0x20)
    double CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_Subtract_A;  // 0x0BA0 (size: 0x8)
    FRotator CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_DISPATCH_RigVMDispatch_BreakStruct_3_Elements; // 0x0BA8 (size: 0x18)
    FRotator CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_Cast_Result; // 0x0BC0 (size: 0x18)
    double CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_Subtract_B;  // 0x0BD8 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_Result; // 0x0BE0 (size: 0x8)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_Condition; // 0x0BE8 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_9_Result; // 0x0BEC (size: 0x4)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_True; // 0x0BF0 (size: 0x8)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_Target; // 0x0BF8 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_Current; // 0x0BFC (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_Velocity; // 0x0C00 (size: 0x4)
    TArray<float> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_SimulatedResult; // 0x0C08 (size: 0x10)
    TArray<FFloatSpringState> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_3_SpringState; // 0x0C18 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_2_Result; // 0x0C30 (size: 0x20)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_2_Euler__IO; // 0x0C50 (size: 0x18)
    FTransform ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_OffsetTransform__IO; // 0x0C70 (size: 0x60)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_CachedIndex; // 0x0CD0 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_3_Result; // 0x0CE0 (size: 0x20)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_1_Result; // 0x0D00 (size: 0x8)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionToEuler_1_Result; // 0x0D08 (size: 0x18)
    FTransform ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetTransform_2_Transform; // 0x0D20 (size: 0x60)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetTransform_2_CachedIndex; // 0x0D80 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionToEuler_1_Value; // 0x0D90 (size: 0x20)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_1_Value; // 0x0DB0 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_1_1_Result; // 0x0DB8 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_1_1_Value; // 0x0DC0 (size: 0x8)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_3_Euler__IO; // 0x0DC8 (size: 0x18)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Set_Transform_1_CachedIndex; // 0x0DE0 (size: 0x10)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Greater_1_Result; // 0x0DF0 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_2_1_Value; // 0x0DF4 (size: 0x4)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_2_1_Valid; // 0x0DF8 (size: 0x1)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_2_1_CachedCurveIndex; // 0x0E00 (size: 0x10)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Greater_1_A; // 0x0E10 (size: 0x8)
    FRigVMInstructionSetExecuteState ApplyingOffsetRotationToBones_1te_2848804945;    // 0x0E18 (size: 0x50)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_2_1_Result; // 0x0E70 (size: 0x20)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_1_1_Result; // 0x0E90 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_2_Result; // 0x0E94 (size: 0x4)
    FRigVMInstructionSetExecuteState ApplyingOffsetRotationToBones_1te_3164146577;    // 0x0E98 (size: 0x50)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathBoolAnd_2_Result; // 0x0EE8 (size: 0x1)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_LessEqual_1_Result; // 0x0EE9 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_2_2_Value; // 0x0EEC (size: 0x4)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_2_2_Valid; // 0x0EF0 (size: 0x1)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_2_2_CachedCurveIndex; // 0x0EF8 (size: 0x10)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_LessEqual_1_A; // 0x0F08 (size: 0x8)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_2_Condition; // 0x0F10 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_2_True; // 0x0F14 (size: 0x4)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_CalculateSurplusPitchRotation_1_Result; // 0x0F18 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_1_1_1_1_Result; // 0x0F20 (size: 0x8)
    FRigVMInstructionSetExecuteState ApplyingOffsetRotationToBones_1te_1562063599;    // 0x0F28 (size: 0x50)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_1_2_Result; // 0x0F78 (size: 0x8)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_1_2_Condition; // 0x0F80 (size: 0x1)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_7_Result; // 0x0F88 (size: 0x8)
    FRigVMInstructionSetExecuteState ApplyingOffsetRotationToBones_1te_812266961;     // 0x0F90 (size: 0x50)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_2_Valid; // 0x0FE0 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_2_Value; // 0x0FE4 (size: 0x4)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_2_CachedCurveIndex; // 0x0FE8 (size: 0x10)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_7_Condition; // 0x0FF8 (size: 0x1)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Absolute_Result; // 0x1000 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Subtract_Result; // 0x1008 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Subtract_A; // 0x1010 (size: 0x8)
    double CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_Subtract_Result; // 0x1018 (size: 0x8)
    FRotator CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_DISPATCH_RigVMDispatch_BreakStruct_2_Elements; // 0x1020 (size: 0x18)
    FRotator CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_Cast_3_Result; // 0x1038 (size: 0x18)
    FTransform CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_GetTransform_1_1_Transform; // 0x1050 (size: 0x60)
    TArray<FCachedRigElement> CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_GetTransform_1_1_CachedIndex; // 0x10B0 (size: 0x10)
    FQuat CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_Cast_3_Value; // 0x10C0 (size: 0x20)
    double CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_Subtract_A; // 0x10E0 (size: 0x8)
    FRotator CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_DISPATCH_RigVMDispatch_BreakStruct_3_Elements; // 0x10E8 (size: 0x18)
    FRotator CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_Cast_Result; // 0x1100 (size: 0x18)
    double CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_Subtract_B; // 0x1118 (size: 0x8)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_2_False; // 0x1120 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_1_1_Velocity; // 0x1124 (size: 0x4)
    TArray<float> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_1_1_SimulatedResult; // 0x1128 (size: 0x10)
    TArray<FFloatSpringState> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_1_1_SpringState; // 0x1138 (size: 0x10)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_1_Result; // 0x1148 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_2_1_Result; // 0x114C (size: 0x4)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_2_1_Condition; // 0x1150 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_2_1_True; // 0x1154 (size: 0x4)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Negate_2_Result; // 0x1158 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_CalculateSurplusYawRotation_Result; // 0x1160 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_2_1_1_Result; // 0x1168 (size: 0x8)
    double CalculateSurplusYawRotation___CalculateSurplusYawRotation_Subtract_Result; // 0x1170 (size: 0x8)
    FRotator CalculateSurplusYawRotation___CalculateSurplusYawRotation_DISPATCH_RigVMDispatch_BreakStruct_2_Elements; // 0x1178 (size: 0x18)
    FRotator CalculateSurplusYawRotation___CalculateSurplusYawRotation_Cast_3_Result; // 0x1190 (size: 0x18)
    FTransform CalculateSurplusYawRotation___CalculateSurplusYawRotation_GetTransform_1_1_Transform; // 0x11B0 (size: 0x60)
    TArray<FCachedRigElement> CalculateSurplusYawRotation___CalculateSurplusYawRotation_GetTransform_1_1_CachedIndex; // 0x1210 (size: 0x10)
    FQuat CalculateSurplusYawRotation___CalculateSurplusYawRotation_Cast_3_Value;     // 0x1220 (size: 0x20)
    double CalculateSurplusYawRotation___CalculateSurplusYawRotation_Subtract_A;      // 0x1240 (size: 0x8)
    FRotator CalculateSurplusYawRotation___CalculateSurplusYawRotation_DISPATCH_RigVMDispatch_BreakStruct_3_Elements; // 0x1248 (size: 0x18)
    FRotator CalculateSurplusYawRotation___CalculateSurplusYawRotation_Cast_Result;   // 0x1260 (size: 0x18)
    double CalculateSurplusYawRotation___CalculateSurplusYawRotation_Subtract_B;      // 0x1278 (size: 0x8)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_2_1_False; // 0x1280 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_1_Velocity; // 0x1284 (size: 0x4)
    TArray<float> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_1_SimulatedResult; // 0x1288 (size: 0x10)
    TArray<FFloatSpringState> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_1_SpringState; // 0x1298 (size: 0x10)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_2_1_Euler__IO; // 0x12A8 (size: 0x18)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Set_Transform_CachedIndex; // 0x12C0 (size: 0x10)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Set_Transform_3_CachedIndex; // 0x12D0 (size: 0x10)
    FTransform ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_1_1_OffsetTransform__IO; // 0x12E0 (size: 0x60)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_1_1_CachedIndex; // 0x1340 (size: 0x10)
    FTransform ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_2_1_OffsetTransform__IO; // 0x1350 (size: 0x60)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_2_1_CachedIndex; // 0x13B0 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_2_1_1_Result; // 0x13C0 (size: 0x20)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_5_1_1_Result; // 0x13E0 (size: 0x8)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionToEuler_1_2_1_1_1_Result; // 0x13E8 (size: 0x18)
    FTransform ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetTransform_3_1_1_Transform; // 0x1400 (size: 0x60)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetTransform_3_1_1_CachedIndex; // 0x1460 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionToEuler_1_2_1_1_1_Value; // 0x1470 (size: 0x20)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_5_1_1_Value; // 0x1490 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_4_1_1_Result; // 0x1498 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_4_1_1_Value; // 0x14A0 (size: 0x8)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_2_1_1_Euler__IO; // 0x14A8 (size: 0x18)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Set_Transform_3_1_1_CachedIndex; // 0x14C0 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_2_1_Result; // 0x14D0 (size: 0x20)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_5_1_Result; // 0x14F0 (size: 0x8)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionToEuler_1_2_1_1_Result; // 0x14F8 (size: 0x18)
    FTransform ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetTransform_3_1_Transform; // 0x1510 (size: 0x60)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetTransform_3_1_CachedIndex; // 0x1570 (size: 0x10)
    FQuat ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionToEuler_1_2_1_1_Value; // 0x1580 (size: 0x20)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_5_1_Value; // 0x15A0 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_4_1_Result; // 0x15A8 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_4_1_Value; // 0x15B0 (size: 0x8)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_2_1_Euler__IO; // 0x15B8 (size: 0x18)
    TArray<FCachedRigElement> ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Set_Transform_3_1_CachedIndex; // 0x15D0 (size: 0x10)
    FName ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x15E0 (size: 0x8)
    FTransform RigVMModel___GetTransform_Transform;                                   // 0x15F0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_CachedIndex;                  // 0x1650 (size: 0x10)
    FTransform RigVMModel___GetTransform_1_Transform;                                 // 0x1660 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_1_CachedIndex;                // 0x16C0 (size: 0x10)
    FTransform RigVMModel___GetTransform_2_Transform;                                 // 0x16D0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_2_CachedIndex;                // 0x1730 (size: 0x10)

}; // Size: 0x1740

struct FPropertyBag_5f1829155d8ca817
{
    bool RigVMModel___RigVMFunction_MathBoolAnd_4_Result;                             // 0x0000 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolOr_2_Result;                              // 0x0001 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolOr_1_1_Result;                            // 0x0002 (size: 0x1)
    bool RigVMModel___IsNearlyEqual_Result;                                           // 0x0003 (size: 0x1)
    float RigVMModel___GetCurveValue_Value;                                           // 0x0004 (size: 0x4)
    bool RigVMModel___GetCurveValue_Valid;                                            // 0x0008 (size: 0x1)
    TArray<FCachedRigElement> RigVMModel___GetCurveValue_CachedCurveIndex;            // 0x0010 (size: 0x10)
    double RigVMModel___IsNearlyEqual_A;                                              // 0x0020 (size: 0x8)
    bool RigVMModel___Greater_5_Result;                                               // 0x0028 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolOr_1_Result;                              // 0x0029 (size: 0x1)
    bool RigVMModel___IsNearlyEqual_5_Result;                                         // 0x002A (size: 0x1)
    float RigVMModel___GetCurveValue_1_Value;                                         // 0x002C (size: 0x4)
    bool RigVMModel___GetCurveValue_1_Valid;                                          // 0x0030 (size: 0x1)
    TArray<FCachedRigElement> RigVMModel___GetCurveValue_1_CachedCurveIndex;          // 0x0038 (size: 0x10)
    double RigVMModel___IsNearlyEqual_5_A;                                            // 0x0048 (size: 0x8)
    bool RigVMModel___Greater_5_1_Result;                                             // 0x0050 (size: 0x1)
    double RigVMModel___DISPATCH_RigVMDispatch_If_5_Result;                           // 0x0058 (size: 0x8)
    bool RigVMModel___DISPATCH_RigVMDispatch_If_5_Condition;                          // 0x0060 (size: 0x1)
    FTransform RigVMModel___To_World_2_World;                                         // 0x0070 (size: 0x60)
    FTransform RigVMModel___GetTransform_2_2_2_Transform;                             // 0x00D0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_2_2_2_CachedIndex;            // 0x0130 (size: 0x10)
    double RigVMModel___DISPATCH_RigVMDispatch_If_5_False;                            // 0x0140 (size: 0x8)
    FTransform RigVMModel___GetTransform_4_Transform;                                 // 0x0150 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_4_CachedIndex;                // 0x01B0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_5_CachedIndex;               // 0x01C0 (size: 0x10)
    FTransform RigVMModel___GetTransform_Transform;                                   // 0x01D0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_CachedIndex;                  // 0x0230 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_CachedIndex;                 // 0x0240 (size: 0x10)
    FTransform RigVMModel___GetTransform_1_Transform;                                 // 0x0250 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_1_CachedIndex;                // 0x02B0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_1_CachedIndex;               // 0x02C0 (size: 0x10)
    FTransform RigVMModel___GetTransform_1_1_Transform;                               // 0x02D0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_1_1_CachedIndex;              // 0x0330 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_1_1_CachedIndex;             // 0x0340 (size: 0x10)
    FTransform RigVMModel___GetTransform_1_1_1_Transform;                             // 0x0350 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_1_1_1_CachedIndex;            // 0x03B0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_1_1_1_CachedIndex;           // 0x03C0 (size: 0x10)
    FTransform RigVMModel___GetTransform_1_1_2_Transform;                             // 0x03D0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_1_1_2_CachedIndex;            // 0x0430 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_1_1_2_CachedIndex;           // 0x0440 (size: 0x10)
    FTransform RigVMModel___GetTransform_1_1_1_1_Transform;                           // 0x0450 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_1_1_1_1_CachedIndex;          // 0x04B0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_1_1_1_1_CachedIndex;         // 0x04C0 (size: 0x10)
    FTransform RigVMModel___GetTransform_1_1_2_1_Transform;                           // 0x04D0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_1_1_2_1_CachedIndex;          // 0x0530 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_1_1_2_1_CachedIndex;         // 0x0540 (size: 0x10)
    bool RigVMModel___LFoot_SearchForFloor_FoundHit;                                  // 0x0550 (size: 0x1)
    double RigVMModel___LFoot_SearchForFloor_FloorOffsetZ;                            // 0x0558 (size: 0x8)
    FVector RigVMModel___LFoot_SearchForFloor_FloorNormal;                            // 0x0560 (size: 0x18)
    bool RigVMModel___LFoot_SearchForFloor_ToeInFloorHit;                             // 0x0578 (size: 0x1)
    FRigVMInstructionSetExecuteState LFoot_SearchForFloorte_308450237;                // 0x0580 (size: 0x50)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_Result;                   // 0x05D0 (size: 0x18)
    FTransform LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_Transform;    // 0x05F0 (size: 0x60)
    TArray<FCachedRigElement> LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_CachedIndex; // 0x0650 (size: 0x10)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_A;                        // 0x0660 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_B__IO;                    // 0x0678 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Subtract_Result;              // 0x0690 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Subtract_B__IO;               // 0x06A8 (size: 0x18)
    FRigVMInstructionSetExecuteState LFoot_SearchForFloorte_1331173338;               // 0x06C0 (size: 0x50)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_bHit;  // 0x0710 (size: 0x1)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_HitLocation; // 0x0718 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_HitNormal; // 0x0730 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_WorkData; // 0x0748 (size: 0x10)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_MathBoolNot_Result; // 0x0758 (size: 0x1)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_LessEqual_Result;                // 0x0759 (size: 0x1)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_LessEqual_A;                   // 0x0760 (size: 0x8)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Result; // 0x0768 (size: 0x4)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Condition; // 0x076C (size: 0x1)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Add_1_Result;                  // 0x0770 (size: 0x8)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Add_1_B;                       // 0x0778 (size: 0x8)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_False; // 0x0780 (size: 0x4)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_Result; // 0x0788 (size: 0x18)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_Condition; // 0x07A0 (size: 0x1)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_Velocity;        // 0x07A8 (size: 0x18)
    TArray<FVector> LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_SimulatedResult; // 0x07C0 (size: 0x10)
    TArray<FVectorSpringState> LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_SpringState; // 0x07D0 (size: 0x10)
    FVector RigVMModel___RFoot_SearchForFloor_FloorNormal;                            // 0x07E0 (size: 0x18)
    double RigVMModel___RFoot_SearchForFloor_FloorOffsetZ;                            // 0x07F8 (size: 0x8)
    bool RigVMModel___RFoot_SearchForFloor_FloorFound;                                // 0x0800 (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_Result; // 0x0808 (size: 0x18)
    FRigVMInstructionSetExecuteState RFoot_SearchForFloorte_807414511;                // 0x0820 (size: 0x50)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_bHit;  // 0x0870 (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_Result;                   // 0x0878 (size: 0x18)
    FTransform RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_Transform;    // 0x0890 (size: 0x60)
    TArray<FCachedRigElement> RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_CachedIndex; // 0x08F0 (size: 0x10)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_A;                        // 0x0900 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_B__IO;                    // 0x0918 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Subtract_Result;              // 0x0930 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Subtract_B__IO;               // 0x0948 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_HitLocation; // 0x0960 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_HitNormal; // 0x0978 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_WorkData; // 0x0990 (size: 0x10)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_Condition; // 0x09A0 (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_Velocity;        // 0x09A8 (size: 0x18)
    TArray<FVector> RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_SimulatedResult; // 0x09C0 (size: 0x10)
    TArray<FVectorSpringState> RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_SpringState; // 0x09D0 (size: 0x10)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Result; // 0x09E0 (size: 0x4)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_LessEqual_Result;                // 0x09E4 (size: 0x1)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_LessEqual_A;                   // 0x09E8 (size: 0x8)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Condition; // 0x09F0 (size: 0x1)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Add_1_Result;                  // 0x09F8 (size: 0x8)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Add_1_B;                       // 0x0A00 (size: 0x8)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_False; // 0x0A08 (size: 0x4)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_MathBoolNot_Result; // 0x0A0C (size: 0x1)
    float RigVMModel___SpringInterp_Result;                                           // 0x0A10 (size: 0x4)
    double RigVMModel___Minimum_Result;                                               // 0x0A18 (size: 0x8)
    float RigVMModel___SpringInterp_Target;                                           // 0x0A20 (size: 0x4)
    float RigVMModel___SpringInterp_Current;                                          // 0x0A24 (size: 0x4)
    float RigVMModel___SpringInterp_Velocity;                                         // 0x0A28 (size: 0x4)
    TArray<float> RigVMModel___SpringInterp_SimulatedResult;                          // 0x0A30 (size: 0x10)
    TArray<FFloatSpringState> RigVMModel___SpringInterp_SpringState;                  // 0x0A40 (size: 0x10)
    FVector RigVMModel___Rotate_Vector_Result;                                        // 0x0A50 (size: 0x18)
    FTransform RigVMModel___Inverse_Result;                                           // 0x0A70 (size: 0x60)
    FTransform RigVMModel___GetTransform_2_Transform;                                 // 0x0AD0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_2_CachedIndex;                // 0x0B30 (size: 0x10)
    FVector RigVMModel___Rotate_Vector_Vector__IO;                                    // 0x0B40 (size: 0x18)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_2_CachedIndex;               // 0x0B58 (size: 0x10)
    double RigVMModel___Adjust_LFootHeight_New_Foot_Height;                           // 0x0B68 (size: 0x8)
    FVector Adjust_LFootHeight___Adjust_LFootHeight_Rotate_Vector_Result;             // 0x0B70 (size: 0x18)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_Inverse_Result;                // 0x0B90 (size: 0x60)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_Transform;        // 0x0BF0 (size: 0x60)
    TArray<FCachedRigElement> Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_CachedIndex; // 0x0C50 (size: 0x10)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Result;                // 0x0C60 (size: 0x4)
    double Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_Result;  // 0x0C68 (size: 0x8)
    bool Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_Condition; // 0x0C70 (size: 0x1)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Target;                // 0x0C74 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Current;               // 0x0C78 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Velocity;              // 0x0C7C (size: 0x4)
    TArray<float> Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_SimulatedResult; // 0x0C80 (size: 0x10)
    TArray<FFloatSpringState> Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_SpringState; // 0x0C90 (size: 0x10)
    FVector Adjust_LFootHeight___Adjust_LFootHeight_Rotate_Vector_Vector__IO;         // 0x0CA0 (size: 0x18)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_OffsetTransform__IO; // 0x0CC0 (size: 0x60)
    TArray<FCachedRigElement> Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_CachedIndex; // 0x0D20 (size: 0x10)
    double RigVMModel___Adjust_RFootHeight_New_Foot_Height;                           // 0x0D30 (size: 0x8)
    FVector Adjust_RFootHeight___Adjust_RFootHeight_Rotate_Vector_Result;             // 0x0D38 (size: 0x18)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_Inverse_Result;                // 0x0D50 (size: 0x60)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_Transform;        // 0x0DB0 (size: 0x60)
    TArray<FCachedRigElement> Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_CachedIndex; // 0x0E10 (size: 0x10)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Result;                // 0x0E20 (size: 0x4)
    double Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_Result;  // 0x0E28 (size: 0x8)
    bool Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_Condition; // 0x0E30 (size: 0x1)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Target;                // 0x0E34 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Current;               // 0x0E38 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Velocity;              // 0x0E3C (size: 0x4)
    TArray<float> Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_SimulatedResult; // 0x0E40 (size: 0x10)
    TArray<FFloatSpringState> Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_SpringState; // 0x0E50 (size: 0x10)
    FVector Adjust_RFootHeight___Adjust_RFootHeight_Rotate_Vector_Vector__IO;         // 0x0E60 (size: 0x18)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_OffsetTransform__IO; // 0x0E80 (size: 0x60)
    TArray<FCachedRigElement> Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_CachedIndex; // 0x0EE0 (size: 0x10)
    FRotator RigVMModel___Adjust_LFoot_Rotation_NormalAngle;                          // 0x0EF0 (size: 0x18)
    FTransform Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_AimBoneMath_Result;      // 0x0F10 (size: 0x60)
    FTransform Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_1_Transform; // 0x0F70 (size: 0x60)
    TArray<FCachedRigElement> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_1_CachedIndex; // 0x0FD0 (size: 0x10)
    FRigUnit_AimItem_Target Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_AimBoneMath_Primary__IO; // 0x0FE0 (size: 0x48)
    TArray<FCachedRigElement> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_AimBoneMath_PrimaryCachedSpace; // 0x1028 (size: 0x10)
    TArray<FCachedRigElement> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_AimBoneMath_SecondaryCachedSpace; // 0x1038 (size: 0x10)
    TArray<bool> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_AimBoneMath_bIsInitialized; // 0x1048 (size: 0x10)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_VisualDebug_Value__IO;        // 0x1060 (size: 0x20)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_Result;                // 0x1080 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_Value;                 // 0x1088 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_1_Result;              // 0x1090 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_1_Value;               // 0x1098 (size: 0x8)
    FRotator Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionToRotator_Result; // 0x10A0 (size: 0x18)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Multiply_Result;              // 0x10C0 (size: 0x20)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionFromRotatorV2_Result; // 0x10E0 (size: 0x20)
    FTransform Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_Transform;  // 0x1100 (size: 0x60)
    TArray<FCachedRigElement> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_CachedIndex; // 0x1160 (size: 0x10)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Multiply_B;                   // 0x1170 (size: 0x20)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_Result; // 0x1190 (size: 0x20)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionFromRotatorV2_1_Result; // 0x11B0 (size: 0x20)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_AngularVelocity; // 0x11D0 (size: 0x18)
    TArray<FQuat> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_SimulatedResult; // 0x11E8 (size: 0x10)
    TArray<FQuaternionSpringState> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_SpringState; // 0x11F8 (size: 0x10)
    TArray<FCachedRigElement> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Set_Transform_CachedIndex; // 0x1208 (size: 0x10)
    FRotator RigVMModel___Adjust_RFoot_Rotation_NormalAngle;                          // 0x1218 (size: 0x18)
    FTransform Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_AimBoneMath_Result;      // 0x1230 (size: 0x60)
    FTransform Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_1_Transform; // 0x1290 (size: 0x60)
    TArray<FCachedRigElement> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_1_CachedIndex; // 0x12F0 (size: 0x10)
    FRigUnit_AimItem_Target Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_AimBoneMath_Primary__IO; // 0x1300 (size: 0x48)
    TArray<FCachedRigElement> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_AimBoneMath_PrimaryCachedSpace; // 0x1348 (size: 0x10)
    TArray<FCachedRigElement> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_AimBoneMath_SecondaryCachedSpace; // 0x1358 (size: 0x10)
    TArray<bool> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_AimBoneMath_bIsInitialized; // 0x1368 (size: 0x10)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_VisualDebug_Value__IO;        // 0x1380 (size: 0x20)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_Result;                // 0x13A0 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_Value;                 // 0x13A8 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_Result;              // 0x13B0 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_Value;               // 0x13B8 (size: 0x8)
    FRotator Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionToRotator_Result; // 0x13C0 (size: 0x18)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Multiply_Result;              // 0x13E0 (size: 0x20)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionFromRotatorV2_Result; // 0x1400 (size: 0x20)
    FTransform Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_Transform;  // 0x1420 (size: 0x60)
    TArray<FCachedRigElement> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_CachedIndex; // 0x1480 (size: 0x10)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Multiply_B;                   // 0x1490 (size: 0x20)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_Result; // 0x14B0 (size: 0x20)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionFromRotatorV2_1_Result; // 0x14D0 (size: 0x20)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_AngularVelocity; // 0x14F0 (size: 0x18)
    TArray<FQuat> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_SimulatedResult; // 0x1508 (size: 0x10)
    TArray<FQuaternionSpringState> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_SpringState; // 0x1518 (size: 0x10)
    TArray<FCachedRigElement> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Set_Transform_CachedIndex; // 0x1528 (size: 0x10)
    FTransform RigVMModel___GetTransform_3_Transform;                                 // 0x1540 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_3_CachedIndex;                // 0x15A0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_3_CachedIndex;               // 0x15B0 (size: 0x10)
    FTransform RigVMModel___GetTransform_3_1_3_Transform;                             // 0x15C0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_3_1_3_CachedIndex;            // 0x1620 (size: 0x10)
    FTransform RigVMModel___GetTransform_3_1_1_1_Transform;                           // 0x1630 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_3_1_1_1_CachedIndex;          // 0x1690 (size: 0x10)
    FTransform RigVMModel___GetTransform_3_1_2_1_Transform;                           // 0x16A0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_3_1_2_1_CachedIndex;          // 0x1700 (size: 0x10)
    TArray<FPBIKEffector> RigVMModel___PBIK_1_1_Effectors__IO;                        // 0x1710 (size: 0x10)
    TArray<TArray<int32>> RigVMModel___PBIK_1_1_EffectorSolverIndices;                // 0x1720 (size: 0x10)
    TArray<FPBIKWorkData> RigVMModel___PBIK_1_1_WorkData;                             // 0x1730 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_Transform;                           // 0x1740 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_CachedIndex;          // 0x17A0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_CachedIndex;          // 0x17B0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_1_CachedIndex;        // 0x17C0 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_2_Transform;                         // 0x17D0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_2_CachedIndex;        // 0x1830 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_2_CachedIndex;        // 0x1840 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_1_Transform;                         // 0x1850 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_1_CachedIndex;        // 0x18B0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_3_CachedIndex;        // 0x18C0 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_3_Transform;                         // 0x18D0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_3_CachedIndex;        // 0x1930 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_4_CachedIndex;        // 0x1940 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_4_Transform;                         // 0x1950 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_4_CachedIndex;        // 0x19B0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_5_CachedIndex;        // 0x19C0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_6_CachedIndex;        // 0x19D0 (size: 0x10)
    FTransform RigVMModel___To_World_2_1_World;                                       // 0x19E0 (size: 0x60)
    FTransform RigVMModel___GetTransform_2_2_2_1_Transform;                           // 0x1A40 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_2_2_2_1_CachedIndex;          // 0x1AA0 (size: 0x10)

}; // Size: 0x1AB0

struct FPropertyBag_62cca1561045e23e
{
    FLinearColor RigVMModel___RigVMFunction_DebugLineNoSpace_Color__Const;            // 0x0000 (size: 0x10)
    float RigVMModel___RigVMFunction_DebugLineNoSpace_Thickness__Const;               // 0x0010 (size: 0x4)
    FTransform RigVMModel___RigVMFunction_DebugLineNoSpace_WorldOffset__Const;        // 0x0020 (size: 0x60)
    bool RigVMModel___RigVMFunction_DebugLineNoSpace_bEnabled__Const;                 // 0x0080 (size: 0x1)
    bool LocalVariableDefault__TresholdOfActivation_LessEqual_1_1_2_Result__Const;    // 0x0081 (size: 0x1)
    double TresholdOfActivation___TresholdOfActivation_LessEqual_1_1_4_B__Const;      // 0x0088 (size: 0x8)
    double TresholdOfActivation___TresholdOfActivation_GreaterEqual_1_1_4_B__Const;   // 0x0090 (size: 0x8)
    double TresholdOfActivation___TresholdOfActivation_LessEqual_1_1_1_B__Const;      // 0x0098 (size: 0x8)
    double TresholdOfActivation___TresholdOfActivation_GreaterEqual_1_1_1_B__Const;   // 0x00A0 (size: 0x8)
    double TresholdOfActivation___TresholdOfActivation_LessEqual_B__Const;            // 0x00A8 (size: 0x8)
    double TresholdOfActivation___TresholdOfActivation_GreaterEqual_B__Const;         // 0x00B0 (size: 0x8)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_3_True__Const; // 0x00B8 (size: 0x1)
    double TresholdOfActivation___TresholdOfActivation_LessEqual_1_1_B__Const;        // 0x00C0 (size: 0x8)
    double TresholdOfActivation___TresholdOfActivation_GreaterEqual_1_1_B__Const;     // 0x00C8 (size: 0x8)
    double TresholdOfActivation___TresholdOfActivation_LessEqual_1_1_3_B__Const;      // 0x00D0 (size: 0x8)
    double TresholdOfActivation___TresholdOfActivation_GreaterEqual_1_1_3_B__Const;   // 0x00D8 (size: 0x8)
    double TresholdOfActivation___TresholdOfActivation_LessEqual_1_B__Const;          // 0x00E0 (size: 0x8)
    bool TresholdOfActivation___TresholdOfActivation_DISPATCH_RigVMDispatch_If_5_True__Const; // 0x00E8 (size: 0x1)
    float CalculateEyesRotationAmount___CalculateEyesRotationAmount_RigVMFunction_MathFloatMake_Value__Const; // 0x00EC (size: 0x4)
    FRigElementKey CalculateEyesRotationAmount___CalculateEyesRotationAmount_GetTransform_3_Item__Const; // 0x00F0 (size: 0xC)
    ERigVMTransformSpace CalculateEyesRotationAmount___CalculateEyesRotationAmount_GetTransform_3_Space__Const; // 0x00FC (size: 0x1)
    bool CalculateEyesRotationAmount___CalculateEyesRotationAmount_GetTransform_3_bInitial__Const; // 0x00FD (size: 0x1)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_Rotate_Vector_Vector__Const; // 0x0100 (size: 0x18)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_Rotate_Vector_2_Vector__Const; // 0x0118 (size: 0x18)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Clamp_Minimum__Const; // 0x0130 (size: 0x8)
    double CalculateEyesRotationAmount___CalculateEyesRotationAmount_Clamp_Maximum__Const; // 0x0138 (size: 0x8)
    FVector CalculateEyesRotationAmount___CalculateEyesRotationAmount_Rotate_Vector_1_Vector__Const; // 0x0140 (size: 0x18)
    FName ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_3_Curve__Const; // 0x0158 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Multiply_1_B__Const; // 0x0160 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_6_1_1_False__Const; // 0x0168 (size: 0x8)
    double ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_LessEqual_B__Const; // 0x0170 (size: 0x8)
    double ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_GreaterEqual_B__Const; // 0x0178 (size: 0x8)
    float ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_DISPATCH_RigVMDispatch_If_11_True__Const; // 0x0180 (size: 0x4)
    float ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_DISPATCH_RigVMDispatch_If_11_False__Const; // 0x0184 (size: 0x4)
    double ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_GreaterEqual_2_B__Const; // 0x0188 (size: 0x8)
    double ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_GreaterEqual_1_B__Const; // 0x0190 (size: 0x8)
    float ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_DISPATCH_RigVMDispatch_If_True__Const; // 0x0198 (size: 0x4)
    float ReduceInfluenceBecauseGimbal_1___ReduceInfluenceBecauseGimbal_DISPATCH_RigVMDispatch_If_False__Const; // 0x019C (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_12_True__Const; // 0x01A0 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_3_True__Const; // 0x01A4 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_3_False__Const; // 0x01A8 (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_2_CriticalDamping__Const; // 0x01AC (size: 0x4)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_2_Force__Const; // 0x01B0 (size: 0x4)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_2_bUseCurrentInput__Const; // 0x01B4 (size: 0x1)
    FRigElementKey ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_2_Item__Const; // 0x01B8 (size: 0xC)
    FTransform ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_2_OffsetTransform__Const; // 0x01D0 (size: 0x60)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x0230 (size: 0x18)
    EEulerRotationOrder ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0x0248 (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_2_Weight__Const; // 0x024C (size: 0x4)
    bool ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_2_bPropagateToChildren__Const; // 0x0250 (size: 0x1)
    ERigVMTransformSpace ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Set_Transform_2_Space__Const; // 0x0251 (size: 0x1)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_1_2_Euler__Const; // 0x0258 (size: 0x18)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_4_Minimum__Const; // 0x0270 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_4_Maximum__Const; // 0x0278 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_5_Minimum__Const; // 0x0280 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_5_Maximum__Const; // 0x0288 (size: 0x8)
    FRigElementKey ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_1_Item__Const; // 0x0290 (size: 0xC)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_2_Minimum__Const; // 0x02A0 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_2_Maximum__Const; // 0x02A8 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_3_Minimum__Const; // 0x02B0 (size: 0x8)
    ERigVMTransformSpace CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_GetTransform_1_1_Space__Const; // 0x02B8 (size: 0x1)
    bool CalculateSurplusYawRotation_1___CalculateSurplusYawRotation_GetTransform_1_1_bInitial__Const; // 0x02B9 (size: 0x1)
    FName ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_Curve__Const; // 0x02BC (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GreaterEqual_B__Const; // 0x02C8 (size: 0x8)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_DISPATCH_RigVMDispatch_If_3_1_True__Const; // 0x02D0 (size: 0x4)
    ERigVMTransformSpace CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_GetTransform_1_1_Space__Const; // 0x02D4 (size: 0x1)
    bool CalculateSurplusPitchRotation___CalculateSurplusPitchRotation_GetTransform_1_1_bInitial__Const; // 0x02D5 (size: 0x1)
    FRigElementKey ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_OffsetTransformForItem_Item__Const; // 0x02D8 (size: 0xC)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_1_Minimum__Const; // 0x02E8 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_1_Maximum__Const; // 0x02F0 (size: 0x8)
    FName ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_2_1_Curve__Const; // 0x02F8 (size: 0x8)
    FRigElementKey ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Set_Transform_Item__Const; // 0x0300 (size: 0xC)
    FVector ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_RigVMFunction_MathQuaternionFromEuler_2_1_Euler__Const; // 0x0310 (size: 0x18)
    FName ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_GetCurveValue_2_2_Curve__Const; // 0x0328 (size: 0x8)
    FRigElementKey ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_CalculateSurplusPitchRotation_1_Bone__Const; // 0x0330 (size: 0xC)
    ERigVMTransformSpace CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_GetTransform_1_1_Space__Const; // 0x033C (size: 0x1)
    bool CalculateSurplusPitchRotation_1___CalculateSurplusPitchRotation_GetTransform_1_1_bInitial__Const; // 0x033D (size: 0x1)
    float ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_SpringInterp_1_1_Strength__Const; // 0x0340 (size: 0x4)
    ERigVMTransformSpace CalculateSurplusYawRotation___CalculateSurplusYawRotation_GetTransform_1_1_Space__Const; // 0x0344 (size: 0x1)
    bool CalculateSurplusYawRotation___CalculateSurplusYawRotation_GetTransform_1_1_bInitial__Const; // 0x0345 (size: 0x1)
    FRigElementKey ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Set_Transform_3_Item__Const; // 0x0348 (size: 0xC)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_4_1_1_Minimum__Const; // 0x0358 (size: 0x8)
    double ApplyingOffsetRotationToBones_1___ApplyingOffsetRotationToBones_Clamp_4_1_1_Maximum__Const; // 0x0360 (size: 0x8)
    FString RigVMModel___DISPATCH_RigVMDispatch_Print_Prefix__Const;                  // 0x0368 (size: 0x10)
    bool RigVMModel___DISPATCH_RigVMDispatch_Print_Enabled__Const;                    // 0x0378 (size: 0x1)
    float RigVMModel___DISPATCH_RigVMDispatch_Print_ScreenDuration__Const;            // 0x037C (size: 0x4)
    FLinearColor RigVMModel___DISPATCH_RigVMDispatch_Print_ScreenColor__Const;        // 0x0380 (size: 0x10)
    FString RigVMModel___DISPATCH_RigVMDispatch_Print_1_Prefix__Const;                // 0x0390 (size: 0x10)
    FLinearColor RigVMModel___DISPATCH_RigVMDispatch_Print_1_ScreenColor__Const;      // 0x03A0 (size: 0x10)
    FString RigVMModel___DISPATCH_RigVMDispatch_Print_2_Prefix__Const;                // 0x03B0 (size: 0x10)
    FRigElementKey RigVMModel___GetTransform_Item__Const;                             // 0x03C0 (size: 0xC)
    ERigVMTransformSpace RigVMModel___GetTransform_Space__Const;                      // 0x03CC (size: 0x1)
    FRigElementKey RigVMModel___GetTransform_1_Item__Const;                           // 0x03D0 (size: 0xC)
    FRigElementKey RigVMModel___GetTransform_2_Item__Const;                           // 0x03DC (size: 0xC)

}; // Size: 0x3E8

struct FPropertyBag_713f4748563e22bb
{
    FString RigVMModel___DISPATCH_RigVMDispatch_Print_2_Prefix__Const;                // 0x0000 (size: 0x10)
    FName RigVMModel___GetCurveValue_Curve__Const;                                    // 0x0010 (size: 0x8)
    double RigVMModel___IsNearlyEqual_B__Const;                                       // 0x0018 (size: 0x8)
    double RigVMModel___IsNearlyEqual_Tolerance__Const;                               // 0x0020 (size: 0x8)
    float RigVMModel___Greater_5_B__Const;                                            // 0x0028 (size: 0x4)
    FName RigVMModel___GetCurveValue_1_Curve__Const;                                  // 0x002C (size: 0x8)
    bool RigVMModel___DISPATCH_RigVMDispatch_Print_2_Enabled__Const;                  // 0x0034 (size: 0x1)
    float RigVMModel___DISPATCH_RigVMDispatch_Print_2_ScreenDuration__Const;          // 0x0038 (size: 0x4)
    FLinearColor RigVMModel___DISPATCH_RigVMDispatch_Print_2_ScreenColor__Const;      // 0x003C (size: 0x10)
    FRigElementKey RigVMModel___GetTransform_2_2_2_Item__Const;                       // 0x004C (size: 0xC)
    ERigVMTransformSpace RigVMModel___GetTransform_2_2_2_Space__Const;                // 0x0058 (size: 0x1)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_5_Item__Const; // 0x005C (size: 0xC)
    ERigVMTransformSpace AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_5_Space__Const; // 0x0068 (size: 0x1)
    bool AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_5_bInitial__Const;       // 0x0069 (size: 0x1)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_4_Item__Const;  // 0x006C (size: 0xC)
    float AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_5_Weight__Const;        // 0x0078 (size: 0x4)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_Item__Const;   // 0x007C (size: 0xC)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_Item__Const; // 0x0088 (size: 0xC)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_Item__Const;  // 0x0094 (size: 0xC)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_1_Item__Const; // 0x00A0 (size: 0xC)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_Item__Const; // 0x00AC (size: 0xC)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_1_1_Item__Const; // 0x00B8 (size: 0xC)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_1_Item__Const; // 0x00C4 (size: 0xC)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_1_2_Item__Const; // 0x00D0 (size: 0xC)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_2_Item__Const; // 0x00DC (size: 0xC)
    bool AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_1_2_bPropagateToChildren__Const; // 0x00E8 (size: 0x1)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_1_1_1_Item__Const; // 0x00EC (size: 0xC)
    FRigElementKey AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_1_2_1_Item__Const; // 0x00F8 (size: 0xC)
    FRigElementKey RigVMModel___LFoot_SearchForFloor_ItemToSearchFor__Const;          // 0x0104 (size: 0xC)
    ERigVMTransformSpace LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_Space__Const; // 0x0110 (size: 0x1)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_bInitial__Const;    // 0x0111 (size: 0x1)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_B__Const;                 // 0x0118 (size: 0x18)
    FLinearColor LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0x0130 (size: 0x10)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_Thickness__Const; // 0x0140 (size: 0x4)
    FTransform LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_WorldOffset__Const; // 0x0150 (size: 0x60)
    ETraceTypeQuery LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_TraceChannel__Const; // 0x01B0 (size: 0x1)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_UseComplex__Const; // 0x01B1 (size: 0x1)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_LessEqual_B__Const;            // 0x01B8 (size: 0x8)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_True__Const; // 0x01C0 (size: 0x4)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Add_1_A__Const;                // 0x01C8 (size: 0x8)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_False__Const; // 0x01D0 (size: 0x18)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_Strength__Const;   // 0x01E8 (size: 0x4)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_CriticalDamping__Const; // 0x01EC (size: 0x4)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_Force__Const;    // 0x01F0 (size: 0x18)
    double Check_If_FootL_Lock___Check_If_FootL_Lock_LessEqual_B__Const;              // 0x0208 (size: 0x8)
    double Check_If_FootL_Lock___Check_If_FootL_Lock_GreaterEqual_B__Const;           // 0x0210 (size: 0x8)
    FRigElementKey RigVMModel___RFoot_SearchForFloor_ItemToSearchFor__Const;          // 0x0218 (size: 0xC)
    ERigVMTransformSpace RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_Space__Const; // 0x0224 (size: 0x1)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_bInitial__Const;    // 0x0225 (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_B__Const;                 // 0x0228 (size: 0x18)
    ETraceTypeQuery RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0240 (size: 0x1)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_UseComplex__Const; // 0x0241 (size: 0x1)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_Radius__Const; // 0x0244 (size: 0x4)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_False__Const; // 0x0248 (size: 0x18)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_Strength__Const;   // 0x0260 (size: 0x4)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_CriticalDamping__Const; // 0x0264 (size: 0x4)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_Force__Const;    // 0x0268 (size: 0x18)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_TargetVelocityAmount__Const; // 0x0280 (size: 0x4)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_LessEqual_B__Const;            // 0x0288 (size: 0x8)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Add_1_A__Const;                // 0x0290 (size: 0x8)
    double Check_If_FootR_Lock___Check_If_FootR_Lock_LessEqual_B__Const;              // 0x0298 (size: 0x8)
    double Check_If_FootR_Lock___Check_If_FootR_Lock_GreaterEqual_B__Const;           // 0x02A0 (size: 0x8)
    float RigVMModel___SpringInterp_Strength__Const;                                  // 0x02A8 (size: 0x4)
    float RigVMModel___SpringInterp_CriticalDamping__Const;                           // 0x02AC (size: 0x4)
    float RigVMModel___SpringInterp_Force__Const;                                     // 0x02B0 (size: 0x4)
    FRigElementKey RigVMModel___Set_Transform_2_Item__Const;                          // 0x02B4 (size: 0xC)
    ERigVMTransformSpace RigVMModel___Set_Transform_2_Space__Const;                   // 0x02C0 (size: 0x1)
    FVector RigVMModel___Rotate_Vector_Vector__Const;                                 // 0x02C8 (size: 0x18)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_OffsetTransform__Const; // 0x02E0 (size: 0x60)
    ERigVMTransformSpace Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_Space__Const; // 0x0340 (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_bInitial__Const;        // 0x0341 (size: 0x1)
    FVector Adjust_LFootHeight___Adjust_LFootHeight_Rotate_Vector_Vector__Const;      // 0x0348 (size: 0x18)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Strength__Const;       // 0x0360 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_CriticalDamping__Const; // 0x0364 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Force__Const;          // 0x0368 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_Weight__Const; // 0x036C (size: 0x4)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_OffsetTransform__Const; // 0x0370 (size: 0x60)
    ERigVMTransformSpace Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_Space__Const; // 0x03D0 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_bInitial__Const;        // 0x03D1 (size: 0x1)
    FVector Adjust_RFootHeight___Adjust_RFootHeight_Rotate_Vector_Vector__Const;      // 0x03D8 (size: 0x18)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Strength__Const;       // 0x03F0 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_CriticalDamping__Const; // 0x03F4 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Force__Const;          // 0x03F8 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_Weight__Const; // 0x03FC (size: 0x4)
    ERigVMTransformSpace Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Set_Transform_Space__Const; // 0x0400 (size: 0x1)
    bool Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Set_Transform_bInitial__Const; // 0x0401 (size: 0x1)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x0408 (size: 0x18)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionFromTwoVectors_A__Const; // 0x0420 (size: 0x18)
    EEulerRotationOrder Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionToEuler_RotationOrder__Const; // 0x0438 (size: 0x1)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_1_1_Minimum__Const;    // 0x0440 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_1_1_Maximum__Const;    // 0x0448 (size: 0x8)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_1_Strength__Const; // 0x0450 (size: 0x4)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_1_CriticalDamping__Const; // 0x0454 (size: 0x4)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_1_TargetVelocityAmount__Const; // 0x0458 (size: 0x4)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Set_Transform_Weight__Const;  // 0x045C (size: 0x4)
    ERigVMTransformSpace Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Set_Transform_Space__Const; // 0x0460 (size: 0x1)
    bool Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Set_Transform_bInitial__Const; // 0x0461 (size: 0x1)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x0468 (size: 0x18)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionFromTwoVectors_A__Const; // 0x0480 (size: 0x18)
    EEulerRotationOrder Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionToEuler_RotationOrder__Const; // 0x0498 (size: 0x1)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_1_Minimum__Const;    // 0x04A0 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_1_Maximum__Const;    // 0x04A8 (size: 0x8)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_1_Strength__Const; // 0x04B0 (size: 0x4)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_1_CriticalDamping__Const; // 0x04B4 (size: 0x4)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_1_TargetVelocityAmount__Const; // 0x04B8 (size: 0x4)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Set_Transform_Weight__Const;  // 0x04BC (size: 0x4)
    FRigElementKey RigVMModel___Set_Transform_3_Item__Const;                          // 0x04C0 (size: 0xC)
    bool RigVMModel___Set_Transform_3_bPropagateToChildren__Const;                    // 0x04CC (size: 0x1)
    FName RigVMModel___PBIK_1_1_Root__Const;                                          // 0x04D0 (size: 0x8)
    TArray<FPBIKEffector> RigVMModel___PBIK_1_1_Effectors__Const;                     // 0x04D8 (size: 0x10)
    FRigElementKey RigVMModel___GetTransform_3_1_2_1_Item__Const;                     // 0x04E8 (size: 0xC)
    TArray<FPBIKBoneSetting> RigVMModel___PBIK_1_1_BoneSettings__Const;               // 0x04F8 (size: 0x10)
    TArray<FName> RigVMModel___PBIK_1_1_ExcludedBones__Const;                         // 0x0508 (size: 0x10)
    FPBIKSolverSettings RigVMModel___PBIK_1_1_Settings__Const;                        // 0x0518 (size: 0x40)
    FPBIKDebug RigVMModel___PBIK_1_1_Debug__Const;                                    // 0x0558 (size: 0x8)
    FRigElementKey CheckFootHit___CheckFootHit_GetTransform_5_Item__Const;            // 0x0560 (size: 0xC)
    ERigVMTransformSpace CheckFootHit___CheckFootHit_GetTransform_5_Space__Const;     // 0x056C (size: 0x1)
    bool CheckFootHit___CheckFootHit_GetTransform_5_bInitial__Const;                  // 0x056D (size: 0x1)
    FVector CheckFootHit___CheckFootHit_Subtract_2_B__Const;                          // 0x0570 (size: 0x18)
    FLinearColor CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0x0588 (size: 0x10)
    float CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_Thickness__Const; // 0x0598 (size: 0x4)
    FTransform CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_WorldOffset__Const; // 0x05A0 (size: 0x60)
    bool CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_bEnabled__Const; // 0x0600 (size: 0x1)
    ETraceTypeQuery CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0601 (size: 0x1)
    FLinearColor CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_2_Color__Const; // 0x0604 (size: 0x10)
    FRigElementKey CheckFootHit___CheckFootHit_GetTransform_5_1_Item__Const;          // 0x0614 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_Item__Const;                     // 0x0620 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_SetTransform_1_Item__Const;                   // 0x062C (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_2_Item__Const;                   // 0x0638 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_1_Item__Const;                   // 0x0644 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_3_Item__Const;                   // 0x0650 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_SetTransform_5_Item__Const;                   // 0x065C (size: 0xC)

}; // Size: 0x668

struct FPropertyBag_8283e4ec40a23a29
{
    bool RigVMModel___RigVMFunction_MathBoolAnd_4_Result;                             // 0x0000 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolOr_2_Result;                              // 0x0001 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolOr_1_1_Result;                            // 0x0002 (size: 0x1)
    bool RigVMModel___IsNearlyEqual_Result;                                           // 0x0003 (size: 0x1)
    float RigVMModel___GetCurveValue_Value;                                           // 0x0004 (size: 0x4)
    bool RigVMModel___GetCurveValue_Valid;                                            // 0x0008 (size: 0x1)
    TArray<FCachedRigElement> RigVMModel___GetCurveValue_CachedCurveIndex;            // 0x0010 (size: 0x10)
    double RigVMModel___IsNearlyEqual_A;                                              // 0x0020 (size: 0x8)
    bool RigVMModel___Greater_5_Result;                                               // 0x0028 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolOr_1_Result;                              // 0x0029 (size: 0x1)
    bool RigVMModel___IsNearlyEqual_5_Result;                                         // 0x002A (size: 0x1)
    float RigVMModel___GetCurveValue_1_Value;                                         // 0x002C (size: 0x4)
    bool RigVMModel___GetCurveValue_1_Valid;                                          // 0x0030 (size: 0x1)
    TArray<FCachedRigElement> RigVMModel___GetCurveValue_1_CachedCurveIndex;          // 0x0038 (size: 0x10)
    double RigVMModel___IsNearlyEqual_5_A;                                            // 0x0048 (size: 0x8)
    bool RigVMModel___Greater_5_1_Result;                                             // 0x0050 (size: 0x1)
    double RigVMModel___DISPATCH_RigVMDispatch_If_5_Result;                           // 0x0058 (size: 0x8)
    bool RigVMModel___DISPATCH_RigVMDispatch_If_5_Condition;                          // 0x0060 (size: 0x1)
    FTransform RigVMModel___To_World_2_World;                                         // 0x0070 (size: 0x60)
    FTransform RigVMModel___GetTransform_2_2_2_Transform;                             // 0x00D0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_2_2_2_CachedIndex;            // 0x0130 (size: 0x10)
    double RigVMModel___DISPATCH_RigVMDispatch_If_5_False;                            // 0x0140 (size: 0x8)
    FTransform AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_4_Transform;        // 0x0150 (size: 0x60)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_4_CachedIndex; // 0x01B0 (size: 0x10)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_5_CachedIndex; // 0x01C0 (size: 0x10)
    FTransform AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_Transform;          // 0x01D0 (size: 0x60)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_CachedIndex; // 0x0230 (size: 0x10)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_CachedIndex; // 0x0240 (size: 0x10)
    FTransform AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_Transform;        // 0x0250 (size: 0x60)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_CachedIndex; // 0x02B0 (size: 0x10)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_CachedIndex; // 0x02C0 (size: 0x10)
    FTransform AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_Transform;      // 0x02D0 (size: 0x60)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_CachedIndex; // 0x0330 (size: 0x10)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_1_CachedIndex; // 0x0340 (size: 0x10)
    FTransform AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_1_Transform;    // 0x0350 (size: 0x60)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_1_CachedIndex; // 0x03B0 (size: 0x10)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_1_1_CachedIndex; // 0x03C0 (size: 0x10)
    FTransform AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_2_Transform;    // 0x03D0 (size: 0x60)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_2_CachedIndex; // 0x0430 (size: 0x10)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_1_2_CachedIndex; // 0x0440 (size: 0x10)
    FTransform AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_1_1_Transform;  // 0x0450 (size: 0x60)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_1_1_CachedIndex; // 0x04B0 (size: 0x10)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_1_1_1_CachedIndex; // 0x04C0 (size: 0x10)
    FTransform AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_2_1_Transform;  // 0x04D0 (size: 0x60)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_GetTransform_1_1_2_1_CachedIndex; // 0x0530 (size: 0x10)
    TArray<FCachedRigElement> AssignCTRLtoBones___AssignCTRLtoBones_Set_Transform_1_1_2_1_CachedIndex; // 0x0540 (size: 0x10)
    bool RigVMModel___LFoot_SearchForFloor_FoundHit;                                  // 0x0550 (size: 0x1)
    double RigVMModel___LFoot_SearchForFloor_FloorOffsetZ;                            // 0x0558 (size: 0x8)
    FVector RigVMModel___LFoot_SearchForFloor_FloorNormal;                            // 0x0560 (size: 0x18)
    FVector RigVMModel___LFoot_SearchForFloor_FloorOffset;                            // 0x0578 (size: 0x18)
    FRigVMInstructionSetExecuteState LFoot_SearchForFloorte_430521162;                // 0x0590 (size: 0x50)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_Result;                   // 0x05E0 (size: 0x18)
    FTransform LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_Transform;    // 0x0600 (size: 0x60)
    TArray<FCachedRigElement> LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_CachedIndex; // 0x0660 (size: 0x10)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_A;                        // 0x0670 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_B__IO;                    // 0x0688 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Subtract_Result;              // 0x06A0 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Subtract_B__IO;               // 0x06B8 (size: 0x18)
    FRigVMInstructionSetExecuteState LFoot_SearchForFloorte_3217066554;               // 0x06D0 (size: 0x50)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_bHit;  // 0x0720 (size: 0x1)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_HitLocation; // 0x0728 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_HitNormal; // 0x0740 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_WorkData; // 0x0758 (size: 0x10)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_MathBoolNot_Result; // 0x0768 (size: 0x1)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_LessEqual_Result;                // 0x0769 (size: 0x1)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_LessEqual_A;                   // 0x0770 (size: 0x8)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Result; // 0x0778 (size: 0x4)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Condition; // 0x077C (size: 0x1)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Add_1_Result;                  // 0x0780 (size: 0x8)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Add_1_B;                       // 0x0788 (size: 0x8)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_False; // 0x0790 (size: 0x4)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_Result; // 0x0798 (size: 0x18)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_Condition; // 0x07B0 (size: 0x1)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_Velocity;        // 0x07B8 (size: 0x18)
    TArray<FVector> LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_SimulatedResult; // 0x07D0 (size: 0x10)
    TArray<FVectorSpringState> LFoot_SearchForFloor___LFoot_SearchForFloor_SpringInterp_SpringState; // 0x07E0 (size: 0x10)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_BreakStruct_Elements; // 0x07F0 (size: 0x18)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolOr_Result;   // 0x0808 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_5_Result; // 0x0809 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_4_Result; // 0x080A (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_3_Result; // 0x080B (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_2_Result; // 0x080C (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_1_Result; // 0x080D (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_Result; // 0x080E (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_LessEqual_Result;                  // 0x080F (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolNot_Result;  // 0x0810 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolNot_2_Result; // 0x0811 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolNot_1_Result; // 0x0812 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolNot_3_Result; // 0x0813 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_3_Result; // 0x0814 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_2_Result; // 0x0815 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_1_Result; // 0x0816 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_Result; // 0x0817 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_GreaterEqual_Result;               // 0x0818 (size: 0x1)
    double Check_If_FootL_Lock___Check_If_FootL_Lock_Add_1_Result;                    // 0x0820 (size: 0x8)
    float Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_GetDeltaTime_Result; // 0x0828 (size: 0x4)
    double Check_If_FootL_Lock___Check_If_FootL_Lock_Add_1_A;                         // 0x0830 (size: 0x8)
    FName Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0838 (size: 0x8)
    FName Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_ControlFlowBranch_3_BlockToRun; // 0x0840 (size: 0x8)
    FVector RigVMModel___RFoot_SearchForFloor_FloorNormal;                            // 0x0848 (size: 0x18)
    double RigVMModel___RFoot_SearchForFloor_FloorOffsetZ;                            // 0x0860 (size: 0x8)
    bool RigVMModel___RFoot_SearchForFloor_FloorHit;                                  // 0x0868 (size: 0x1)
    FVector RigVMModel___RFoot_SearchForFloor_FloorOffset;                            // 0x0870 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_Result; // 0x0888 (size: 0x18)
    FRigVMInstructionSetExecuteState RFoot_SearchForFloorte_807414511;                // 0x08A0 (size: 0x50)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_bHit;  // 0x08F0 (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_Result;                   // 0x08F8 (size: 0x18)
    FTransform RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_Transform;    // 0x0910 (size: 0x60)
    TArray<FCachedRigElement> RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_CachedIndex; // 0x0970 (size: 0x10)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_A;                        // 0x0980 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_B__IO;                    // 0x0998 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Subtract_Result;              // 0x09B0 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Subtract_B__IO;               // 0x09C8 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_HitLocation; // 0x09E0 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_HitNormal; // 0x09F8 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_WorkData; // 0x0A10 (size: 0x10)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_Condition; // 0x0A20 (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_Velocity;        // 0x0A28 (size: 0x18)
    TArray<FVector> RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_SimulatedResult; // 0x0A40 (size: 0x10)
    TArray<FVectorSpringState> RFoot_SearchForFloor___RFoot_SearchForFloor_SpringInterp_SpringState; // 0x0A50 (size: 0x10)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Result; // 0x0A60 (size: 0x4)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_LessEqual_Result;                // 0x0A64 (size: 0x1)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_LessEqual_A;                   // 0x0A68 (size: 0x8)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Condition; // 0x0A70 (size: 0x1)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Add_1_Result;                  // 0x0A78 (size: 0x8)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Add_1_B;                       // 0x0A80 (size: 0x8)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_False; // 0x0A88 (size: 0x4)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_MathBoolNot_Result; // 0x0A8C (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_BreakStruct_Elements; // 0x0A90 (size: 0x18)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolOr_Result;   // 0x0AA8 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_5_Result; // 0x0AA9 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_4_Result; // 0x0AAA (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_3_Result; // 0x0AAB (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_2_Result; // 0x0AAC (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_1_Result; // 0x0AAD (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_Result; // 0x0AAE (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_LessEqual_Result;                  // 0x0AAF (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolNot_Result;  // 0x0AB0 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolNot_2_Result; // 0x0AB1 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolNot_1_Result; // 0x0AB2 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolNot_3_Result; // 0x0AB3 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_3_Result; // 0x0AB4 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_2_Result; // 0x0AB5 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_1_Result; // 0x0AB6 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_Result; // 0x0AB7 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_GreaterEqual_Result;               // 0x0AB8 (size: 0x1)
    double Check_If_FootR_Lock___Check_If_FootR_Lock_Add_1_Result;                    // 0x0AC0 (size: 0x8)
    float Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_GetDeltaTime_Result; // 0x0AC8 (size: 0x4)
    double Check_If_FootR_Lock___Check_If_FootR_Lock_Add_1_A;                         // 0x0AD0 (size: 0x8)
    FName Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0AD8 (size: 0x8)
    FName Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_ControlFlowBranch_3_BlockToRun; // 0x0AE0 (size: 0x8)
    float RigVMModel___SpringInterp_Result;                                           // 0x0AE8 (size: 0x4)
    double RigVMModel___Minimum_Result;                                               // 0x0AF0 (size: 0x8)
    float RigVMModel___SpringInterp_Target;                                           // 0x0AF8 (size: 0x4)
    float RigVMModel___SpringInterp_Current;                                          // 0x0AFC (size: 0x4)
    float RigVMModel___SpringInterp_Velocity;                                         // 0x0B00 (size: 0x4)
    TArray<float> RigVMModel___SpringInterp_SimulatedResult;                          // 0x0B08 (size: 0x10)
    TArray<FFloatSpringState> RigVMModel___SpringInterp_SpringState;                  // 0x0B18 (size: 0x10)
    FVector RigVMModel___Rotate_Vector_Result;                                        // 0x0B28 (size: 0x18)
    FTransform RigVMModel___Inverse_Result;                                           // 0x0B40 (size: 0x60)
    FTransform RigVMModel___GetTransform_2_Transform;                                 // 0x0BA0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_2_CachedIndex;                // 0x0C00 (size: 0x10)
    FVector RigVMModel___Rotate_Vector_Vector__IO;                                    // 0x0C10 (size: 0x18)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_2_CachedIndex;               // 0x0C28 (size: 0x10)
    double RigVMModel___Adjust_LFootHeight_New_Foot_Height;                           // 0x0C38 (size: 0x8)
    FVector Adjust_LFootHeight___Adjust_LFootHeight_Rotate_Vector_Result;             // 0x0C40 (size: 0x18)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_Inverse_Result;                // 0x0C60 (size: 0x60)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_Transform;        // 0x0CC0 (size: 0x60)
    TArray<FCachedRigElement> Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_CachedIndex; // 0x0D20 (size: 0x10)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Result;                // 0x0D30 (size: 0x4)
    double Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_Result;  // 0x0D38 (size: 0x8)
    bool Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_Condition; // 0x0D40 (size: 0x1)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Target;                // 0x0D44 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Current;               // 0x0D48 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Velocity;              // 0x0D4C (size: 0x4)
    TArray<float> Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_SimulatedResult; // 0x0D50 (size: 0x10)
    TArray<FFloatSpringState> Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_SpringState; // 0x0D60 (size: 0x10)
    FVector Adjust_LFootHeight___Adjust_LFootHeight_Rotate_Vector_Vector__IO;         // 0x0D70 (size: 0x18)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_OffsetTransform__IO; // 0x0D90 (size: 0x60)
    TArray<FCachedRigElement> Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_CachedIndex; // 0x0DF0 (size: 0x10)
    double RigVMModel___Adjust_RFootHeight_New_Foot_Height;                           // 0x0E00 (size: 0x8)
    FVector Adjust_RFootHeight___Adjust_RFootHeight_Rotate_Vector_Result;             // 0x0E08 (size: 0x18)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_Inverse_Result;                // 0x0E20 (size: 0x60)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_Transform;        // 0x0E80 (size: 0x60)
    TArray<FCachedRigElement> Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_CachedIndex; // 0x0EE0 (size: 0x10)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Result;                // 0x0EF0 (size: 0x4)
    double Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_Result;  // 0x0EF8 (size: 0x8)
    bool Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_Condition; // 0x0F00 (size: 0x1)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Target;                // 0x0F04 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Current;               // 0x0F08 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Velocity;              // 0x0F0C (size: 0x4)
    TArray<float> Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_SimulatedResult; // 0x0F10 (size: 0x10)
    TArray<FFloatSpringState> Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_SpringState; // 0x0F20 (size: 0x10)
    FVector Adjust_RFootHeight___Adjust_RFootHeight_Rotate_Vector_Vector__IO;         // 0x0F30 (size: 0x18)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_OffsetTransform__IO; // 0x0F50 (size: 0x60)
    TArray<FCachedRigElement> Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_CachedIndex; // 0x0FB0 (size: 0x10)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_1_Result; // 0x0FC0 (size: 0x20)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Multiply_1_Result;            // 0x0FE0 (size: 0x20)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionFromEuler_Result; // 0x1000 (size: 0x20)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_1_1_Result;            // 0x1020 (size: 0x8)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionToEuler_Result; // 0x1028 (size: 0x18)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionFromTwoVectors_Result; // 0x1040 (size: 0x20)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_1_1_Value;             // 0x1060 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_3_Result;              // 0x1068 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_3_Value;               // 0x1070 (size: 0x8)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionFromEuler_Euler__IO; // 0x1078 (size: 0x18)
    FTransform Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_Transform;  // 0x1090 (size: 0x60)
    TArray<FCachedRigElement> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_CachedIndex; // 0x10F0 (size: 0x10)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Multiply_1_B;                 // 0x1100 (size: 0x20)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_1_AngularVelocity; // 0x1120 (size: 0x18)
    TArray<FQuat> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_1_SimulatedResult; // 0x1138 (size: 0x10)
    TArray<FQuaternionSpringState> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_1_SpringState; // 0x1148 (size: 0x10)
    TArray<FCachedRigElement> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Set_Transform_CachedIndex; // 0x1158 (size: 0x10)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_1_Result; // 0x1170 (size: 0x20)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Multiply_1_Result;            // 0x1190 (size: 0x20)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionFromEuler_Result; // 0x11B0 (size: 0x20)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_1_Result;            // 0x11D0 (size: 0x8)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionToEuler_Result; // 0x11D8 (size: 0x18)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionFromTwoVectors_Result; // 0x11F0 (size: 0x20)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_1_Value;             // 0x1210 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_3_Result;              // 0x1218 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_3_Value;               // 0x1220 (size: 0x8)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionFromEuler_Euler__IO; // 0x1228 (size: 0x18)
    FTransform Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_Transform;  // 0x1240 (size: 0x60)
    TArray<FCachedRigElement> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_CachedIndex; // 0x12A0 (size: 0x10)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Multiply_1_B;                 // 0x12B0 (size: 0x20)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_1_AngularVelocity; // 0x12D0 (size: 0x18)
    TArray<FQuat> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_1_SimulatedResult; // 0x12E8 (size: 0x10)
    TArray<FQuaternionSpringState> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_1_SpringState; // 0x12F8 (size: 0x10)
    TArray<FCachedRigElement> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Set_Transform_CachedIndex; // 0x1308 (size: 0x10)
    FTransform RigVMModel___GetTransform_3_Transform;                                 // 0x1320 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_3_CachedIndex;                // 0x1380 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_3_CachedIndex;               // 0x1390 (size: 0x10)
    FTransform RigVMModel___GetTransform_3_1_3_Transform;                             // 0x13A0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_3_1_3_CachedIndex;            // 0x1400 (size: 0x10)
    FTransform RigVMModel___GetTransform_3_1_1_1_Transform;                           // 0x1410 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_3_1_1_1_CachedIndex;          // 0x1470 (size: 0x10)
    FTransform RigVMModel___GetTransform_3_1_2_1_Transform;                           // 0x1480 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_3_1_2_1_CachedIndex;          // 0x14E0 (size: 0x10)
    TArray<FPBIKEffector> RigVMModel___PBIK_1_1_Effectors__IO;                        // 0x14F0 (size: 0x10)
    TArray<TArray<int32>> RigVMModel___PBIK_1_1_EffectorSolverIndices;                // 0x1500 (size: 0x10)
    TArray<FPBIKWorkData> RigVMModel___PBIK_1_1_WorkData;                             // 0x1510 (size: 0x10)
    FTransform CheckFootHit___CheckFootHit_GetTransform_5_Transform;                  // 0x1520 (size: 0x60)
    TArray<FCachedRigElement> CheckFootHit___CheckFootHit_GetTransform_5_CachedIndex; // 0x1580 (size: 0x10)
    FVector CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_A;           // 0x1590 (size: 0x18)
    FVector CheckFootHit___CheckFootHit_Subtract_2_Result;                            // 0x15A8 (size: 0x18)
    FVector CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_HitLocation;        // 0x15C0 (size: 0x18)
    bool CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_bHit;                  // 0x15D8 (size: 0x1)
    FVector CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_HitNormal;          // 0x15E0 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_WorkData; // 0x15F8 (size: 0x10)
    FTransform CheckFootHit___CheckFootHit_GetTransform_5_1_Transform;                // 0x1610 (size: 0x60)
    TArray<FCachedRigElement> CheckFootHit___CheckFootHit_GetTransform_5_1_CachedIndex; // 0x1670 (size: 0x10)
    FVector CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_1_A;         // 0x1680 (size: 0x18)
    FVector CheckFootHit___CheckFootHit_Subtract_2_1_Result;                          // 0x1698 (size: 0x18)
    FVector CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_1_HitLocation;      // 0x16B0 (size: 0x18)
    bool CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_1_bHit;                // 0x16C8 (size: 0x1)
    FVector CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_1_HitNormal;        // 0x16D0 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_1_WorkData; // 0x16E8 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_Transform;                           // 0x1700 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_CachedIndex;          // 0x1760 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_CachedIndex;          // 0x1770 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_1_CachedIndex;        // 0x1780 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_2_Transform;                         // 0x1790 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_2_CachedIndex;        // 0x17F0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_2_CachedIndex;        // 0x1800 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_1_Transform;                         // 0x1810 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_1_CachedIndex;        // 0x1870 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_3_CachedIndex;        // 0x1880 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_3_Transform;                         // 0x1890 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_3_CachedIndex;        // 0x18F0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_4_CachedIndex;        // 0x1900 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_4_Transform;                         // 0x1910 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_4_CachedIndex;        // 0x1970 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_5_CachedIndex;        // 0x1980 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_6_CachedIndex;        // 0x1990 (size: 0x10)
    FTransform RigVMModel___To_World_2_1_World;                                       // 0x19A0 (size: 0x60)
    FTransform RigVMModel___GetTransform_2_2_2_1_Transform;                           // 0x1A00 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_2_2_2_1_CachedIndex;          // 0x1A60 (size: 0x10)

}; // Size: 0x1A70

struct FPropertyBag_a5738de174942205
{
    double RigVMModel___Greater_B__Const;                                             // 0x0000 (size: 0x8)
    FRigElementKey RigVMModel___GetTransform_2_2_2_Item__Const;                       // 0x0008 (size: 0xC)
    ERigVMTransformSpace RigVMModel___GetTransform_2_2_2_Space__Const;                // 0x0014 (size: 0x1)
    bool RigVMModel___GetTransform_2_2_2_bInitial__Const;                             // 0x0015 (size: 0x1)
    FName AlignootLayingOnGround___AlignootLayingOnGround_GetCurveValue_1_Curve__Const; // 0x0018 (size: 0x8)
    FRigElementKey FindFloorNormal_1___FindFloorNormal_GetTransform_1_1_Item__Const;  // 0x0020 (size: 0xC)
    ERigVMTransformSpace FindFloorNormal_1___FindFloorNormal_GetTransform_1_1_Space__Const; // 0x002C (size: 0x1)
    bool FindFloorNormal_1___FindFloorNormal_GetTransform_1_1_bInitial__Const;        // 0x002D (size: 0x1)
    FRigElementKey FindFloorNormal_1___FindFloorNormal_GetTransform_1_1_1_Item__Const; // 0x0030 (size: 0xC)
    float FindFloorNormal_1___FindFloorNormal_RigVMFunction_MathVectorMake_1_X__Const; // 0x003C (size: 0x4)
    float FindFloorNormal_1___FindFloorNormal_RigVMFunction_MathVectorMake_1_Y__Const; // 0x0040 (size: 0x4)
    FLinearColor FindFloorNormal_1___FindFloorNormal_RigVMFunction_DebugLineNoSpace_4_Color__Const; // 0x0044 (size: 0x10)
    FTransform FindFloorNormal_1___FindFloorNormal_RigVMFunction_DebugLineNoSpace_4_WorldOffset__Const; // 0x0060 (size: 0x60)
    bool FindFloorNormal_1___FindFloorNormal_RigVMFunction_DebugLineNoSpace_4_bEnabled__Const; // 0x00C0 (size: 0x1)
    FVector FindFloorNormal_1___FindFloorNormal_Add_B__Const;                         // 0x00C8 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Subtract_B__Const;                    // 0x00E0 (size: 0x18)
    FLinearColor FindFloorNormal_1___FindFloorNormal_RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0x00F8 (size: 0x10)
    FVector FindFloorNormal_1___FindFloorNormal_Subtract_1_B__Const;                  // 0x0108 (size: 0x18)
    FLinearColor FindFloorNormal_1___FindFloorNormal_RigVMFunction_DebugLineNoSpace_1_1_Color__Const; // 0x0120 (size: 0x10)
    ETraceTypeQuery FindFloorNormal_1___FindFloorNormal_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0130 (size: 0x1)
    float FindFloorNormal_1___FindFloorNormal_SphereTraceByTraceChannel_Radius__Const; // 0x0134 (size: 0x4)
    FLinearColor FindFloorNormal_1___FindFloorNormal_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0138 (size: 0x10)
    float FindFloorNormal_1___FindFloorNormal_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0148 (size: 0x4)
    FVector FindFloorNormal_1___FindFloorNormal_RigVMFunction_MathVectorCross_A__Const; // 0x0150 (size: 0x18)
    ERigUnitVisualDebugPointMode FindFloorNormal_1___FindFloorNormal_RigVMFunction_VisualDebugVectorNoSpace_1_Mode__Const; // 0x0168 (size: 0x1)
    FLinearColor FindFloorNormal_1___FindFloorNormal_RigVMFunction_VisualDebugVectorNoSpace_1_Color__Const; // 0x016C (size: 0x10)
    float FindFloorNormal_1___FindFloorNormal_RigVMFunction_VisualDebugVectorNoSpace_1_Scale__Const; // 0x017C (size: 0x4)
    FLinearColor FindFloorNormal_1___FindFloorNormal_RigVMFunction_DebugLineNoSpace_1_1_1_Color__Const; // 0x0180 (size: 0x10)
    FLinearColor FindFloorNormal_1___FindFloorNormal_RigVMFunction_DebugLineNoSpace_3_Color__Const; // 0x0190 (size: 0x10)
    FString FindFloorNormal_1___FindFloorNormal_DISPATCH_RigVMDispatch_Print_Prefix__Const; // 0x01A0 (size: 0x10)
    FRigElementKey FindFloorNormal_1___FindFloorNormal_GetTransform_3_Item__Const;    // 0x01B0 (size: 0xC)
    float FindFloorNormal_1___FindFloorNormal_DISPATCH_RigVMDispatch_Print_ScreenDuration__Const; // 0x01BC (size: 0x4)
    FLinearColor FindFloorNormal_1___FindFloorNormal_DISPATCH_RigVMDispatch_Print_ScreenColor__Const; // 0x01C0 (size: 0x10)
    FString FindFloorNormal_1___FindFloorNormal_DISPATCH_RigVMDispatch_Print_1_Prefix__Const; // 0x01D0 (size: 0x10)
    FVector FindFloorNormal_1___FindFloorNormal_RigVMFunction_MathQuaternionFromAxisAndAngle_Axis__Const; // 0x01E0 (size: 0x18)
    float FindFloorNormal_1___FindFloorNormal_VisualDebug_Thickness__Const;           // 0x01F8 (size: 0x4)
    FQuat FindFloorNormal_1___FindFloorNormal_DISPATCH_RigVMDispatch_If_False__Const; // 0x0200 (size: 0x20)
    FRigElementKey AlignootLayingOnGround___AlignootLayingOnGround_OffsetTransformForItem_Item__Const; // 0x0220 (size: 0xC)
    FTransform AlignootLayingOnGround___AlignootLayingOnGround_OffsetTransformForItem_OffsetTransform__Const; // 0x0230 (size: 0x60)
    double AlignootLayingOnGround___AlignootLayingOnGround_Multiply_B__Const;         // 0x0290 (size: 0x8)
    bool AlignootLayingOnGround___AlignootLayingOnGround_OffsetTransformForItem_bPropagateToChildren__Const; // 0x0298 (size: 0x1)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_5_Item__Const; // 0x029C (size: 0xC)
    ERigVMTransformSpace AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_5_Space__Const; // 0x02A8 (size: 0x1)
    bool AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_5_bInitial__Const;     // 0x02A9 (size: 0x1)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_4_Item__Const; // 0x02AC (size: 0xC)
    float AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_5_Weight__Const;      // 0x02B8 (size: 0x4)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_Item__Const; // 0x02BC (size: 0xC)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_1_Item__Const; // 0x02C8 (size: 0xC)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_Item__Const; // 0x02D4 (size: 0xC)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_1_1_Item__Const; // 0x02E0 (size: 0xC)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_1_Item__Const; // 0x02EC (size: 0xC)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_1_1_1_Item__Const; // 0x02F8 (size: 0xC)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_1_1_Item__Const; // 0x0304 (size: 0xC)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_1_1_2_Item__Const; // 0x0310 (size: 0xC)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_1_2_Item__Const; // 0x031C (size: 0xC)
    bool AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_1_1_2_bPropagateToChildren__Const; // 0x0328 (size: 0x1)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_ParentConstraint_Child__Const; // 0x032C (size: 0xC)
    FTransformFilter AssingCTRLtoBones_2___AssingCTRLtoBones_ParentConstraint_Filter__Const; // 0x0338 (size: 0x9)
    TArray<FConstraintParent> AssingCTRLtoBones_2___AssingCTRLtoBones_ParentConstraint_Parents__Const; // 0x0348 (size: 0x10)
    FRigUnit_ParentConstraint_AdvancedSettings AssingCTRLtoBones_2___AssingCTRLtoBones_ParentConstraint_AdvancedSettings__Const; // 0x0358 (size: 0x2)
    FRigElementKey AssingCTRLtoBones_2___AssingCTRLtoBones_ParentConstraint_1_Child__Const; // 0x035C (size: 0xC)
    TArray<FConstraintParent> AssingCTRLtoBones_2___AssingCTRLtoBones_ParentConstraint_1_Parents__Const; // 0x0368 (size: 0x10)
    FRigElementKey FindLegsLength___FindLegsLength_GetTransform_6_1_1_2_Item__Const;  // 0x0378 (size: 0xC)
    ERigVMTransformSpace FindLegsLength___FindLegsLength_GetTransform_6_1_1_2_Space__Const; // 0x0384 (size: 0x1)
    bool FindLegsLength___FindLegsLength_GetTransform_6_1_1_2_bInitial__Const;        // 0x0385 (size: 0x1)
    FRigElementKey FindLegsLength___FindLegsLength_GetTransform_6_1_1_Item__Const;    // 0x0388 (size: 0xC)
    FRigElementKey FindLegsLength___FindLegsLength_GetTransform_6_2_1_Item__Const;    // 0x0394 (size: 0xC)
    FRigElementKey FindLegsLength___FindLegsLength_GetTransform_6_2_1_2_Item__Const;  // 0x03A0 (size: 0xC)
    float FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_1_True__Const;    // 0x03AC (size: 0x4)
    double FindLegsLength___FindLegsLength_GreaterEqual_1_B__Const;                   // 0x03B0 (size: 0x8)
    float FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_2_1_True__Const;  // 0x03B8 (size: 0x4)
    float FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_3_1_True__Const;  // 0x03BC (size: 0x4)
    float FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_3_1_False__Const; // 0x03C0 (size: 0x4)
    float FindLegsLength___FindLegsLength_SpringInterp_Strength__Const;               // 0x03C4 (size: 0x4)
    float FindLegsLength___FindLegsLength_SpringInterp_Force__Const;                  // 0x03C8 (size: 0x4)
    bool FindLegsLength___FindLegsLength_SpringInterp_bUseCurrentInput__Const;        // 0x03CC (size: 0x1)
    FRigElementKey FindLegsLength___FindLegsLength_GetTransform_6_1_1_2_1_Item__Const; // 0x03D0 (size: 0xC)
    FRigElementKey FindLegsLength___FindLegsLength_GetTransform_6_1_1_1_Item__Const;  // 0x03DC (size: 0xC)
    FRigElementKey FindLegsLength___FindLegsLength_GetTransform_6_2_1_1_Item__Const;  // 0x03E8 (size: 0xC)
    FRigElementKey FindLegsLength___FindLegsLength_GetTransform_6_2_1_2_1_Item__Const; // 0x03F4 (size: 0xC)
    FRigElementKey FindSlopeAngle___FindSlopeAngle_GetTransform_Item__Const;          // 0x0400 (size: 0xC)
    ERigVMTransformSpace FindSlopeAngle___FindSlopeAngle_GetTransform_Space__Const;   // 0x040C (size: 0x1)
    bool FindSlopeAngle___FindSlopeAngle_GetTransform_bInitial__Const;                // 0x040D (size: 0x1)
    FVector FindSlopeAngle___FindSlopeAngle_Add_3_B__Const;                           // 0x0410 (size: 0x18)
    FVector FindSlopeAngle___FindSlopeAngle_Subtract_1_B__Const;                      // 0x0428 (size: 0x18)
    ETraceTypeQuery FindSlopeAngle___FindSlopeAngle_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0440 (size: 0x1)
    bool FindSlopeAngle___FindSlopeAngle_SphereTraceByTraceChannel_UseComplex__Const; // 0x0441 (size: 0x1)
    float FindSlopeAngle___FindSlopeAngle_SphereTraceByTraceChannel_Radius__Const;    // 0x0444 (size: 0x4)
    float FindSlopeAngle___FindSlopeAngle_RigVMFunction_MathVectorMake_X__Const;      // 0x0448 (size: 0x4)
    float FindSlopeAngle___FindSlopeAngle_RigVMFunction_MathVectorMake_Y__Const;      // 0x044C (size: 0x4)
    float FindSlopeAngle___FindSlopeAngle_RigVMFunction_MathFloatMake_1_Value__Const; // 0x0450 (size: 0x4)
    FLinearColor FindSlopeAngle___FindSlopeAngle_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0454 (size: 0x10)
    float FindSlopeAngle___FindSlopeAngle_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0464 (size: 0x4)
    FTransform FindSlopeAngle___FindSlopeAngle_RigVMFunction_DebugLineNoSpace_WorldOffset__Const; // 0x0470 (size: 0x60)
    FRigElementKey RigVMModel___LFoot_SearchForFloor_ItemToSearchFor__Const;          // 0x04D0 (size: 0xC)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_GreaterEqual_B__Const;         // 0x04E0 (size: 0x8)
    ERigVMTransformSpace LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_Space__Const; // 0x04E8 (size: 0x1)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_bInitial__Const;    // 0x04E9 (size: 0x1)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_B__Const;                 // 0x04F0 (size: 0x18)
    FName LFoot_SearchForFloor___LFoot_SearchForFloor_GetCurveValue_1_Curve__Const;   // 0x0508 (size: 0x8)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Greater_B__Const;              // 0x0510 (size: 0x8)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Add_4_B__Const;                // 0x0518 (size: 0x8)
    FName LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_CoreNotEquals_B__Const; // 0x0520 (size: 0x8)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Divide_B__Const;               // 0x0528 (size: 0x8)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_MathQuaternionFromEuler_1_Euler__Const; // 0x0530 (size: 0x18)
    EEulerRotationOrder LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_MathQuaternionFromEuler_1_RotationOrder__Const; // 0x0548 (size: 0x1)
    FLinearColor LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0x054C (size: 0x10)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_Thickness__Const; // 0x055C (size: 0x4)
    FTransform LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_WorldOffset__Const; // 0x0560 (size: 0x60)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_bEnabled__Const; // 0x05C0 (size: 0x1)
    ETraceTypeQuery LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_TraceChannel__Const; // 0x05C1 (size: 0x1)
    FLinearColor LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_1_Color__Const; // 0x05C4 (size: 0x10)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Greater_1_B__Const;            // 0x05D8 (size: 0x8)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_False__Const; // 0x05E0 (size: 0x18)
    double Check_If_FootL_Lock___Check_If_FootL_Lock_LessEqual_B__Const;              // 0x05F8 (size: 0x8)
    double Check_If_FootL_Lock___Check_If_FootL_Lock_GreaterEqual_B__Const;           // 0x0600 (size: 0x8)
    FRigElementKey RigVMModel___RFoot_SearchForFloor_ItemToSearchFor__Const;          // 0x0608 (size: 0xC)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_GreaterEqual_B__Const;         // 0x0618 (size: 0x8)
    ERigVMTransformSpace RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_Space__Const; // 0x0620 (size: 0x1)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_bInitial__Const;    // 0x0621 (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_B__Const;                 // 0x0628 (size: 0x18)
    FName RFoot_SearchForFloor___RFoot_SearchForFloor_GetCurveValue_1_Curve__Const;   // 0x0640 (size: 0x8)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Greater_B__Const;              // 0x0648 (size: 0x8)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Add_4_B__Const;                // 0x0650 (size: 0x8)
    FName RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_CoreNotEquals_B__Const; // 0x0658 (size: 0x8)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Divide_B__Const;               // 0x0660 (size: 0x8)
    EEulerRotationOrder RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_MathQuaternionFromEuler_1_RotationOrder__Const; // 0x0668 (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Subtract_B__Const;            // 0x0670 (size: 0x18)
    FLinearColor RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0x0688 (size: 0x10)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_Thickness__Const; // 0x0698 (size: 0x4)
    FTransform RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_WorldOffset__Const; // 0x06A0 (size: 0x60)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_bEnabled__Const; // 0x0700 (size: 0x1)
    ETraceTypeQuery RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0701 (size: 0x1)
    FLinearColor RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_DebugLineNoSpace_1_1_Color__Const; // 0x0704 (size: 0x10)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_False__Const; // 0x0718 (size: 0x18)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Greater_1_B__Const;            // 0x0730 (size: 0x8)
    double Check_If_FootR_Lock___Check_If_FootR_Lock_LessEqual_B__Const;              // 0x0738 (size: 0x8)
    double Check_If_FootR_Lock___Check_If_FootR_Lock_GreaterEqual_B__Const;           // 0x0740 (size: 0x8)
    double RigVMModel___GreaterEqual_B__Const;                                        // 0x0748 (size: 0x8)
    double RigVMModel___LessEqual_1_B__Const;                                         // 0x0750 (size: 0x8)
    float RigVMModel___DISPATCH_RigVMDispatch_If_2_True__Const;                       // 0x0758 (size: 0x4)
    float RigVMModel___DISPATCH_RigVMDispatch_If_2_False__Const;                      // 0x075C (size: 0x4)
    FName RigVMModel___GetCurveValue_Curve__Const;                                    // 0x0760 (size: 0x8)
    double RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_LessEqual_B__Const; // 0x0768 (size: 0x8)
    double RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_Remap_1_SourceMinimum__Const; // 0x0770 (size: 0x8)
    double RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_Remap_1_TargetMinimum__Const; // 0x0778 (size: 0x8)
    double RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_Remap_1_TargetMaximum__Const; // 0x0780 (size: 0x8)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_Remap_1_bClamp__Const; // 0x0788 (size: 0x1)
    double RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_GreaterEqual_3_B__Const; // 0x0790 (size: 0x8)
    double RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_Remap_SourceMaximum__Const; // 0x0798 (size: 0x8)
    double RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_GreaterEqual_1_B__Const; // 0x07A0 (size: 0x8)
    float RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_DISPATCH_RigVMDispatch_If_3_1_True__Const; // 0x07A8 (size: 0x4)
    float RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_DISPATCH_RigVMDispatch_If_3_1_False__Const; // 0x07AC (size: 0x4)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_Remap_bClamp__Const; // 0x07B0 (size: 0x1)
    FRigElementKey RigVMModel___Set_Transform_2_Item__Const;                          // 0x07B4 (size: 0xC)
    ERigVMTransformSpace RigVMModel___Set_Transform_2_Space__Const;                   // 0x07C0 (size: 0x1)
    FVector RigVMModel___Rotate_Vector_Vector__Const;                                 // 0x07C8 (size: 0x18)
    double RigVMModel___Greater_1_B__Const;                                           // 0x07E0 (size: 0x8)
    float RigVMModel___DISPATCH_RigVMDispatch_If_7_True__Const;                       // 0x07E8 (size: 0x4)
    float RigVMModel___DISPATCH_RigVMDispatch_If_8_True__Const;                       // 0x07EC (size: 0x4)
    float RigVMModel___DISPATCH_RigVMDispatch_If_8_False__Const;                      // 0x07F0 (size: 0x4)
    float RigVMModel___SpringInterp_CriticalDamping__Const;                           // 0x07F4 (size: 0x4)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_OffsetTransform__Const; // 0x0800 (size: 0x60)
    ERigVMTransformSpace Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_Space__Const; // 0x0860 (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_bInitial__Const;        // 0x0861 (size: 0x1)
    FVector Adjust_LFootHeight___Adjust_LFootHeight_Rotate_Vector_Vector__Const;      // 0x0868 (size: 0x18)
    double Adjust_LFootHeight___Adjust_LFootHeight_LessEqual_B__Const;                // 0x0880 (size: 0x8)
    double Adjust_LFootHeight___Adjust_LFootHeight_Remap_SourceMinimum__Const;        // 0x0888 (size: 0x8)
    double Adjust_LFootHeight___Adjust_LFootHeight_Remap_TargetMinimum__Const;        // 0x0890 (size: 0x8)
    double Adjust_LFootHeight___Adjust_LFootHeight_Remap_TargetMaximum__Const;        // 0x0898 (size: 0x8)
    double Adjust_LFootHeight___Adjust_LFootHeight_GreaterEqual_B__Const;             // 0x08A0 (size: 0x8)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Strength__Const;       // 0x08A8 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_CriticalDamping__Const; // 0x08AC (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Force__Const;          // 0x08B0 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_Weight__Const; // 0x08B4 (size: 0x4)
    bool Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_bPropagateToChildren__Const; // 0x08B8 (size: 0x1)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_OffsetTransform__Const; // 0x08C0 (size: 0x60)
    ERigVMTransformSpace Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_Space__Const; // 0x0920 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_bInitial__Const;        // 0x0921 (size: 0x1)
    FVector Adjust_RFootHeight___Adjust_RFootHeight_Rotate_Vector_Vector__Const;      // 0x0928 (size: 0x18)
    double Adjust_RFootHeight___Adjust_RFootHeight_LessEqual_B__Const;                // 0x0940 (size: 0x8)
    double Adjust_RFootHeight___Adjust_RFootHeight_Remap_SourceMinimum__Const;        // 0x0948 (size: 0x8)
    double Adjust_RFootHeight___Adjust_RFootHeight_Remap_TargetMinimum__Const;        // 0x0950 (size: 0x8)
    double Adjust_RFootHeight___Adjust_RFootHeight_Remap_TargetMaximum__Const;        // 0x0958 (size: 0x8)
    double Adjust_RFootHeight___Adjust_RFootHeight_GreaterEqual_B__Const;             // 0x0960 (size: 0x8)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Strength__Const;       // 0x0968 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_CriticalDamping__Const; // 0x096C (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Force__Const;          // 0x0970 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_Weight__Const; // 0x0974 (size: 0x4)
    bool Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_bPropagateToChildren__Const; // 0x0978 (size: 0x1)
    ERigVMTransformSpace Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_Space__Const; // 0x0979 (size: 0x1)
    bool Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_bInitial__Const;  // 0x097A (size: 0x1)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Rotate_Vector_Vector__Const; // 0x0980 (size: 0x18)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionFromTwoVectors_A__Const; // 0x0998 (size: 0x18)
    EEulerRotationOrder Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionToEuler_RotationOrder__Const; // 0x09B0 (size: 0x1)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_1_Minimum__Const;      // 0x09B8 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_1_Maximum__Const;      // 0x09C0 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_Minimum__Const;        // 0x09C8 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_Maximum__Const;        // 0x09D0 (size: 0x8)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_DISPATCH_RigVMDispatch_If_2_False__Const; // 0x09E0 (size: 0x20)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_Strength__Const; // 0x0A00 (size: 0x4)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_CriticalDamping__Const; // 0x0A04 (size: 0x4)
    float Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_TargetVelocityAmount__Const; // 0x0A08 (size: 0x4)
    ERigVMTransformSpace Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_Space__Const; // 0x0A0C (size: 0x1)
    bool Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_bInitial__Const;  // 0x0A0D (size: 0x1)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Rotate_Vector_Vector__Const; // 0x0A10 (size: 0x18)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionFromTwoVectors_A__Const; // 0x0A28 (size: 0x18)
    EEulerRotationOrder Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionToEuler_RotationOrder__Const; // 0x0A40 (size: 0x1)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_Minimum__Const;      // 0x0A48 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_Maximum__Const;      // 0x0A50 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_Minimum__Const;        // 0x0A58 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_Maximum__Const;        // 0x0A60 (size: 0x8)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_DISPATCH_RigVMDispatch_If_False__Const; // 0x0A70 (size: 0x20)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_Strength__Const; // 0x0A90 (size: 0x4)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_CriticalDamping__Const; // 0x0A94 (size: 0x4)
    float Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_TargetVelocityAmount__Const; // 0x0A98 (size: 0x4)
    FRigElementKey RigVMModel___Set_Transform_3_Item__Const;                          // 0x0A9C (size: 0xC)
    bool RigVMModel___Set_Transform_3_bPropagateToChildren__Const;                    // 0x0AA8 (size: 0x1)
    FTransform RigVMModel___OffsetTransformForItem_2_OffsetTransform__Const;          // 0x0AB0 (size: 0x60)
    FRigElementKey RigVMModel___TwoBoneIKSimplePerItem_ItemA__Const;                  // 0x0B10 (size: 0xC)
    FRigElementKey RigVMModel___TwoBoneIKSimplePerItem_ItemB__Const;                  // 0x0B1C (size: 0xC)
    FRigElementKey RigVMModel___TwoBoneIKSimplePerItem_EffectorItem__Const;           // 0x0B28 (size: 0xC)
    EAxis::Type RigVMModel___ClampSpatially_1_Axis__Const;                            // 0x0B34 (size: 0x1)
    ERigVMClampSpatialMode::Type RigVMModel___ClampSpatially_1_Type__Const;           // 0x0B35 (size: 0x1)
    FLinearColor RigVMModel___ClampSpatially_1_DebugColor__Const;                     // 0x0B38 (size: 0x10)
    FVector RigVMModel___TwoBoneIKSimplePerItem_PrimaryAxis__Const;                   // 0x0B48 (size: 0x18)
    FVector RigVMModel___TwoBoneIKSimplePerItem_SecondaryAxis__Const;                 // 0x0B60 (size: 0x18)
    FRigElementKey RigVMModel___RigUnit_GetTransform_7_Item__Const;                   // 0x0B78 (size: 0xC)
    EControlRigVectorKind RigVMModel___TwoBoneIKSimplePerItem_PoleVectorKind__Const;  // 0x0B84 (size: 0x1)
    FRigElementKey RigVMModel___TwoBoneIKSimplePerItem_PoleVectorSpace__Const;        // 0x0B88 (size: 0xC)
    float RigVMModel___TwoBoneIKSimplePerItem_StretchMaximumRatio__Const;             // 0x0B94 (size: 0x4)
    FRigUnit_TwoBoneIKSimple_DebugSettings RigVMModel___TwoBoneIKSimplePerItem_DebugSettings__Const; // 0x0BA0 (size: 0x70)
    FRigElementKey RigVMModel___TwoBoneIKSimplePerItem_1_ItemA__Const;                // 0x0C10 (size: 0xC)
    FRigElementKey RigVMModel___TwoBoneIKSimplePerItem_1_ItemB__Const;                // 0x0C1C (size: 0xC)
    FRigElementKey RigVMModel___TwoBoneIKSimplePerItem_1_EffectorItem__Const;         // 0x0C28 (size: 0xC)
    FVector RigVMModel___TwoBoneIKSimplePerItem_1_PrimaryAxis__Const;                 // 0x0C38 (size: 0x18)
    FVector RigVMModel___TwoBoneIKSimplePerItem_1_SecondaryAxis__Const;               // 0x0C50 (size: 0x18)
    FRigElementKey RigVMModel___RigUnit_GetTransform_6_Item__Const;                   // 0x0C68 (size: 0xC)
    FRigElementKey FindWhichFootIsOnFront___FindWhichFootIsOnFront_GetTransform_1_Item__Const; // 0x0C74 (size: 0xC)
    ERigVMTransformSpace FindWhichFootIsOnFront___FindWhichFootIsOnFront_GetTransform_1_Space__Const; // 0x0C80 (size: 0x1)
    bool FindWhichFootIsOnFront___FindWhichFootIsOnFront_GetTransform_1_bInitial__Const; // 0x0C81 (size: 0x1)
    FRigElementKey FindWhichFootIsOnFront___FindWhichFootIsOnFront_GetTransform_Item__Const; // 0x0C84 (size: 0xC)
    double FindWhichFootIsOnFront___FindWhichFootIsOnFront_Less_B__Const;             // 0x0C90 (size: 0x8)
    bool FindWhichFootIsOnFront___FindWhichFootIsOnFront_DISPATCH_RigVMDispatch_If_6_False__Const; // 0x0C98 (size: 0x1)
    FRigElementKey CheckFootHit___CheckFootHit_GetTransform_5_Item__Const;            // 0x0C9C (size: 0xC)
    ERigVMTransformSpace CheckFootHit___CheckFootHit_GetTransform_5_Space__Const;     // 0x0CA8 (size: 0x1)
    bool CheckFootHit___CheckFootHit_GetTransform_5_bInitial__Const;                  // 0x0CA9 (size: 0x1)
    FVector CheckFootHit___CheckFootHit_Subtract_2_B__Const;                          // 0x0CB0 (size: 0x18)
    FLinearColor CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0x0CC8 (size: 0x10)
    float CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_Thickness__Const; // 0x0CD8 (size: 0x4)
    FTransform CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_WorldOffset__Const; // 0x0CE0 (size: 0x60)
    ETraceTypeQuery CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_TraceChannel__Const; // 0x0D40 (size: 0x1)
    bool CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_UseComplex__Const;     // 0x0D41 (size: 0x1)
    float CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_Radius__Const;        // 0x0D44 (size: 0x4)
    FLinearColor CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_2_Color__Const; // 0x0D48 (size: 0x10)
    FRigElementKey CheckFootHit___CheckFootHit_GetTransform_5_1_Item__Const;          // 0x0D58 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_SetTransform_Item__Const;                     // 0x0D64 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_SetTransform_1_Item__Const;                   // 0x0D70 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_2_Item__Const;                   // 0x0D7C (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_1_Item__Const;                   // 0x0D88 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_SetTransform_4_Item__Const;                   // 0x0D94 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_3_Item__Const;                   // 0x0DA0 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_SetTransform_5_Item__Const;                   // 0x0DAC (size: 0xC)
    FRigElementKey RigVMModel___GetTransform_2_2_2_1_Item__Const;                     // 0x0DB8 (size: 0xC)
    FName RigVMModel___RigVMFunction_UserDefinedEvent_EventName__Const;               // 0x0DC4 (size: 0x8)

}; // Size: 0xDCC

struct FPropertyBag_b605bbd54a68e32f
{
    double RigVMModel___DISPATCH_RigVMDispatch_If_5_Result;                           // 0x0000 (size: 0x8)
    bool RigVMModel___RigVMFunction_MathBoolAnd_4_Result;                             // 0x0008 (size: 0x1)
    bool RigVMModel___Greater_Result;                                                 // 0x0009 (size: 0x1)
    bool RigVMModel___DISPATCH_RigVMDispatch_If_5_Condition;                          // 0x000A (size: 0x1)
    FTransform RigVMModel___To_World_2_World;                                         // 0x0010 (size: 0x60)
    FTransform RigVMModel___GetTransform_2_2_2_Transform;                             // 0x0070 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_2_2_2_CachedIndex;            // 0x00D0 (size: 0x10)
    double RigVMModel___DISPATCH_RigVMDispatch_If_5_False;                            // 0x00E0 (size: 0x8)
    bool AlignootLayingOnGround___AlignootLayingOnGround_GetCurveValue_1_Valid;       // 0x00E8 (size: 0x1)
    float AlignootLayingOnGround___AlignootLayingOnGround_GetCurveValue_1_Value;      // 0x00EC (size: 0x4)
    TArray<FCachedRigElement> AlignootLayingOnGround___AlignootLayingOnGround_GetCurveValue_1_CachedCurveIndex; // 0x00F0 (size: 0x10)
    double AlignootLayingOnGround___AlignootLayingOnGround_FindFloorNormal_1_Argument; // 0x0100 (size: 0x8)
    FRigVMInstructionSetExecuteState AlignootLayingOnGround_1te_3654462844;           // 0x0108 (size: 0x50)
    FVector FindFloorNormal_1___FindFloorNormal_Multiply_Result;                      // 0x0158 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Subtract_3_Result;                    // 0x0170 (size: 0x18)
    FTransform FindFloorNormal_1___FindFloorNormal_GetTransform_1_1_Transform;        // 0x0190 (size: 0x60)
    TArray<FCachedRigElement> FindFloorNormal_1___FindFloorNormal_GetTransform_1_1_CachedIndex; // 0x01F0 (size: 0x10)
    FVector FindFloorNormal_1___FindFloorNormal_Subtract_3_A;                         // 0x0200 (size: 0x18)
    FTransform FindFloorNormal_1___FindFloorNormal_GetTransform_1_1_1_Transform;      // 0x0220 (size: 0x60)
    TArray<FCachedRigElement> FindFloorNormal_1___FindFloorNormal_GetTransform_1_1_1_CachedIndex; // 0x0280 (size: 0x10)
    FVector FindFloorNormal_1___FindFloorNormal_Subtract_3_B;                         // 0x0290 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_RigVMFunction_MathVectorMake_1_Result; // 0x02A8 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Add_Result;                           // 0x02C0 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Add_B__IO;                            // 0x02D8 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Subtract_Result;                      // 0x02F0 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Subtract_B__IO;                       // 0x0308 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Add_1_Result;                         // 0x0320 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Add_1_B__IO;                          // 0x0338 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Subtract_1_Result;                    // 0x0350 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Subtract_1_B__IO;                     // 0x0368 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_SphereTraceByTraceChannel_HitLocation; // 0x0380 (size: 0x18)
    bool FindFloorNormal_1___FindFloorNormal_SphereTraceByTraceChannel_bHit;          // 0x0398 (size: 0x1)
    FVector FindFloorNormal_1___FindFloorNormal_SphereTraceByTraceChannel_HitNormal;  // 0x03A0 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> FindFloorNormal_1___FindFloorNormal_SphereTraceByTraceChannel_WorkData; // 0x03B8 (size: 0x10)
    FVector FindFloorNormal_1___FindFloorNormal_SphereTraceByTraceChannel_1_HitLocation; // 0x03C8 (size: 0x18)
    bool FindFloorNormal_1___FindFloorNormal_SphereTraceByTraceChannel_1_bHit;        // 0x03E0 (size: 0x1)
    FVector FindFloorNormal_1___FindFloorNormal_SphereTraceByTraceChannel_1_HitNormal; // 0x03E8 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> FindFloorNormal_1___FindFloorNormal_SphereTraceByTraceChannel_1_WorkData; // 0x0400 (size: 0x10)
    FVector FindFloorNormal_1___FindFloorNormal_RigVMFunction_MathVectorCross_Result; // 0x0410 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Subtract_2_Result;                    // 0x0428 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_RigVMFunction_MathVectorCross_1_Result; // 0x0440 (size: 0x18)
    double FindFloorNormal_1___FindFloorNormal_Negate_Result;                         // 0x0458 (size: 0x8)
    float FindFloorNormal_1___FindFloorNormal_Dot___Result;                           // 0x0460 (size: 0x4)
    FVector FindFloorNormal_1___FindFloorNormal_Unit_1_Result;                        // 0x0468 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Rotate_Vector_Result;                 // 0x0480 (size: 0x18)
    FTransform FindFloorNormal_1___FindFloorNormal_GetTransform_3_Transform;          // 0x04A0 (size: 0x60)
    TArray<FCachedRigElement> FindFloorNormal_1___FindFloorNormal_GetTransform_3_CachedIndex; // 0x0500 (size: 0x10)
    FQuat FindFloorNormal_1___FindFloorNormal_Rotate_Vector_Transform;                // 0x0510 (size: 0x20)
    FVector FindFloorNormal_1___FindFloorNormal_RigVMFunction_MathVectorMake_Result;  // 0x0530 (size: 0x18)
    FVector FindFloorNormal_1___FindFloorNormal_Unit_Result;                          // 0x0548 (size: 0x18)
    double FindFloorNormal_1___FindFloorNormal_Negate_Value;                          // 0x0560 (size: 0x8)
    FQuat FindFloorNormal_1___FindFloorNormal_DISPATCH_RigVMDispatch_If_Result;       // 0x0570 (size: 0x20)
    bool FindFloorNormal_1___FindFloorNormal_RigVMFunction_MathBoolAnd_Result;        // 0x0590 (size: 0x1)
    bool FindFloorNormal_1___FindFloorNormal_DISPATCH_RigVMDispatch_If_Condition;     // 0x0591 (size: 0x1)
    FQuat FindFloorNormal_1___FindFloorNormal_RigVMFunction_MathQuaternionFromAxisAndAngle_Result; // 0x05A0 (size: 0x20)
    FQuat FindFloorNormal_1___FindFloorNormal_SpringInterpQuaternionV2_3_1_Result;    // 0x05C0 (size: 0x20)
    FVector FindFloorNormal_1___FindFloorNormal_SpringInterpQuaternionV2_3_1_AngularVelocity; // 0x05E0 (size: 0x18)
    TArray<FQuat> FindFloorNormal_1___FindFloorNormal_SpringInterpQuaternionV2_3_1_SimulatedResult; // 0x05F8 (size: 0x10)
    TArray<FQuaternionSpringState> FindFloorNormal_1___FindFloorNormal_SpringInterpQuaternionV2_3_1_SpringState; // 0x0608 (size: 0x10)
    FTransform AlignootLayingOnGround___AlignootLayingOnGround_OffsetTransformForItem_OffsetTransform__IO; // 0x0620 (size: 0x60)
    double AlignootLayingOnGround___AlignootLayingOnGround_Multiply_Result;           // 0x0680 (size: 0x8)
    double AlignootLayingOnGround___AlignootLayingOnGround_Multiply_A;                // 0x0688 (size: 0x8)
    float AlignootLayingOnGround___AlignootLayingOnGround_OffsetTransformForItem_Weight; // 0x0690 (size: 0x4)
    TArray<FCachedRigElement> AlignootLayingOnGround___AlignootLayingOnGround_OffsetTransformForItem_CachedIndex; // 0x0698 (size: 0x10)
    FName AlignootLayingOnGround___AlignootLayingOnGround_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x06A8 (size: 0x8)
    FTransform AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_4_Transform;      // 0x06B0 (size: 0x60)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_4_CachedIndex; // 0x0710 (size: 0x10)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_5_CachedIndex; // 0x0720 (size: 0x10)
    FTransform AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_Transform;        // 0x0730 (size: 0x60)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_CachedIndex; // 0x0790 (size: 0x10)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_CachedIndex; // 0x07A0 (size: 0x10)
    FTransform AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_Transform;      // 0x07B0 (size: 0x60)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_CachedIndex; // 0x0810 (size: 0x10)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_1_CachedIndex; // 0x0820 (size: 0x10)
    FTransform AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_1_Transform;    // 0x0830 (size: 0x60)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_1_CachedIndex; // 0x0890 (size: 0x10)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_1_1_CachedIndex; // 0x08A0 (size: 0x10)
    FTransform AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_1_1_Transform;  // 0x08B0 (size: 0x60)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_1_1_CachedIndex; // 0x0910 (size: 0x10)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_1_1_1_CachedIndex; // 0x0920 (size: 0x10)
    FTransform AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_1_2_Transform;  // 0x0930 (size: 0x60)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_GetTransform_1_1_2_CachedIndex; // 0x0990 (size: 0x10)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_Set_Transform_1_1_2_CachedIndex; // 0x09A0 (size: 0x10)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_ParentConstraint_ChildCache; // 0x09B0 (size: 0x10)
    TArray<TArray<FCachedRigElement>> AssingCTRLtoBones_2___AssingCTRLtoBones_ParentConstraint_ParentCaches; // 0x09C0 (size: 0x10)
    TArray<FCachedRigElement> AssingCTRLtoBones_2___AssingCTRLtoBones_ParentConstraint_1_ChildCache; // 0x09D0 (size: 0x10)
    TArray<TArray<FCachedRigElement>> AssingCTRLtoBones_2___AssingCTRLtoBones_ParentConstraint_1_ParentCaches; // 0x09E0 (size: 0x10)
    double FindLegsLength___FindLegsLength_Multiply_1_Result;                         // 0x09F0 (size: 0x8)
    double FindLegsLength___FindLegsLength_Add_Result;                                // 0x09F8 (size: 0x8)
    double FindLegsLength___FindLegsLength_Add_2_Result;                              // 0x0A00 (size: 0x8)
    float FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_3_Result;  // 0x0A08 (size: 0x4)
    FTransform FindLegsLength___FindLegsLength_GetTransform_6_1_1_2_Transform;        // 0x0A10 (size: 0x60)
    TArray<FCachedRigElement> FindLegsLength___FindLegsLength_GetTransform_6_1_1_2_CachedIndex; // 0x0A70 (size: 0x10)
    FVector FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_3_A;     // 0x0A80 (size: 0x18)
    FTransform FindLegsLength___FindLegsLength_GetTransform_6_1_1_Transform;          // 0x0AA0 (size: 0x60)
    TArray<FCachedRigElement> FindLegsLength___FindLegsLength_GetTransform_6_1_1_CachedIndex; // 0x0B00 (size: 0x10)
    FVector FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_3_B;     // 0x0B10 (size: 0x18)
    double FindLegsLength___FindLegsLength_Add_2_A;                                   // 0x0B28 (size: 0x8)
    float FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_Result;    // 0x0B30 (size: 0x4)
    FTransform FindLegsLength___FindLegsLength_GetTransform_6_2_1_Transform;          // 0x0B40 (size: 0x60)
    TArray<FCachedRigElement> FindLegsLength___FindLegsLength_GetTransform_6_2_1_CachedIndex; // 0x0BA0 (size: 0x10)
    FVector FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_B;       // 0x0BB0 (size: 0x18)
    double FindLegsLength___FindLegsLength_Add_2_B;                                   // 0x0BC8 (size: 0x8)
    float FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_1_Result;  // 0x0BD0 (size: 0x4)
    FTransform FindLegsLength___FindLegsLength_GetTransform_6_2_1_2_Transform;        // 0x0BE0 (size: 0x60)
    TArray<FCachedRigElement> FindLegsLength___FindLegsLength_GetTransform_6_2_1_2_CachedIndex; // 0x0C40 (size: 0x10)
    FVector FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_1_B;     // 0x0C50 (size: 0x18)
    double FindLegsLength___FindLegsLength_Add_B;                                     // 0x0C68 (size: 0x8)
    float FindLegsLength___FindLegsLength_SpringInterp_Result;                        // 0x0C70 (size: 0x4)
    float FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_1_Result;         // 0x0C74 (size: 0x4)
    bool FindLegsLength___FindLegsLength_RigVMFunction_MathBoolNot_2_1_Result;        // 0x0C78 (size: 0x1)
    bool FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_1_Condition;       // 0x0C79 (size: 0x1)
    float FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_2_1_Result;       // 0x0C7C (size: 0x4)
    bool FindLegsLength___FindLegsLength_GreaterEqual_1_Result;                       // 0x0C80 (size: 0x1)
    bool FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_2_1_Condition;     // 0x0C81 (size: 0x1)
    float FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_3_1_Result;       // 0x0C84 (size: 0x4)
    float FindLegsLength___FindLegsLength_SpringInterp_Velocity;                      // 0x0C88 (size: 0x4)
    TArray<float> FindLegsLength___FindLegsLength_SpringInterp_SimulatedResult;       // 0x0C90 (size: 0x10)
    TArray<FFloatSpringState> FindLegsLength___FindLegsLength_SpringInterp_SpringState; // 0x0CA0 (size: 0x10)
    double FindLegsLength___FindLegsLength_Multiply_1_B;                              // 0x0CB0 (size: 0x8)
    double FindLegsLength___FindLegsLength_Multiply_Result;                           // 0x0CB8 (size: 0x8)
    double FindLegsLength___FindLegsLength_Add_1_Result;                              // 0x0CC0 (size: 0x8)
    double FindLegsLength___FindLegsLength_Add_2_1_Result;                            // 0x0CC8 (size: 0x8)
    float FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_3_1_Result; // 0x0CD0 (size: 0x4)
    FTransform FindLegsLength___FindLegsLength_GetTransform_6_1_1_2_1_Transform;      // 0x0CE0 (size: 0x60)
    TArray<FCachedRigElement> FindLegsLength___FindLegsLength_GetTransform_6_1_1_2_1_CachedIndex; // 0x0D40 (size: 0x10)
    FVector FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_3_1_A;   // 0x0D50 (size: 0x18)
    FTransform FindLegsLength___FindLegsLength_GetTransform_6_1_1_1_Transform;        // 0x0D70 (size: 0x60)
    TArray<FCachedRigElement> FindLegsLength___FindLegsLength_GetTransform_6_1_1_1_CachedIndex; // 0x0DD0 (size: 0x10)
    FVector FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_3_1_B;   // 0x0DE0 (size: 0x18)
    double FindLegsLength___FindLegsLength_Add_2_1_A;                                 // 0x0DF8 (size: 0x8)
    float FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_2_Result;  // 0x0E00 (size: 0x4)
    FTransform FindLegsLength___FindLegsLength_GetTransform_6_2_1_1_Transform;        // 0x0E10 (size: 0x60)
    TArray<FCachedRigElement> FindLegsLength___FindLegsLength_GetTransform_6_2_1_1_CachedIndex; // 0x0E70 (size: 0x10)
    FVector FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_2_B;     // 0x0E80 (size: 0x18)
    double FindLegsLength___FindLegsLength_Add_2_1_B;                                 // 0x0E98 (size: 0x8)
    float FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_1_1_Result; // 0x0EA0 (size: 0x4)
    FTransform FindLegsLength___FindLegsLength_GetTransform_6_2_1_2_1_Transform;      // 0x0EB0 (size: 0x60)
    TArray<FCachedRigElement> FindLegsLength___FindLegsLength_GetTransform_6_2_1_2_1_CachedIndex; // 0x0F10 (size: 0x10)
    FVector FindLegsLength___FindLegsLength_RigVMFunction_MathVectorDistance_1_1_B;   // 0x0F20 (size: 0x18)
    double FindLegsLength___FindLegsLength_Add_1_B;                                   // 0x0F38 (size: 0x8)
    float FindLegsLength___FindLegsLength_SpringInterp_1_Result;                      // 0x0F40 (size: 0x4)
    float FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_Result;           // 0x0F44 (size: 0x4)
    bool FindLegsLength___FindLegsLength_RigVMFunction_MathBoolNot_2_Result;          // 0x0F48 (size: 0x1)
    bool FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_Condition;         // 0x0F49 (size: 0x1)
    float FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_2_Result;         // 0x0F4C (size: 0x4)
    bool FindLegsLength___FindLegsLength_GreaterEqual_Result;                         // 0x0F50 (size: 0x1)
    bool FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_2_Condition;       // 0x0F51 (size: 0x1)
    float FindLegsLength___FindLegsLength_DISPATCH_RigVMDispatch_If_3_Result;         // 0x0F54 (size: 0x4)
    float FindLegsLength___FindLegsLength_SpringInterp_1_Velocity;                    // 0x0F58 (size: 0x4)
    TArray<float> FindLegsLength___FindLegsLength_SpringInterp_1_SimulatedResult;     // 0x0F60 (size: 0x10)
    TArray<FFloatSpringState> FindLegsLength___FindLegsLength_SpringInterp_1_SpringState; // 0x0F70 (size: 0x10)
    double FindLegsLength___FindLegsLength_Multiply_B;                                // 0x0F80 (size: 0x8)
    bool RigVMModel___RigVMFunction_MathBoolAnd_Result;                               // 0x0F88 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolOr_1_RigVMFunction_MathBoolOr_1_1_Result; // 0x0F89 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolOr_1_RigVMFunction_MathBoolOr_1_Result;   // 0x0F8A (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolNot_Result;                               // 0x0F8B (size: 0x1)
    double FindSlopeAngle___FindSlopeAngle_Subtract_3_Result;                         // 0x0F90 (size: 0x8)
    double FindSlopeAngle___FindSlopeAngle_Degrees_Result;                            // 0x0F98 (size: 0x8)
    double FindSlopeAngle___FindSlopeAngle_Acos_Result;                               // 0x0FA0 (size: 0x8)
    float FindSlopeAngle___FindSlopeAngle_Dot___Result;                               // 0x0FA8 (size: 0x4)
    FVector FindSlopeAngle___FindSlopeAngle_Unit_Result;                              // 0x0FB0 (size: 0x18)
    FVector FindSlopeAngle___FindSlopeAngle_SphereTraceByTraceChannel_HitNormal;      // 0x0FC8 (size: 0x18)
    FVector FindSlopeAngle___FindSlopeAngle_Add_3_Result;                             // 0x0FE0 (size: 0x18)
    FTransform FindSlopeAngle___FindSlopeAngle_GetTransform_Transform;                // 0x1000 (size: 0x60)
    TArray<FCachedRigElement> FindSlopeAngle___FindSlopeAngle_GetTransform_CachedIndex; // 0x1060 (size: 0x10)
    FVector FindSlopeAngle___FindSlopeAngle_Add_3_A;                                  // 0x1070 (size: 0x18)
    FVector FindSlopeAngle___FindSlopeAngle_Subtract_1_Result;                        // 0x1088 (size: 0x18)
    bool FindSlopeAngle___FindSlopeAngle_SphereTraceByTraceChannel_bHit;              // 0x10A0 (size: 0x1)
    FVector FindSlopeAngle___FindSlopeAngle_SphereTraceByTraceChannel_HitLocation;    // 0x10A8 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> FindSlopeAngle___FindSlopeAngle_SphereTraceByTraceChannel_WorkData; // 0x10C0 (size: 0x10)
    FVector FindSlopeAngle___FindSlopeAngle_Unit_1_Result;                            // 0x10D0 (size: 0x18)
    FVector FindSlopeAngle___FindSlopeAngle_RigVMFunction_MathVectorMake_Result;      // 0x10E8 (size: 0x18)
    double FindSlopeAngle___FindSlopeAngle_Acos_Value;                                // 0x1100 (size: 0x8)
    float FindSlopeAngle___FindSlopeAngle_RigVMFunction_MathFloatMake_1_Value__IO;    // 0x1108 (size: 0x4)
    double FindSlopeAngle___FindSlopeAngle_Subtract_3_B;                              // 0x1110 (size: 0x8)
    double FindSlopeAngle___FindSlopeAngle_Subtract_3_1_Result;                       // 0x1118 (size: 0x8)
    double FindSlopeAngle___FindSlopeAngle_Subtract_3_1_A;                            // 0x1120 (size: 0x8)
    double FindSlopeAngle___FindSlopeAngle_Degrees_1_Result;                          // 0x1128 (size: 0x8)
    double FindSlopeAngle___FindSlopeAngle_Acos_1_Result;                             // 0x1130 (size: 0x8)
    float FindSlopeAngle___FindSlopeAngle_Dot___1_Result;                             // 0x1138 (size: 0x4)
    FVector FindSlopeAngle___FindSlopeAngle_Unit_1_1_Result;                          // 0x1140 (size: 0x18)
    FVector FindSlopeAngle___FindSlopeAngle_RigVMFunction_MathVectorMake_1_Result;    // 0x1158 (size: 0x18)
    double FindSlopeAngle___FindSlopeAngle_Acos_1_Value;                              // 0x1170 (size: 0x8)
    FVector RigVMModel___LFoot_SearchForFloor_FloorOffset;                            // 0x1178 (size: 0x18)
    FVector RigVMModel___LFoot_SearchForFloor_FloorNormal;                            // 0x1190 (size: 0x18)
    FRigVMInstructionSetExecuteState LFoot_SearchForFloorte_893673778;                // 0x11A8 (size: 0x50)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_4_Result; // 0x11F8 (size: 0x18)
    FRigVMInstructionSetExecuteState LFoot_SearchForFloorte_1709931146;               // 0x1210 (size: 0x50)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_GreaterEqual_Result;             // 0x1260 (size: 0x1)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_4_Condition; // 0x1261 (size: 0x1)
    FRigVMInstructionSetExecuteState LFoot_SearchForFloorte_665697146;                // 0x1268 (size: 0x50)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_Result;                   // 0x12B8 (size: 0x18)
    FRigVMInstructionSetExecuteState LFoot_SearchForFloorte_1896470276;               // 0x12D0 (size: 0x50)
    FTransform LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_Transform;    // 0x1320 (size: 0x60)
    TArray<FCachedRigElement> LFoot_SearchForFloor___LFoot_SearchForFloor_GetTransform_CachedIndex; // 0x1380 (size: 0x10)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_A;                        // 0x1390 (size: 0x18)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Result; // 0x13A8 (size: 0x4)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_Greater_Result;                  // 0x13AC (size: 0x1)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_GetCurveValue_1_Value;          // 0x13B0 (size: 0x4)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_GetCurveValue_1_Valid;           // 0x13B4 (size: 0x1)
    TArray<FCachedRigElement> LFoot_SearchForFloor___LFoot_SearchForFloor_GetCurveValue_1_CachedCurveIndex; // 0x13B8 (size: 0x10)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Greater_A;                     // 0x13C8 (size: 0x8)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Condition; // 0x13D0 (size: 0x1)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Add_4_Result;                  // 0x13D8 (size: 0x8)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_True; // 0x13E0 (size: 0x4)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_3_Result; // 0x13E4 (size: 0x4)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_MathBoolOr_1_Result; // 0x13E8 (size: 0x1)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_CoreNotEquals_Result; // 0x13E9 (size: 0x1)
    FName LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_CoreNotEquals_A; // 0x13EC (size: 0x8)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_3_Condition; // 0x13F4 (size: 0x1)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Divide_Result;                 // 0x13F8 (size: 0x8)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_3_True; // 0x1400 (size: 0x4)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_3_False; // 0x1404 (size: 0x4)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Add_B__IO;                    // 0x1408 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Rotate_Vector_Result;         // 0x1420 (size: 0x18)
    FRigVMInstructionSetExecuteState LFoot_SearchForFloorte_2767537711;               // 0x1438 (size: 0x50)
    FQuat LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_MathQuaternionFromEuler_1_Result; // 0x1490 (size: 0x20)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_MathQuaternionFromEuler_1_Euler__IO; // 0x14B0 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_4_1_Result; // 0x14C8 (size: 0x18)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_4_1_Condition; // 0x14E0 (size: 0x1)
    FRigVMInstructionSetExecuteState LFoot_SearchForFloorte_591600406;                // 0x14E8 (size: 0x50)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Subtract_Result;              // 0x1538 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Subtract_B__IO;               // 0x1550 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_Rotate_Vector_1_Result;       // 0x1568 (size: 0x18)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_HitLocation; // 0x1580 (size: 0x18)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_bHit;  // 0x1598 (size: 0x1)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_HitNormal; // 0x15A0 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> LFoot_SearchForFloor___LFoot_SearchForFloor_SphereTraceByTraceChannel_WorkData; // 0x15B8 (size: 0x10)
    FVector LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_BreakStruct_Elements; // 0x15C8 (size: 0x18)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_1_Result; // 0x15E0 (size: 0x8)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_MathBoolOr_RigVMFunction_MathBoolOr_1_Result; // 0x15E8 (size: 0x1)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_RigVMFunction_MathBoolOr_RigVMFunction_MathBoolOr_Result; // 0x15E9 (size: 0x1)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_Greater_1_Result;                // 0x15EA (size: 0x1)
    float LFoot_SearchForFloor___LFoot_SearchForFloor_GetCurveValue_Value;            // 0x15EC (size: 0x4)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_GetCurveValue_Valid;             // 0x15F0 (size: 0x1)
    TArray<FCachedRigElement> LFoot_SearchForFloor___LFoot_SearchForFloor_GetCurveValue_CachedCurveIndex; // 0x15F8 (size: 0x10)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_Greater_1_A;                   // 0x1608 (size: 0x8)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_LessEqual_Result;                // 0x1610 (size: 0x1)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_LessEqual_A;                   // 0x1618 (size: 0x8)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_1_Condition; // 0x1620 (size: 0x1)
    double LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_1_False; // 0x1628 (size: 0x8)
    bool LFoot_SearchForFloor___LFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_Condition; // 0x1630 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolOr_Result;   // 0x1631 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_5_Result; // 0x1632 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_4_Result; // 0x1633 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_3_Result; // 0x1634 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_2_Result; // 0x1635 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_1_Result; // 0x1636 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_Result; // 0x1637 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_LessEqual_Result;                  // 0x1638 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolNot_Result;  // 0x1639 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolNot_2_Result; // 0x163A (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolNot_1_Result; // 0x163B (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolNot_3_Result; // 0x163C (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_3_Result; // 0x163D (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_2_Result; // 0x163E (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_1_Result; // 0x163F (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_Result; // 0x1640 (size: 0x1)
    bool Check_If_FootL_Lock___Check_If_FootL_Lock_GreaterEqual_Result;               // 0x1641 (size: 0x1)
    double Check_If_FootL_Lock___Check_If_FootL_Lock_Add_1_Result;                    // 0x1648 (size: 0x8)
    float Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_GetDeltaTime_Result; // 0x1650 (size: 0x4)
    double Check_If_FootL_Lock___Check_If_FootL_Lock_Add_1_A;                         // 0x1658 (size: 0x8)
    FName Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1660 (size: 0x8)
    FName Check_If_FootL_Lock___Check_If_FootL_Lock_RigVMFunction_ControlFlowBranch_3_BlockToRun; // 0x1668 (size: 0x8)
    FVector RigVMModel___RFoot_SearchForFloor_FloorNormal;                            // 0x1670 (size: 0x18)
    FVector RigVMModel___RFoot_SearchForFloor_FloorOffset;                            // 0x1688 (size: 0x18)
    FRigVMInstructionSetExecuteState RFoot_SearchForFloorte_573980950;                // 0x16A0 (size: 0x50)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_4_Result; // 0x16F0 (size: 0x18)
    FRigVMInstructionSetExecuteState RFoot_SearchForFloorte_3500382161;               // 0x1708 (size: 0x50)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_GreaterEqual_Result;             // 0x1758 (size: 0x1)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_4_Condition; // 0x1759 (size: 0x1)
    FRigVMInstructionSetExecuteState RFoot_SearchForFloorte_665697146;                // 0x1760 (size: 0x50)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_Result;                   // 0x17B0 (size: 0x18)
    FRigVMInstructionSetExecuteState RFoot_SearchForFloorte_103275326;                // 0x17C8 (size: 0x50)
    FTransform RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_Transform;    // 0x1820 (size: 0x60)
    TArray<FCachedRigElement> RFoot_SearchForFloor___RFoot_SearchForFloor_GetTransform_CachedIndex; // 0x1880 (size: 0x10)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_A;                        // 0x1890 (size: 0x18)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Result; // 0x18A8 (size: 0x4)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_Greater_Result;                  // 0x18AC (size: 0x1)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_GetCurveValue_1_Value;          // 0x18B0 (size: 0x4)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_GetCurveValue_1_Valid;           // 0x18B4 (size: 0x1)
    TArray<FCachedRigElement> RFoot_SearchForFloor___RFoot_SearchForFloor_GetCurveValue_1_CachedCurveIndex; // 0x18B8 (size: 0x10)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Greater_A;                     // 0x18C8 (size: 0x8)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_Condition; // 0x18D0 (size: 0x1)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Add_4_Result;                  // 0x18D8 (size: 0x8)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_True; // 0x18E0 (size: 0x4)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_3_Result; // 0x18E8 (size: 0x8)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_MathBoolOr_1_Result; // 0x18F0 (size: 0x1)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_CoreNotEquals_Result; // 0x18F1 (size: 0x1)
    FName RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_CoreNotEquals_A; // 0x18F4 (size: 0x8)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_3_Condition; // 0x18FC (size: 0x1)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Divide_Result;                 // 0x1900 (size: 0x8)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_2_False; // 0x1908 (size: 0x4)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Add_B__IO;                    // 0x1910 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Rotate_Vector_Result;         // 0x1928 (size: 0x18)
    FRigVMInstructionSetExecuteState RFoot_SearchForFloorte_2767537711;               // 0x1940 (size: 0x50)
    FQuat RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_MathQuaternionFromEuler_1_Result; // 0x1990 (size: 0x20)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_MathQuaternionFromEuler_1_Euler__IO; // 0x19B0 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_4_1_Result; // 0x19C8 (size: 0x18)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_4_1_Condition; // 0x19E0 (size: 0x1)
    FRigVMInstructionSetExecuteState RFoot_SearchForFloorte_2709179337;               // 0x19E8 (size: 0x50)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Subtract_Result;              // 0x1A38 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Subtract_B__IO;               // 0x1A50 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_Rotate_Vector_1_Result;       // 0x1A68 (size: 0x18)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_HitLocation; // 0x1A80 (size: 0x18)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_bHit;  // 0x1A98 (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_HitNormal; // 0x1AA0 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> RFoot_SearchForFloor___RFoot_SearchForFloor_SphereTraceByTraceChannel_WorkData; // 0x1AB8 (size: 0x10)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_Condition; // 0x1AC8 (size: 0x1)
    FVector RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_BreakStruct_Elements; // 0x1AD0 (size: 0x18)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_1_Result; // 0x1AE8 (size: 0x8)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_MathBoolOr_RigVMFunction_MathBoolOr_1_Result; // 0x1AF0 (size: 0x1)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_RigVMFunction_MathBoolOr_RigVMFunction_MathBoolOr_Result; // 0x1AF1 (size: 0x1)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_Greater_1_Result;                // 0x1AF2 (size: 0x1)
    float RFoot_SearchForFloor___RFoot_SearchForFloor_GetCurveValue_Value;            // 0x1AF4 (size: 0x4)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_GetCurveValue_Valid;             // 0x1AF8 (size: 0x1)
    TArray<FCachedRigElement> RFoot_SearchForFloor___RFoot_SearchForFloor_GetCurveValue_CachedCurveIndex; // 0x1B00 (size: 0x10)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_Greater_1_A;                   // 0x1B10 (size: 0x8)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_LessEqual_Result;                // 0x1B18 (size: 0x1)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_LessEqual_A;                   // 0x1B20 (size: 0x8)
    bool RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_1_Condition; // 0x1B28 (size: 0x1)
    double RFoot_SearchForFloor___RFoot_SearchForFloor_DISPATCH_RigVMDispatch_If_1_False; // 0x1B30 (size: 0x8)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolOr_Result;   // 0x1B38 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_5_Result; // 0x1B39 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_4_Result; // 0x1B3A (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_3_Result; // 0x1B3B (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_2_Result; // 0x1B3C (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_1_Result; // 0x1B3D (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_6_RigVMFunction_MathBoolAnd_6_Result; // 0x1B3E (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_LessEqual_Result;                  // 0x1B3F (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolNot_Result;  // 0x1B40 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolNot_2_Result; // 0x1B41 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolNot_1_Result; // 0x1B42 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolNot_3_Result; // 0x1B43 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_3_Result; // 0x1B44 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_2_Result; // 0x1B45 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_1_Result; // 0x1B46 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_Result; // 0x1B47 (size: 0x1)
    bool Check_If_FootR_Lock___Check_If_FootR_Lock_GreaterEqual_Result;               // 0x1B48 (size: 0x1)
    double Check_If_FootR_Lock___Check_If_FootR_Lock_Add_1_Result;                    // 0x1B50 (size: 0x8)
    float Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_GetDeltaTime_Result; // 0x1B58 (size: 0x4)
    double Check_If_FootR_Lock___Check_If_FootR_Lock_Add_1_A;                         // 0x1B60 (size: 0x8)
    FName Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1B68 (size: 0x8)
    FName Check_If_FootR_Lock___Check_If_FootR_Lock_RigVMFunction_ControlFlowBranch_3_BlockToRun; // 0x1B70 (size: 0x8)
    float RigVMModel___DISPATCH_RigVMDispatch_If_4_Result;                            // 0x1B78 (size: 0x4)
    FRigVMInstructionSetExecuteState BlockExecuteState_4244561483;                    // 0x1B80 (size: 0x50)
    bool RigVMModel___RemapingPelvisHeightDependingOnSlope_Condition;                 // 0x1BD0 (size: 0x1)
    double RigVMModel___RemapingPelvisHeightDependingOnSlope_RemapSlopeDown;          // 0x1BD8 (size: 0x8)
    float RigVMModel___RemapingPelvisHeightDependingOnSlope_RemapSlopeUp;             // 0x1BE0 (size: 0x4)
    FRigVMInstructionSetExecuteState BlockExecuteState_1366080449;                    // 0x1BE8 (size: 0x50)
    double RigVMModel___Add_Result;                                                   // 0x1C38 (size: 0x8)
    double RigVMModel___Add_2_Result;                                                 // 0x1C40 (size: 0x8)
    double RigVMModel___DISPATCH_RigVMDispatch_If_6_Result;                           // 0x1C48 (size: 0x8)
    bool RigVMModel___DISPATCH_RigVMDispatch_If_6_Condition;                          // 0x1C50 (size: 0x1)
    double RigVMModel___DISPATCH_RigVMDispatch_If_3_Result;                           // 0x1C58 (size: 0x8)
    bool RigVMModel___RigVMFunction_MathBoolAnd_3_RigVMFunction_MathBoolAnd_3_2_Result; // 0x1C60 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolAnd_3_RigVMFunction_MathBoolAnd_3_1_Result; // 0x1C61 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolAnd_3_RigVMFunction_MathBoolAnd_3_Result; // 0x1C62 (size: 0x1)
    FRigVMInstructionSetExecuteState BlockExecuteState_2038516602;                    // 0x1C68 (size: 0x50)
    bool RigVMModel___GreaterEqual_Result;                                            // 0x1CB8 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolNot_3_Result;                             // 0x1CB9 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolNot_2_Result;                             // 0x1CBA (size: 0x1)
    bool RigVMModel___DISPATCH_RigVMDispatch_If_3_Condition;                          // 0x1CBB (size: 0x1)
    double RigVMModel___Maximum_Result;                                               // 0x1CC0 (size: 0x8)
    FRigVMInstructionSetExecuteState BlockExecuteState_1159963797;                    // 0x1CC8 (size: 0x50)
    double RigVMModel___Minimum_Result;                                               // 0x1D18 (size: 0x8)
    float RigVMModel___DISPATCH_RigVMDispatch_If_2_Result;                            // 0x1D20 (size: 0x4)
    bool RigVMModel___RigVMFunction_MathBoolAnd_1_Result;                             // 0x1D24 (size: 0x1)
    bool RigVMModel___RigVMFunction_MathBoolOr_Result;                                // 0x1D25 (size: 0x1)
    bool RigVMModel___LessEqual_1_Result;                                             // 0x1D26 (size: 0x1)
    double RigVMModel___Add_2_B;                                                      // 0x1D28 (size: 0x8)
    float RigVMModel___DISPATCH_RigVMDispatch_If_Result;                              // 0x1D30 (size: 0x4)
    FRigVMInstructionSetExecuteState BlockExecuteState_1944252948;                    // 0x1D38 (size: 0x50)
    bool RigVMModel___GetCurveValue_Valid;                                            // 0x1D88 (size: 0x1)
    float RigVMModel___GetCurveValue_Value;                                           // 0x1D8C (size: 0x4)
    TArray<FCachedRigElement> RigVMModel___GetCurveValue_CachedCurveIndex;            // 0x1D90 (size: 0x10)
    bool RigVMModel___DISPATCH_RigVMDispatch_If_Condition;                            // 0x1DA0 (size: 0x1)
    double RigVMModel___Add_B;                                                        // 0x1DA8 (size: 0x8)
    float RigVMModel___RemapingPelvisHeightDependingOnSlope_False;                    // 0x1DB0 (size: 0x4)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_RigVMFunction_MathBoolAnd_5_RigVMFunction_MathBoolAnd_5_1_Result; // 0x1DB4 (size: 0x1)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_RigVMFunction_MathBoolAnd_5_RigVMFunction_MathBoolAnd_5_Result; // 0x1DB5 (size: 0x1)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_RigVMFunction_MathBoolNot_2_Result; // 0x1DB6 (size: 0x1)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_LessEqual_Result; // 0x1DB7 (size: 0x1)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_RigVMFunction_MathBoolAnd_3_RigVMFunction_MathBoolAnd_3_2_Result; // 0x1DB8 (size: 0x1)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_RigVMFunction_MathBoolAnd_3_RigVMFunction_MathBoolAnd_3_1_Result; // 0x1DB9 (size: 0x1)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_RigVMFunction_MathBoolAnd_3_RigVMFunction_MathBoolAnd_3_Result; // 0x1DBA (size: 0x1)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_GreaterEqual_3_Result; // 0x1DBB (size: 0x1)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_DISPATCH_RigVMDispatch_If_3_Condition; // 0x1DBC (size: 0x1)
    double RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_Remap_Result; // 0x1DC0 (size: 0x8)
    float RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_DISPATCH_RigVMDispatch_If_3_1_Result; // 0x1DC8 (size: 0x4)
    bool RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_GreaterEqual_1_Result; // 0x1DCC (size: 0x1)
    double RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_Remap_TargetMaximum; // 0x1DD0 (size: 0x8)
    float RemapingPelvisHeightDependingOnSlope___RemapingPelvisHeightDependingOnSlope_DISPATCH_RigVMDispatch_If_3_True; // 0x1DD8 (size: 0x4)
    bool RigVMModel___DISPATCH_RigVMDispatch_If_4_Condition;                          // 0x1DDC (size: 0x1)
    float RigVMModel___DISPATCH_RigVMDispatch_If_4_True;                              // 0x1DE0 (size: 0x4)
    FVector RigVMModel___Rotate_Vector_Result;                                        // 0x1DE8 (size: 0x18)
    FTransform RigVMModel___Inverse_Result;                                           // 0x1E00 (size: 0x60)
    FTransform RigVMModel___GetTransform_2_Transform;                                 // 0x1E60 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_2_CachedIndex;                // 0x1EC0 (size: 0x10)
    float RigVMModel___SpringInterp_Result;                                           // 0x1ED0 (size: 0x4)
    float RigVMModel___SpringInterp_Target;                                           // 0x1ED4 (size: 0x4)
    float RigVMModel___DISPATCH_RigVMDispatch_If_7_Result;                            // 0x1ED8 (size: 0x4)
    bool RigVMModel___Greater_1_Result;                                               // 0x1EDC (size: 0x1)
    bool RigVMModel___DISPATCH_RigVMDispatch_If_7_Condition;                          // 0x1EDD (size: 0x1)
    float RigVMModel___DISPATCH_RigVMDispatch_If_8_Result;                            // 0x1EE0 (size: 0x4)
    bool RigVMModel___RigVMFunction_MathBoolOr_2_Result;                              // 0x1EE4 (size: 0x1)
    bool RigVMModel___LessEqual_Result;                                               // 0x1EE5 (size: 0x1)
    float RigVMModel___SpringInterp_Current;                                          // 0x1EE8 (size: 0x4)
    float RigVMModel___SpringInterp_Velocity;                                         // 0x1EEC (size: 0x4)
    TArray<float> RigVMModel___SpringInterp_SimulatedResult;                          // 0x1EF0 (size: 0x10)
    TArray<FFloatSpringState> RigVMModel___SpringInterp_SpringState;                  // 0x1F00 (size: 0x10)
    FVector RigVMModel___Rotate_Vector_Vector__IO;                                    // 0x1F10 (size: 0x18)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_2_CachedIndex;               // 0x1F28 (size: 0x10)
    double RigVMModel___Adjust_LFootHeight_New_Foot_Height;                           // 0x1F38 (size: 0x8)
    FVector RigVMModel___Adjust_LFootHeight_Offset;                                   // 0x1F40 (size: 0x18)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_Inverse_Result;                // 0x1F60 (size: 0x60)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_Transform;        // 0x1FC0 (size: 0x60)
    TArray<FCachedRigElement> Adjust_LFootHeight___Adjust_LFootHeight_GetTransform_CachedIndex; // 0x2020 (size: 0x10)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Result;                // 0x2030 (size: 0x4)
    double Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_Result;  // 0x2038 (size: 0x8)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_1_Result; // 0x2040 (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_Result; // 0x2041 (size: 0x1)
    FRigVMInstructionSetExecuteState Adjust_LFootHeightte_4025732084;                 // 0x2048 (size: 0x50)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolNot_Result;    // 0x2098 (size: 0x1)
    FRigVMInstructionSetExecuteState Adjust_LFootHeightte_1349641207;                 // 0x20A0 (size: 0x50)
    bool Adjust_LFootHeight___Adjust_LFootHeight_LessEqual_Result;                    // 0x20F0 (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_Condition; // 0x20F1 (size: 0x1)
    double Adjust_LFootHeight___Adjust_LFootHeight_Multiply_Result;                   // 0x20F8 (size: 0x8)
    double Adjust_LFootHeight___Adjust_LFootHeight_Remap_Result;                      // 0x2100 (size: 0x8)
    float Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_1_Result; // 0x2108 (size: 0x4)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolAnd_1_RigVMFunction_MathBoolAnd_1_3_Result; // 0x210C (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolAnd_1_RigVMFunction_MathBoolAnd_1_2_Result; // 0x210D (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolAnd_1_RigVMFunction_MathBoolAnd_1_1_Result; // 0x210E (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolAnd_1_RigVMFunction_MathBoolAnd_1_Result; // 0x210F (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolNot_1_Result;  // 0x2110 (size: 0x1)
    FRigVMInstructionSetExecuteState Adjust_LFootHeightte_1132557351;                 // 0x2118 (size: 0x50)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolNot_2_Result;  // 0x2168 (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_1_Condition; // 0x2169 (size: 0x1)
    float Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_1_True;   // 0x216C (size: 0x4)
    double Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_2_Result; // 0x2170 (size: 0x8)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolAnd_2_RigVMFunction_MathBoolAnd_2_3_Result; // 0x2178 (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolAnd_2_RigVMFunction_MathBoolAnd_2_2_Result; // 0x2179 (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolAnd_2_RigVMFunction_MathBoolAnd_2_1_Result; // 0x217A (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolAnd_2_RigVMFunction_MathBoolAnd_2_Result; // 0x217B (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_GreaterEqual_Result;                 // 0x217C (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_RigVMFunction_MathBoolNot_3_Result;  // 0x217D (size: 0x1)
    bool Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_2_Condition; // 0x217E (size: 0x1)
    float Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_1_False;  // 0x2180 (size: 0x4)
    double Adjust_LFootHeight___Adjust_LFootHeight_DISPATCH_RigVMDispatch_If_False;   // 0x2188 (size: 0x8)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Target;                // 0x2190 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Current;               // 0x2194 (size: 0x4)
    float Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_Velocity;              // 0x2198 (size: 0x4)
    TArray<float> Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_SimulatedResult; // 0x21A0 (size: 0x10)
    TArray<FFloatSpringState> Adjust_LFootHeight___Adjust_LFootHeight_SpringInterp_SpringState; // 0x21B0 (size: 0x10)
    FVector Adjust_LFootHeight___Adjust_LFootHeight_Rotate_Vector_Vector__IO;         // 0x21C0 (size: 0x18)
    FTransform Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_OffsetTransform__IO; // 0x21E0 (size: 0x60)
    TArray<FCachedRigElement> Adjust_LFootHeight___Adjust_LFootHeight_OffsetTransformForItem_CachedIndex; // 0x2240 (size: 0x10)
    double RigVMModel___Adjust_RFootHeight_New_Foot_Height;                           // 0x2250 (size: 0x8)
    FVector RigVMModel___Adjust_RFootHeight_Offset;                                   // 0x2258 (size: 0x18)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_Inverse_Result;                // 0x2270 (size: 0x60)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_Transform;        // 0x22D0 (size: 0x60)
    TArray<FCachedRigElement> Adjust_RFootHeight___Adjust_RFootHeight_GetTransform_CachedIndex; // 0x2330 (size: 0x10)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Result;                // 0x2340 (size: 0x4)
    double Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_Result;  // 0x2348 (size: 0x8)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_1_Result; // 0x2350 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolAnd_RigVMFunction_MathBoolAnd_Result; // 0x2351 (size: 0x1)
    FRigVMInstructionSetExecuteState Adjust_RFootHeightte_4025732084;                 // 0x2358 (size: 0x50)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolNot_Result;    // 0x23A8 (size: 0x1)
    FRigVMInstructionSetExecuteState Adjust_RFootHeightte_1349641207;                 // 0x23B0 (size: 0x50)
    bool Adjust_RFootHeight___Adjust_RFootHeight_LessEqual_Result;                    // 0x2400 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_Condition; // 0x2401 (size: 0x1)
    double Adjust_RFootHeight___Adjust_RFootHeight_Multiply_Result;                   // 0x2408 (size: 0x8)
    double Adjust_RFootHeight___Adjust_RFootHeight_Remap_Result;                      // 0x2410 (size: 0x8)
    double Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_1_Result; // 0x2418 (size: 0x8)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolAnd_1_RigVMFunction_MathBoolAnd_1_3_Result; // 0x2420 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolAnd_1_RigVMFunction_MathBoolAnd_1_2_Result; // 0x2421 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolAnd_1_RigVMFunction_MathBoolAnd_1_1_Result; // 0x2422 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolAnd_1_RigVMFunction_MathBoolAnd_1_Result; // 0x2423 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolNot_1_Result;  // 0x2424 (size: 0x1)
    FRigVMInstructionSetExecuteState Adjust_RFootHeightte_1132557351;                 // 0x2428 (size: 0x50)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolNot_2_Result;  // 0x2478 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_1_Condition; // 0x2479 (size: 0x1)
    float Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_2_Result; // 0x247C (size: 0x4)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolAnd_2_RigVMFunction_MathBoolAnd_2_3_Result; // 0x2480 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolAnd_2_RigVMFunction_MathBoolAnd_2_2_Result; // 0x2481 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolAnd_2_RigVMFunction_MathBoolAnd_2_1_Result; // 0x2482 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolAnd_2_RigVMFunction_MathBoolAnd_2_Result; // 0x2483 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_GreaterEqual_Result;                 // 0x2484 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_RigVMFunction_MathBoolNot_3_Result;  // 0x2485 (size: 0x1)
    bool Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_2_Condition; // 0x2486 (size: 0x1)
    float Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_2_True;   // 0x2488 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_2_False;  // 0x248C (size: 0x4)
    double Adjust_RFootHeight___Adjust_RFootHeight_DISPATCH_RigVMDispatch_If_1_False; // 0x2490 (size: 0x8)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Target;                // 0x2498 (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Current;               // 0x249C (size: 0x4)
    float Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_Velocity;              // 0x24A0 (size: 0x4)
    TArray<float> Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_SimulatedResult; // 0x24A8 (size: 0x10)
    TArray<FFloatSpringState> Adjust_RFootHeight___Adjust_RFootHeight_SpringInterp_SpringState; // 0x24B8 (size: 0x10)
    FVector Adjust_RFootHeight___Adjust_RFootHeight_Rotate_Vector_Vector__IO;         // 0x24C8 (size: 0x18)
    FTransform Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_OffsetTransform__IO; // 0x24E0 (size: 0x60)
    TArray<FCachedRigElement> Adjust_RFootHeight___Adjust_RFootHeight_OffsetTransformForItem_CachedIndex; // 0x2540 (size: 0x10)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_Result; // 0x2550 (size: 0x20)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_DISPATCH_RigVMDispatch_If_2_Result; // 0x2570 (size: 0x20)
    bool Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathBoolOr_Result; // 0x2590 (size: 0x1)
    bool Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathBoolAnd_Result; // 0x2591 (size: 0x1)
    bool Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathBoolNot_1_Result; // 0x2592 (size: 0x1)
    bool Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_DISPATCH_RigVMDispatch_If_2_Condition; // 0x2593 (size: 0x1)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionFromEuler_1_Result; // 0x25A0 (size: 0x20)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Rotate_Vector_Result;       // 0x25C0 (size: 0x18)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Inverse_Result;               // 0x25E0 (size: 0x20)
    FTransform Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_Transform;  // 0x2600 (size: 0x60)
    TArray<FCachedRigElement> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_GetTransform_CachedIndex; // 0x2660 (size: 0x10)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Inverse_Value;                // 0x2670 (size: 0x20)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_1_Result;              // 0x2690 (size: 0x8)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionToEuler_Result; // 0x2698 (size: 0x18)
    FQuat Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_RigVMFunction_MathQuaternionFromTwoVectors_Result; // 0x26B0 (size: 0x20)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_1_Value;               // 0x26D0 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_Result;                // 0x26D8 (size: 0x8)
    double Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Clamp_Value;                 // 0x26E0 (size: 0x8)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_Rotate_Vector_Vector__IO;   // 0x26E8 (size: 0x18)
    FVector Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_AngularVelocity; // 0x2700 (size: 0x18)
    TArray<FQuat> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_SimulatedResult; // 0x2718 (size: 0x10)
    TArray<FQuaternionSpringState> Adjust_LFoot_Rotation___Adjust_LFoot_Rotation_SpringInterpQuaternionV2_SpringState; // 0x2728 (size: 0x10)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_Result; // 0x2740 (size: 0x20)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_DISPATCH_RigVMDispatch_If_Result; // 0x2760 (size: 0x20)
    bool Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathBoolOr_Result; // 0x2780 (size: 0x1)
    bool Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathBoolAnd_Result; // 0x2781 (size: 0x1)
    bool Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathBoolNot_1_Result; // 0x2782 (size: 0x1)
    bool Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_DISPATCH_RigVMDispatch_If_Condition; // 0x2783 (size: 0x1)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionFromEuler_1_Result; // 0x2790 (size: 0x20)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Rotate_Vector_Result;       // 0x27B0 (size: 0x18)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Inverse_Result;               // 0x27D0 (size: 0x20)
    FTransform Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_Transform;  // 0x27F0 (size: 0x60)
    TArray<FCachedRigElement> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_GetTransform_CachedIndex; // 0x2850 (size: 0x10)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Inverse_Value;                // 0x2860 (size: 0x20)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_Result;              // 0x2880 (size: 0x8)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionToEuler_Result; // 0x2888 (size: 0x18)
    FQuat Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_RigVMFunction_MathQuaternionFromTwoVectors_Result; // 0x28A0 (size: 0x20)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_1_Value;               // 0x28C0 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_Result;                // 0x28C8 (size: 0x8)
    double Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Clamp_Value;                 // 0x28D0 (size: 0x8)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_Rotate_Vector_Vector__IO;   // 0x28D8 (size: 0x18)
    FVector Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_AngularVelocity; // 0x28F0 (size: 0x18)
    TArray<FQuat> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_SimulatedResult; // 0x2908 (size: 0x10)
    TArray<FQuaternionSpringState> Adjust_RFoot_Rotation___Adjust_RFoot_Rotation_SpringInterpQuaternionV2_SpringState; // 0x2918 (size: 0x10)
    FTransform RigVMModel___GetTransform_3_Transform;                                 // 0x2930 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_3_CachedIndex;                // 0x2990 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___Set_Transform_3_CachedIndex;               // 0x29A0 (size: 0x10)
    FTransform RigVMModel___OffsetTransformForItem_2_OffsetTransform__IO;             // 0x29B0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___OffsetTransformForItem_2_CachedIndex;      // 0x2A10 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_5_Transform;                         // 0x2A20 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_5_CachedIndex;        // 0x2A80 (size: 0x10)
    FVector RigVMModel___ClampSpatially_1_Result;                                     // 0x2A90 (size: 0x18)
    FVector RigVMModel___ClampSpatially_1_Value;                                      // 0x2AA8 (size: 0x18)
    float RigVMModel___ClampSpatially_1_Maximum;                                      // 0x2AC0 (size: 0x4)
    FTransform RigVMModel___GetTransform_4_1_Transform;                               // 0x2AD0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_4_1_CachedIndex;              // 0x2B30 (size: 0x10)
    FTransform RigVMModel___TwoBoneIKSimplePerItem_Effector__IO;                      // 0x2B40 (size: 0x60)
    FTransform RigVMModel___RigUnit_GetTransform_7_Transform;                         // 0x2BA0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_7_CachedIndex;        // 0x2C00 (size: 0x10)
    FVector RigVMModel___TwoBoneIKSimplePerItem_PoleVector;                           // 0x2C10 (size: 0x18)
    TArray<FCachedRigElement> RigVMModel___TwoBoneIKSimplePerItem_CachedItemAIndex;   // 0x2C28 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___TwoBoneIKSimplePerItem_CachedItemBIndex;   // 0x2C38 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___TwoBoneIKSimplePerItem_CachedEffectorItemIndex; // 0x2C48 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___TwoBoneIKSimplePerItem_CachedPoleVectorSpaceIndex; // 0x2C58 (size: 0x10)
    FTransform RigVMModel___OffsetTransformForItem_2_1_OffsetTransform__IO;           // 0x2C70 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___OffsetTransformForItem_2_1_CachedIndex;    // 0x2CD0 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_5_1_Transform;                       // 0x2CE0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_5_1_CachedIndex;      // 0x2D40 (size: 0x10)
    FVector RigVMModel___ClampSpatially_Result;                                       // 0x2D50 (size: 0x18)
    FVector RigVMModel___ClampSpatially_Value;                                        // 0x2D68 (size: 0x18)
    float RigVMModel___ClampSpatially_Maximum;                                        // 0x2D80 (size: 0x4)
    FTransform RigVMModel___GetTransform_4_Transform;                                 // 0x2D90 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_4_CachedIndex;                // 0x2DF0 (size: 0x10)
    FTransform RigVMModel___TwoBoneIKSimplePerItem_1_Effector__IO;                    // 0x2E00 (size: 0x60)
    FTransform RigVMModel___RigUnit_GetTransform_6_Transform;                         // 0x2E60 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_6_CachedIndex;        // 0x2EC0 (size: 0x10)
    FVector RigVMModel___TwoBoneIKSimplePerItem_1_PoleVector;                         // 0x2ED0 (size: 0x18)
    TArray<FCachedRigElement> RigVMModel___TwoBoneIKSimplePerItem_1_CachedItemAIndex; // 0x2EE8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___TwoBoneIKSimplePerItem_1_CachedItemBIndex; // 0x2EF8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___TwoBoneIKSimplePerItem_1_CachedEffectorItemIndex; // 0x2F08 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___TwoBoneIKSimplePerItem_1_CachedPoleVectorSpaceIndex; // 0x2F18 (size: 0x10)
    bool FindWhichFootIsOnFront___FindWhichFootIsOnFront_DISPATCH_RigVMDispatch_If_6_Result; // 0x2F28 (size: 0x1)
    bool FindWhichFootIsOnFront___FindWhichFootIsOnFront_Less_Result;                 // 0x2F29 (size: 0x1)
    FVector FindWhichFootIsOnFront___FindWhichFootIsOnFront_Subtract_1_Result;        // 0x2F30 (size: 0x18)
    FTransform FindWhichFootIsOnFront___FindWhichFootIsOnFront_GetTransform_1_Transform; // 0x2F50 (size: 0x60)
    TArray<FCachedRigElement> FindWhichFootIsOnFront___FindWhichFootIsOnFront_GetTransform_1_CachedIndex; // 0x2FB0 (size: 0x10)
    FVector FindWhichFootIsOnFront___FindWhichFootIsOnFront_Subtract_1_A;             // 0x2FC0 (size: 0x18)
    FTransform FindWhichFootIsOnFront___FindWhichFootIsOnFront_GetTransform_Transform; // 0x2FE0 (size: 0x60)
    TArray<FCachedRigElement> FindWhichFootIsOnFront___FindWhichFootIsOnFront_GetTransform_CachedIndex; // 0x3040 (size: 0x10)
    FVector FindWhichFootIsOnFront___FindWhichFootIsOnFront_Subtract_1_B;             // 0x3050 (size: 0x18)
    double FindWhichFootIsOnFront___FindWhichFootIsOnFront_Less_A;                    // 0x3068 (size: 0x8)
    bool FindWhichFootIsOnFront___FindWhichFootIsOnFront_DISPATCH_RigVMDispatch_If_7_Result; // 0x3070 (size: 0x1)
    bool FindWhichFootIsOnFront___FindWhichFootIsOnFront_Less_1_Result;               // 0x3071 (size: 0x1)
    FVector FindWhichFootIsOnFront___FindWhichFootIsOnFront_Subtract_1_1_Result;      // 0x3078 (size: 0x18)
    double FindWhichFootIsOnFront___FindWhichFootIsOnFront_Less_1_A;                  // 0x3090 (size: 0x8)
    FTransform CheckFootHit___CheckFootHit_GetTransform_5_Transform;                  // 0x30A0 (size: 0x60)
    TArray<FCachedRigElement> CheckFootHit___CheckFootHit_GetTransform_5_CachedIndex; // 0x3100 (size: 0x10)
    FVector CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_A;           // 0x3110 (size: 0x18)
    FVector CheckFootHit___CheckFootHit_Subtract_2_Result;                            // 0x3128 (size: 0x18)
    FVector CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_HitLocation;        // 0x3140 (size: 0x18)
    bool CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_bHit;                  // 0x3158 (size: 0x1)
    FVector CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_HitNormal;          // 0x3160 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_WorkData; // 0x3178 (size: 0x10)
    FTransform CheckFootHit___CheckFootHit_GetTransform_5_1_Transform;                // 0x3190 (size: 0x60)
    TArray<FCachedRigElement> CheckFootHit___CheckFootHit_GetTransform_5_1_CachedIndex; // 0x31F0 (size: 0x10)
    FVector CheckFootHit___CheckFootHit_RigVMFunction_DebugLineNoSpace_1_1_A;         // 0x3200 (size: 0x18)
    FVector CheckFootHit___CheckFootHit_Subtract_2_1_Result;                          // 0x3218 (size: 0x18)
    FVector CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_1_HitLocation;      // 0x3230 (size: 0x18)
    bool CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_1_bHit;                // 0x3248 (size: 0x1)
    FVector CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_1_HitNormal;        // 0x3250 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> CheckFootHit___CheckFootHit_SphereTraceByTraceChannel_1_WorkData; // 0x3268 (size: 0x10)
    FTransform RigVMModel___GetTransform_Transform;                                   // 0x3280 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_CachedIndex;                  // 0x32E0 (size: 0x10)
    FTransform RigVMModel___GetTransform_1_Transform;                                 // 0x32F0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_1_CachedIndex;                // 0x3350 (size: 0x10)
    FName RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun;                    // 0x3360 (size: 0x8)
    FTransform RigVMModel___RigUnit_GetTransform_Transform;                           // 0x3370 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_CachedIndex;          // 0x33D0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_CachedIndex;          // 0x33E0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_1_CachedIndex;        // 0x33F0 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_2_Transform;                         // 0x3400 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_2_CachedIndex;        // 0x3460 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_2_CachedIndex;        // 0x3470 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_1_Transform;                         // 0x3480 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_1_CachedIndex;        // 0x34E0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_3_CachedIndex;        // 0x34F0 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_3_Transform;                         // 0x3500 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_3_CachedIndex;        // 0x3560 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_4_CachedIndex;        // 0x3570 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_4_Transform;                         // 0x3580 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_4_CachedIndex;        // 0x35E0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_5_CachedIndex;        // 0x35F0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_6_CachedIndex;        // 0x3600 (size: 0x10)
    FTransform RigVMModel___To_World_2_1_World;                                       // 0x3610 (size: 0x60)
    FTransform RigVMModel___GetTransform_2_2_2_1_Transform;                           // 0x3670 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_2_2_2_1_CachedIndex;          // 0x36D0 (size: 0x10)

}; // Size: 0x36E0

#endif
