#ifndef UE4SS_SDK_VarragKasorgPuzzle_03_animbp_HPP
#define UE4SS_SDK_VarragKasorgPuzzle_03_animbp_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_240;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_241;                                                         // 0x000C (size: 0x8)
    int32 __IntProperty_242;                                                          // 0x0014 (size: 0x4)
    FName __NameProperty_243;                                                         // 0x0018 (size: 0x8)
    int32 __IntProperty_244;                                                          // 0x0020 (size: 0x4)
    FName __NameProperty_245;                                                         // 0x0024 (size: 0x8)
    int32 __IntProperty_246;                                                          // 0x002C (size: 0x4)
    FName __NameProperty_247;                                                         // 0x0030 (size: 0x8)
    int32 __IntProperty_248;                                                          // 0x0038 (size: 0x4)
    FName __NameProperty_249;                                                         // 0x003C (size: 0x8)
    int32 __IntProperty_250;                                                          // 0x0044 (size: 0x4)
    FName __NameProperty_251;                                                         // 0x0048 (size: 0x8)
    int32 __IntProperty_252;                                                          // 0x0050 (size: 0x4)
    FName __NameProperty_253;                                                         // 0x0054 (size: 0x8)
    int32 __IntProperty_254;                                                          // 0x005C (size: 0x4)
    FName __NameProperty_255;                                                         // 0x0060 (size: 0x8)
    int32 __IntProperty_256;                                                          // 0x0068 (size: 0x4)
    float __FloatProperty_257;                                                        // 0x006C (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_258;                               // 0x0070 (size: 0x2C)
    float __FloatProperty_259;                                                        // 0x009C (size: 0x4)
    bool __BoolProperty_260;                                                          // 0x00A0 (size: 0x1)
    EAnimSyncMethod __EnumProperty_261;                                               // 0x00A1 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_262;                             // 0x00A2 (size: 0x1)
    FName __NameProperty_263;                                                         // 0x00A4 (size: 0x8)
    FName __NameProperty_264;                                                         // 0x00AC (size: 0x8)
    FName __NameProperty_265;                                                         // 0x00B4 (size: 0x8)
    int32 __IntProperty_266;                                                          // 0x00BC (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_267;                                        // 0x00C0 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00E0 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0160 (size: 0x18)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0178 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;    // 0x01A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;    // 0x01D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;    // 0x0208 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;    // 0x0238 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;    // 0x0268 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x0298 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x02C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x02F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x0328 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x0358 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x0388 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x03B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x03E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x0418 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x0448 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x0478 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x04A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_8;       // 0x04D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;          // 0x0508 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_7;       // 0x0538 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;          // 0x0568 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;       // 0x0598 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;          // 0x05C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x05F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;          // 0x0628 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x0658 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x0688 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x06B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x06E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0718 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x0748 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0778 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x07A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x07D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0808 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0838 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0868 (size: 0x30)

}; // Size: 0x898

class UVarragKasorgPuzzle_03_animbp_C : public UDoorAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03C0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x03C8 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x03D0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03D8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x03F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0420 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0448 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0470 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0498 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x04C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x04E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0510 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0538 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0560 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0588 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x05B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x05D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0600 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0628 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0650 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0678 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x06A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x06E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x0708 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x0750 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x0770 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x07B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x07D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x0820 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0840 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x0888 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x08A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x08F0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0910 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x0958 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0978 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x09C0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x09E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x0A28 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x0A48 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x0B10 (size: 0x48)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_837C10B8483400C983042AB452EB0E68();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_FD9B3F094FE657FC0AC4DCA886D06BF3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_DA91FA8A4D7FC722E24057842A6047AF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_47A5C6E94A04E16345497699E9B8786E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_C630D99141F9824FF82EA98EB048A09F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_D057CCF14B48EBC5700425829F0C8111();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_D2DFDFBE488A2CAF61F52D802289CD13();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_056217A440DE06479BA7E89C5512148D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_DC641C944EBDB7893940C8B2404A22FF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_CA4C1DBB48A31BA4DD5F58B7F3EAFDB1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_73927885431394531FE54CA69933CCC4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_22D23AF14CADFF0411F70A80F1D19BEE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_269C7FD64EAC9FBE330AF3BC425688C2();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_2693959947D8AECFFF11B6A5717D1C8A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_EF46A6224B56009F82880EAEC51C77FF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_E816067D4BB56317CD42AC84FE687D2E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_VarragKasorgPuzzle_03_animbp_AnimGraphNode_TransitionResult_732F881C430960FAED25EC99EE916691();
    void AnimNotify_EndIdleEvent();
    void AnimNotify_EndIdleEventFinal();
    void ExecuteUbergraph_VarragKasorgPuzzle_03_animbp(int32 EntryPoint);
}; // Size: 0xB58

#endif
